{
  "items": [
    {
      "id": "2025-07-11-developer-s-note-13-publishing-service-termination-and-developer-transfer",
      "title": "Developer's Note #13: Publishing Service Termination and Developer Transfer",
      "date": "07-11-2025",
      "date_iso": "2025-07-11T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2025-07-11-developer-s-note-13-publishing-service-termination-and-developer-transfer/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp\" class=\"fr-fic\"><br><br>Hello. Masters!This is Moonsoo Hyun, the producer of OUTERPLANE.Following our greeting in the Developer’s Note for the 2nd anniversary update, we are back with news for the first time in about two months.&nbsp;While there were certainly areas that could have been improved,we sincerely hope our Masters enjoyed the events and content we had prepared.Today, we would like to share some important news regarding changes to the future direction of our service operations.</p><hr><p><br><strong>[Publishing Service Termination and Developer Transfer]</strong><br><strong><u>1. Publishing Service Termination</u></strong><br>Thanks to the collaboration with our publisher, Smilegate,<br>and the unwavering support from our Masters, we have been able to providea stable service as OUTERPLANE has continued to grow, step by step.We would like to take this opportunity to sincerely thank everyone who has been with us on this journey.Starting on September 23, 2025, service operations will be transferredfrom Smilegate to VAGames, the game’s developer.While this news may come as a surprise,this decision was made after close and careful discussions with Smilegate.To pursue new challenges and directions, the development team has decided to take over direct service of the game.As the developer, we will move forward with an even stronger sense of responsibility and do our utmost to deliver an even better gameplay experience in OUTERPLANE.If you choose to join us on this new journey following the service transfer,we promise to repay your support with an even more refined and rewarding version of OUTERPLANE.</p><hr><p><br><strong><u>2. Developer Service Transfer</u></strong><br>Due to the change in service provider, Masters who wish to continue playing the game<br>will need to complete the transfer process via the in-game “Service Transfer” feature, which will be added in a future update.The transfer process is outlined below, and further details will be provided at the time of the update.&nbsp;</p><table><tbody><tr><td><p><br>1) When you log into the game lobby, a “Service Transfer” banner will appear on the screen.<br>You can tap this banner to access the transfer screen.(This screen can also be accessed through the in-game settings.)2) Please review the information on the Service Transfer screen and complete the consent process.3) Once you have given your consent, a transfer code will be issued automatically.You may take a screenshot of the code or send it to your email. Please note that the code can only be sent once.4) After the service transfer, enter the transfer code on the login screen of the new version of the game.This will link your existing account information, allowing you to continue your gameplay seamlessly.&nbsp;</p><p><strong>* The transfer code can also be entered via [Settings → Account] in the game.</strong></p><br></td></tr></tbody></table><p><br>Transfer applications will only be accepted during the designated period.<br>Masters who complete the transfer during this time will receive a Selection Ticket that lets you choose a Demiurge hero, along with various other rewards and benefits.Please make sure to complete the process on time.</p><p><br>Even after the application period has ended, we are considering offering temporary support for transfers<br>and gameplay through alternative methods.However, if you do not complete the transfer within the designated period, your access to the game may be restricted. We therefore strongly recommend completing the transfer on time.<strong>* For more information about the transfer, </strong><br><strong>&nbsp; &nbsp;please refer to the </strong><a href=\"https://page.onstove.com/outerplane/en/view/10859678\" target=\"_blank\" class=\"card__content__link\" rel=\"noopener noreferrer\"><strong>[▶ Advance Notice of OUTERPLANE Service Transfer ◀]</strong></a><strong>.</strong><br><br></p><hr><p><br><strong><u>3. Server Merge</u></strong><br><strong><u>1) Asia I / Asia II / Korea Server Merge</u></strong><br>To ensure stable service operations, the five currently active servers will be reorganized as shown below.</p><table><tbody><tr><td><p><strong>Server</strong></p></td><td><p><strong>Reorganization Details</strong></p></td></tr><tr><td><p>Korea</p></td><td><p>[Global 2] Server Name Change</p></td></tr><tr><td><p>Global</p></td><td><p>[Global 1] Server Name Change</p></td></tr><tr><td><p>Japan</p></td><td><p>No Changes</p></td></tr><tr><td><p>Asia I</p></td><td><p>Merged into [Global 2]</p></td></tr><tr><td><p>Asia II</p></td><td><p>Merged into [Global 2]</p></td></tr></tbody></table><p><br>After the service transfer is complete, Masters from the Asia I and Asia II servers<br>will automatically continue playing on the Global 2 server.We will strive to provide a stable gameplay experience.Your existing data will remain safe after the merge, butsome Dungeon Clear Info and&nbsp;previously saved ranking records may be reset.We will do our best to minimize confusion and ensure smooth gameplay.We kindly ask for your understanding regarding any unexpected issues that may arise.</p><hr><p><br><strong><u>4. Future Development and Update Plans</u></strong><br>We believe that this service transfer is not the end of change, but rather the beginning of a new chapter.<br>Our development team remains committed to the ongoing improvement and expansion of OUTERPLANE.That said, our top priority is to ensure service stability after the transfer.To that end, we plan to adjust the update schedule leading up to the transfer,and kindly ask for your understanding that some updates originally planned through September may be rescheduled.<strong><u>1) Before the Service Transfer</u></strong><br>The summer event, long anticipated by many of our Masters, was originally planned for mid-July.<br>However, we are now considering holding it after the service transfer.That said, the Swimsuit Costumes for Kanon and Ame, originally plannedfor the summer event, will be added first through the July and August Battle Passes.Season 3’s main story is set to conclude in Area 9, and we aim to release this updatein August to ensure it can be completed before the service transfer.In addition, two new heroes are planned for release before the service transfer.However, please note that this schedule may change depending on the transfer timeline.Since ensuring service stability is our top priority, program updates,&nbsp;improvements, and new content additions will be kept to a minimum until the transfer is complete.<strong><u>2) After the Service Transfer</u></strong><br>Through this service transfer, we aim to go beyond a simple operational change and<br>take this opportunity to further elevate the game’s core enjoyment and overall quality.Following the transfer, more than six new heroes, already planned through early 2026, will be gradually added.We also plan to enhance and expand various content based on feedback from our Masters.In addition, with new content and improvements to the growth system, OUTERPLANE will gradually evolve into a more PvE-focused RPG.Building on this direction, we will continue to steadily develop the game, and we hope for your continued interest and support.To summarize our key post-transfer plans:</p><table><tbody><tr><td><p><br>1. Ongoing regular updates and development of new content</p><p>2. Balance adjustments and UI/UX improvements based on player feedback</p><p>3. Focus on ensuring a stable operating environment and enhancing service quality</p><p>4. Special rewards and events planned to commemorate the service transfer</p><br></td></tr></tbody></table><hr><p><br><strong><u>5. Closing Remarks</u></strong><br>This service transfer and server merge will mark an important turning point for both us and our Masters.<br>But one thing is certain.OUTERPLANE’s journey is not coming to an end. It’s a new beginning as we venture into an even more expansive world.with greater responsibility and sincerity, doing our utmost to deliver an even better gameplay experience.To show our appreciation for the support you have given us, we have prepared a special thank-you giftfor all Masters who complete the transfer process, so you can begin this new journey with even more excitement.We sincerely hope you’ll continue your adventure with us,as we journey deeper into our otherworld travels.</p><table><tbody><tr><td><p><strong><br>[Developer's Note Thank-You Gift]</strong></p><p>&nbsp;- Coupon Code: OUTERNOTE13</p><p>&nbsp;- Schedule: ~8/10 (Sun) 23:59 UTC</p><p>&nbsp;- Coupon Rewards: Ether x500</p><br></td></tr></tbody></table><p><br>Thank you.</p></div>",
      "images": [
        "/developer-notes/2025-07-11-developer-s-note-13-publishing-service-termination-and-developer-transfer/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp"
      ],
      "uid": "developer-notes:2025-07-11-developer-s-note-13-publishing-service-termination-and-developer-transfer"
    },
    {
      "id": "2025-04-30-developer-s-note-12-may-update-notice",
      "title": "Developer's Note #12: May Update Notice",
      "date": "04-30-2025",
      "date_iso": "2025-04-30T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2025-04-30-developer-s-note-12-may-update-notice/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp\" class=\"fr-fic\"><br><br></p><p>Hello. Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.</p><p><br>With heartfelt gratitude, we are proud to announce that OUTERPLANE is celebrating its 2nd anniversary.<br>We\n would like to take this opportunity to sincerely thank all our Masters \nfor the wholehearted support and caring interest you have shown us over \nthe past two years.Looking back, the excitement and nervousness we felt on launch day still feel fresh in our memories.\n Every moment we have shared with you since then has been an invaluable \nexperience for our development team, a guiding force that has helped us \ngrow and become a meaningful part of our journey.Of course, there were times we fell short.But thanks to your feedback, encouragement, and even your honest criticism, we've been able to grow, one step at a time.We firmly believe that OUTERPLANE has come this far because of your presence and support.To celebrate this meaningful 2nd anniversary, we'll be hosting the third OUTERPLANE Festival,along with exciting events and content updates prepared to return the love our Masters have shown us.In\n hopes that this 2nd anniversary, prepared with heartfelt sincerity, \nwill go beyond a simple celebration and bring you small but certain joy,\n we would like to introduce what we have prepared for you.</p><hr><p><strong>2nd Anniversary Event - [Mirsha Festival]</strong></p><p>&nbsp;-\n Mirsha Festival will be held in celebration of the 2nd anniversary. The\n event offering various rewards, and even new Masters can join in on the\n fun.<br><br><strong><u>1) Festival Bingo</u></strong><br>&nbsp;:\n Throughout the festival period, players can complete various missions \nto collect Bingo Points. Exceptional rewards such as fully grown Hero \nSelection Ticket and a 6★ Talisman Selection Chest are available, so we \nlook forward to your participation.</p><p><br><strong><u>2) Demiurge Contract</u></strong></p><p>&nbsp;:\n This event allows you to select one Demiurge hero of your choice and \nraise them to 5★. Celebrate the Mirsha Festival by raising a powerful \nDemiurge hero!.</p><p><br><strong><u>3) Showdown! Frost Elves</u></strong></p><p>&nbsp;:\n Sweep the mischievous elves and obtain a large amount of gold and gear \nrewards. A 6★ armor drop is guaranteed, and you can also obtain new \nlegendary gear exclusive to Frost Elves. Frost Elf-exclusive equipment \nobtained from this dungeon has a very low enhancement cost, making it a \ngreat aid for Masters aiming for rapid growth.</p><p><br><strong><u>4) Limited Conquest Request</u></strong></p><p>:\n You can earn Scientific Inheritance based on the amount of stamina \nconsumed while proceeding across the entire Mirsha region. Scientific \nInheritance contains rewards that will delight both new Masters and \nexperienced Masters, such as the Transistone Set, Upgrade/Trust Level \ngrowth items, quirk enhancement materials, exclusive equipment, and \ntalisman enhancement materials. Don't miss out and claim all the event \nrewards during the festival period.</p><p><strong>[2nd Anniversary Event Story - A Congratulations to our Dearest]</strong><br>&nbsp;-\n A story about Eva preparing a celebration for K, who has been through \ntough times. A lighthearted story and plenty of rewards, including \nspecial costume gifts for K and Monad Eva! Visit the event shop, which \nrefreshes daily, to obtain and use a variety of helpful items.</p><p><img src=\"/developer-notes/2025-04-30-developer-s-note-12-may-update-notice/241a53d386f74ef89110a0ca54f2a4d0.webp\" class=\"fr-fic\"><br><br></p><p><strong>[New Limited Hero and Demiurge Hero]</strong><br>\n &nbsp;- To celebrate the festival period, a new festival-limited hero \nand a new Demiurge hero will be added during maintenance on May 7 and \nMay 20.<br>&nbsp;</p><p><strong>[Mirsha Supporters Event Added]</strong><br>&nbsp;- Introducing a new event that will begin with the festival and remain available afterward.<br>▶ [Mirsha Supporters] Event Details:\n The [Mirsha Supporters] event for new Masters will begin in a relay \nformat after the current 7-day Check-In/Mission event ends. In this \nevent, you can choose either the Light or Dark element and obtain \ncarefully selected heroes aligned with your choice.</p><p><br><strong>[How to Play]</strong><br> - Depending on the element you choose, you can obtain up to 3 heroes during one week of missions.<strong>&nbsp;</strong><br> - Weekly missions will continue in a relay format, and a new hero will join you upon each completion.<br>Plenty of rewards will also be provided to help you grow your heroes, so try to build an even stronger team!<b>&nbsp;※&nbsp;\n Existing Masters will not be able to participate in this event's \nmissions, but will receive the following rewards instead. Please take \nnote.</b></p><p><br><strong>★Rewards Details★</strong><br> - Light/Dark 3★ Hero Selection Ticket x2<br> - Intermediate Skill Manual x50 / Professional Skill Manual x20 - Claim Period: 05/07/25 after the maintenance – 25/06/06<b>&nbsp;※ Rewards will be sent via in-game mailbox, so don't forget to claim them.</b><br><br></p><p><img src=\"/developer-notes/2025-04-30-developer-s-note-12-may-update-notice/b36fef04f24d4dc18f2830ab48a3f1bd.webp\" class=\"fr-fic\"><br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p><p><strong>[Free Recruitment Opportunity to Celebrate Mirsha Festival]</strong>&nbsp;<br>\n - To celebrate the 2nd anniversary, up to 200 free recruitment \nopportunities will be provided through various event \nrewards.&nbsp;&nbsp;Don’t miss your chance to recruit for free!<br> &nbsp; &nbsp;Round 1: 05/07/25 (Wed) after the maintenance – 06/03/25 (Tue) before the maintenance &nbsp; &nbsp;&nbsp;ㄴA total of 100 [Limited Recruitment Tickets] will be given out. &nbsp; &nbsp;Round 2: 05/07/25 (Wed) after the maintenance – 06/03/25 (Tue) before the maintenance &nbsp; &nbsp;ㄴA total of 1,000 [Call of the Demiurge (Event)] will be given out.</p><p><b>[Upcoming Content Updates]</b></p><p><strong>1. Monad Gate</strong><br>First of all, we sincerely apologize to the Masters who had been looking forward to the update for its delay.<br>Monad\n Gate, which was previously introduced in the Developer's Note, is \nfinally here! We will finally be able to introduce it to our Masters \nstarting with the May 20 update. Monad Gate features roguelike \nelements.&nbsp; &nbsp;Travel through a parallel version of Mirsha with \nEva and work to restore the twisted timeline to its original state. \nUnlike the previous endgame content, it is being developed with a lower \ndifficulty level that all Masters can enjoy. We're working hard on \nbalancing and development to ensure that Masters of all levels can have \nfun, so we hope you're looking forward to it!&nbsp;</p><p><strong>2. Planned for Improvement</strong><br>- As new content is added, adjustments will be made to reduce fatigue from existing content and ease the overall gameplay load.<br>:\n As part of the April 22 update, the difficulty of the Irregular \nInfiltration Operation was reduced, and rewards for both Irregular Cell \nand the Terminus Isle were increased. In addition, features such as \nPursuit Operation Sweep and other improvements are scheduled to be added\n in July.Finally, in response to feedback from many Masters, \nfeatures such as \"Reforge All\" and \"Enhance All\" will be added in July \nto make Gear Reforge and Skill Enhance more convenient, alongside the \npreviously requested inventory expansion.(* Content and improvement schedules are subject to change depending on the development status.)</p>&nbsp;<hr><p><br><strong>[Developer's Note Thank-You Gift]</strong></p><p>&nbsp;- Coupon Code: OUTERNOTE12<br>&nbsp;- Schedule: ~5/28 (Wed) 23:59 UTC<br>&nbsp;- Coupon Rewards: Ether x500</p><p>Thanks to your support, OUTERPLANE is celebrating its 2nd anniversary. <br>We sincerely thank you for every moment you have shared with us, and we wish you continued health and happiness.</p><p>- Producer Moonsoo Hyun -</p></div>",
      "images": [
        "/developer-notes/2025-04-30-developer-s-note-12-may-update-notice/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp",
        "/developer-notes/2025-04-30-developer-s-note-12-may-update-notice/241a53d386f74ef89110a0ca54f2a4d0.webp",
        "/developer-notes/2025-04-30-developer-s-note-12-may-update-notice/b36fef04f24d4dc18f2830ab48a3f1bd.webp"
      ],
      "uid": "developer-notes:2025-04-30-developer-s-note-12-may-update-notice"
    },
    {
      "id": "2025-01-23-developer-s-note-11-planned-improvements-for-2025",
      "title": "Developer's Note #11: Planned Improvements for 2025",
      "date": "01-23-2025",
      "date_iso": "2025-01-23T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2025-01-23-developer-s-note-11-planned-improvements-for-2025/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp\" class=\"fr-fic\"><br><br></p><p>Hello, Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.<br>This marks our first greetings in the year 2025 for our Masters.&nbsp;&nbsp;We sincerely wish you a healthy and happy year ahead.&nbsp;Our OUTERPLANE development team has been analyzing play data and feedback from our Masters in 2024 to explore ways to provide even better experiences and enjoyment in 2025.Contrary to our predictions, we've found that certain areas caused discomfort for Masters, and there were discrepancies between the most used content and actual participation, so we are working on how to address these issues. We are also considering how to offer new and enjoyable content for those who have been playing OUTERPLANE long term.First, to ensure that long time OUTERPLANE Masters do not experience inconvenience or fatigue from the game, we will continue making improvements to convenience, and based on the data we've gathered, we aim to develop future systems/content in a way that allows more Masters to enjoy the game.Regarding the previously mentioned new content, Monad Gate, we would like to sincerely apologize for not being able to release it as promised due to the need to refine it based on the data from the newly introduced and improved content. We will work to release it at a later date with enhanced quality.&nbsp;Today, we've prepared a developer's note to share information about the planned improvements for the first quarter of 2025.</p><hr><p><strong>[Guild Raid and World Boss Improvements]</strong></p><p><strong>1) <u>Guild Raid</u></strong><br>While the Guild Raid has been running in its existing format for over a year, <br>two main issues were identified through feedback from Masters and actual play data.The first issue is that new Masters are confused about whether to focus on the main boss or the sub-boss. The second issue is that the overall difficulty has been too high for new Masters, and too low for those who have already progressed fully, creating an imbalance.&nbsp;In\n particular, once Masters had progressed to a certain level, they could \nfix all of their Geas to red and achieve maximum scores, which reduced \nthe differentiation in scores and made the content feel more like a \nchore.To address these problems, we carried out the first phase of improving the Guild Raid, and after the changes, we saw an increase in participation compared to before.However, there were still areas that needed further adjustment, so we will continue to refine the balance and improve the Geas system based on play data after improvements.<strong>2) <u>World Boss</u></strong><br>The\n World Boss, initially planned as endgame content, faced an issue of low\n participation, which was contrary to our expectations. The main causes \nwere the pressure of needing to invest in 12 heroes and the loss of \ninterest <br>when players used under-leveled heroes, leading to rank drops.To address these issues, we lowered the entry difficulty in lower leagues by adjusting the supporter damage and making players face only one boss at a time. Additionally,\n by offering the experience of being ranked 1st in the lower league \nafter defeating a boss and providing rewards immediately upon clearing \nthe league, we aimed to increase motivation to play.With these improvements, we've confirmed that the entry barrier for the content has lowered, and participation has increased. This approach will be applied to future rotating World Boss content as well. Furthermore, to offer new goals to existing owners, a new costume will be added soon. We appreciate your continued interest.</p><p><br><strong>[Planned Improvements for the First Half of the Year]</strong></p><p>Improvements, such as the Terminus Isle sweep feature and the Antiparticle Generator lobby rewards, <br>have already been partially implemented. <br>Additionally, other improvements, including the following items, will be gradually updated.<strong>1) <u>Removal of Clear Tickets&nbsp;</u></strong><br>The current system lacks quantity for new Masters, hindering smooth gameplay, <br>while long term players are left with largely useless Clear Tickets. As a result, we plan to remove Clear Tickets. In the future, sweeps will only require stamina, and any Clear Tickets you currently own can be exchanged for gold.<strong>2) <u>Hero Transcendence Revamp</u></strong><br>To complement the piece farming and short term goal of transcending through the Doppelgänger dungeon, <br>an intermediate transcendence stage will be added between the 5★ and 6★ transcendence processes. This change will allow for gradual stat increases throughout the transcendence process. While\n the final stats for the 6★ transcendence will remain unchanged, once \nyou collect at least one hero's worth (150 pieces), their stats will \ncontinue to increase to ensure there are no balance concerns.<strong>3) <u>H</u><u>ero Recruitment Revamp</u></strong><br>The [Custom Recruitment], which was previously offered through past events, <br>will now be added to replace [Normal Recruitment]. This improvement will make it easier for players to recruit their desired heroes compared to before.<strong>4) <u>Auto Dismantle Gear Added</u></strong><br>The feature that automatically dismantles gear below a set quality will be updated.<br><strong>5) <u>Guide Quest Improvements</u></strong><br>Overall UI improvements will be made to enhance visibility, <br>and some missions will be adjusted to provide a better guide quest experience.&nbsp;<strong>6) <u>Challenge! Special Request: (Ecology Study/Identification) Event Improvements</u></strong><br>The difficulty of missions for milestone rewards will be slightly lowered.<br><strong>7) <u>Currency Dungeon New Difficulty Added</u></strong><br>The previously announced expansion of the currency dungeon difficulty, <br>which has been pushed back due to prioritization, will be implemented to improve resource gain.<strong>8) <u>Guild Security Area Improvements</u></strong><br>The maximum level will increase based on the Master's progression, <br>while the daily challenge attempts will decrease to once per day. As a result, more rewards can be obtained with fewer attempts.<strong>9) <u>Regarding Stamina Restoration</u></strong><br>There have been numerous complaints from monthly subscription Masters <br>regarding the inconvenience of having to recharge stamina 10 times in a row. This feature will be removed and improved.&nbsp;<strong>10) <u>Regarding Terminus Isle</u></strong><br>The currency required to change the weather will be changed from Ether to Gold, <br>and monthly subscription owners will be able to select the weather.Additionally, the drop rates for Effectium/Quirk currency will slightly increase.</p><p><br><strong>[Gnosis Dahlia Return Notice]</strong></p><p>- In 2025, the beloved [Gnosis Dahlia] will return from 1/24/25 — 2/11/25.&nbsp;<br>&nbsp;\n &nbsp;Please look forward to the [Moment Ring: The Eternal Preserver] \nevent dungeon that comes with the return of [Gnosis Dahlia].&nbsp;&nbsp;</p><p><br><strong>[OUTER Reward Board Event Added</strong><strong>]</strong></p><p>- For 2025, a new event format will be added.<br>&nbsp; &nbsp;The [OUTER Reward Board] is an event where players can exchange reward points <br>&nbsp; &nbsp;earned by playing [Adventure/Event Dungeon Hard Mode] or [Special Request Stage 8 or higher] for milestone rewards.&nbsp; &nbsp;Various rewards will be available, including 3★ [Regina] and [Caren] pieces, [Limited Recruitment Tickets], &nbsp; &nbsp;and [Special Recruitment Tickets], so please look forward to it.&nbsp;</p><p><br><strong>[Collaboration Announcement]</strong></p><p>&nbsp;- We're preparing a collaboration to provide Masters with a uniquely fun experience!<br>&nbsp;Look forward to the exploits of otherworldly heroes unfolding in Mirsha.</p><hr><p><strong>[Developer's Note Thank-You Gift]</strong></p><p>&nbsp;- Coupon Code: OUTERNOTE11</p><p>&nbsp;- Schedule: 1/23 (Thu) 3:00 – 2/23 (Sun) 23:59 UTC</p><p>&nbsp;- Coupon Rewards: Ether x500<br><br>We will do our best to bring new fun and enjoyment to Masters in 2025.We deeply apologize for the recent version stability issues that caused inconvenience,&nbsp;and we will continue to work hard to provide an improved service.We sincerely thank all Masters for their continued support of OUTERPLANE,and we will do our best to ensure that you continue to enjoy OUTERPLANE in 2025.- Producer Moonsoo Hyun -  </p></div>",
      "images": [
        "/developer-notes/2025-01-23-developer-s-note-11-planned-improvements-for-2025/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp"
      ],
      "uid": "developer-notes:2025-01-23-developer-s-note-11-planned-improvements-for-2025"
    },
    {
      "id": "2024-12-13-developer-s-note-10-december-update-notice",
      "title": "Developer's Note #10: December Update Notice",
      "date": "12-13-2024",
      "date_iso": "2024-12-13T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2024-12-13-developer-s-note-10-december-update-notice/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp\" class=\"fr-fic\"><br><br></p><p>Hello, Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.<br>The end of 2024 is approaching. How is the year going for you?&nbsp;Our development team is hard at work preparing for the final update of the year and the first update of 2025.In this 10th Developer's Note, we will guide you through the December update&nbsp;and share our final greetings for 2024.</p><hr><p><strong>[Limited-time Seasonal Hero 'Holy Night's Blessing Dianne' Update]</strong></p><p>In celebration of Christmas, the limited-time seasonal hero [Holy Night's Blessing Dianne] will be released.<br>[Holy Night's Blessing Dianne] is a Fire/Ranger hero who can gain increased stat effects every turn without duplicates. <br>True to the Santa theme, she has the skill \"Winter Night's Blessing,\" which allows her to gift all of her increased stat effects to all allies.She was designed with the expectation of fulfilling both a secondary DPS and supporter role in general PVE.We've also prepared the following rewards for an event to acquire and grow this limited hero, so we hope you'll join us in welcoming our newest hero, Dianne.<strong>1)&nbsp; <u>[Holy Night's Blessing Dianne] Recruitment Support Event</u><br></strong>- To help you recruit the charming Santa-themed Holy Night's Blessing Dianne,<br>&nbsp; we will provide 30 Limited Recruitment Tickets through check-in events, Christmas check-in events, and seasonal coupons.<br>&nbsp; After obtaining [Holy Night's Blessing Dianne], you can earn 150 hero pieces as rewards by completing achievements, &nbsp; so don't miss this opportunity for transcendence!<strong>2)&nbsp; &nbsp;<u>New Event Dungeon [A Midnight Winter’s Dream]</u></strong><br>- In celebration of the release of [Holy Night's Blessing Dianne], <br>&nbsp; an event dungeon featuring Dianne as the protagonist will be available. &nbsp; Join her in the Christmas story unfolding in Sacreed, and obtain Christmas costumes for Tamara and Charlotte, &nbsp; who have transformed into Rudolphs.<strong>[New Demiurge Hero 'Gnosis Beth' Update]</strong></p><p>- The new Demiurge hero [Gnosis Beth] will be released in the last update of 2024 on December 31. <br>&nbsp; [Gnosis Beth] is a Light/Ranger hero who uses a new type of continuous damage to turn the battlefield <br>&nbsp;&nbsp;in your favor and enhance opportunities to perform actions for all allies. &nbsp;&nbsp;Expect her to be a powerful presence in PVP, while also performing exceptionally in PVE.  &nbsp;&nbsp;Look forward to the last new hero of 2024, [Gnosis Beth]. * [Gnosis Beth] will be available for permanent recruitment through the Demiurge Recruit System after release.<strong>[Upcoming Content for the 12/31 Update]</strong></p><p><strong>1) <u>New Year's Event Dungeon [Goddess of Fortune]</u></strong><br>- An event story dungeon will open to welcome 2025, bringing plenty of luck to Masters.<br><strong>2) <u>Adventure &gt; Season 3 Story Area</u></strong><br>- Following the previous update, we are excited to share more of the story from the third area in Eseph.<br>&nbsp; &nbsp;Please look forward to the unfolding story on the last day of December!<strong>[Quality of Life Improvements]</strong></p><p>- The following quality of life improvements will be implemented. <br>&nbsp; &nbsp;ㄴWhen performing a breakthrough for gear, you will now be able to check gear details and unlock it <br>&nbsp; &nbsp; &nbsp; &nbsp; by long tapping on the right side of the screen. &nbsp; &nbsp;ㄴ A lock/unlock feature will be added to gear that is being dismantled or sold. \n &nbsp; &nbsp;ㄴ Sweep All button will be added to the Memorial Match \nsweep function, eliminating the need for individual selections.&nbsp;\n &nbsp;ㄴ A feature will be added to directly apply the team formation of\n other Masters for dungeons that provide clear info.  &nbsp; &nbsp;(* Please note that non-owned heroes are excluded from the changes.)&nbsp;\n &nbsp;ㄴ The search guide pop-up in the lobby will be improved to allow \nchecking all at once. ㄴYou will now be able to obtain rewards&nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; from the Antiparticle Generator in the lobby\n without entering the Base. &nbsp; &nbsp;ㄴ A winning streak system will be added to the Arena, and the equipped gear in the Arena Shop will be revamped.<strong>[Demiurge Mission and Recruitment Event Changes]</strong></p><p>- To enhance your enjoyment of the long-running/recurring Demiurge Mission event, <br>&nbsp; &nbsp;the following changes will be made after the 12/31 update. </p><p> -&nbsp; Adjustments <br>ㄴ(<u><strong>Old</strong></u>) Obtain event currency (Call of the Ruler) through three missions <br>ㄴ(<strong><u>New</u></strong>) Demiurge recruitment will be available for free once per day </p><p>Even with free Demiurge recruitment, Demiurge mileage will accumulate just like with default recruitment, <br>so it is expected that you will be able to obtain your desired heroes more reliably than before.</p><p>Additionally, the Recruitment Tickets from the new Master 3-day check-in event and the area clear events <br>will also be changed to mileage-accumulating tickets.<br>We kindly ask for your understanding regarding these changes, as they are intended to provide more stable service and better benefits in the future.&nbsp; &nbsp;&nbsp;</p><hr><p><strong>[Developer's Note Thank-You Gift]</strong></p><p><strong>&nbsp;-</strong><strong> Coupon Code:&nbsp;</strong><strong>OUTERNOTE10</strong><br><strong>&nbsp;- Schedule:&nbsp;</strong><strong>12/13 (Fri) 11:00 – 1/13 (Thu) 23:59 UTC</strong><br><strong>&nbsp;- Coupon Rewards:&nbsp;</strong><strong>Ether x1,000</strong><strong><br><br></strong></p><p>It feels like it was just yesterday when we sent our Christmas greetings in last year's developer note, <br>but the year is already coming to an end.<br>As the year draws to a close, we\n want to wish you all a safe and healthy end to the year, and I wish for\n even greater blessings to come your way in the new year.Despite the many shortcomings, we sincerely thank you for your support throughout 2024,and in 2025, we will continuously strive to provide a more stable service and delightful heroes to bring joy to our Masters.Thank you, and happy holidays, everyone!I wish you a joyful end of the year and a hopeful new year.- Producer Moonsoo Hyun -  </p></div>",
      "images": [
        "/developer-notes/2024-12-13-developer-s-note-10-december-update-notice/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp"
      ],
      "uid": "developer-notes:2024-12-13-developer-s-note-10-december-update-notice"
    },
    {
      "id": "2024-11-01-developer-s-note-9-the-second-festival-and-content-update",
      "title": "Developer's Note #9: The Second Festival and Content Update",
      "date": "11-01-2024",
      "date_iso": "2024-11-01T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2024-11-01-developer-s-note-9-the-second-festival-and-content-update/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp\" class=\"fr-fic\"><br><br></p><p>Hello, Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.<br>It's been approximately 3 months since the previous Developer's Note.We'd like to offer our sincere apologies for the following news before informing you about the other updates. As we mentioned in the previous Developer's Note, we are currently developing new content and update specs,  but it is taking more time than we had estimated because we are trying to showcase results of a higher quality. We would like to apologize for the delay and we will do our best to update it and reveal it as soon as possible. In this 9th Developer's Note, we would like to provide an overview onthe second OUTERPLANE Festival and the updates that will follow.</p><hr><p><strong>[2nd OUTERPLANE Festival]</strong></p><p>This November, OUTERPLANE will be celebrating its 1.5-year anniversary of its global release and<br> its half anniversary of its Japan release.<br>We are truly grateful for this occasion and we would like to host a Festival to celebrate it.<strong>1.&nbsp;</strong><strong>Festival Period</strong><br> - The Festival will be held for one month, from 11/05/2024 (Tue) to 12/03/2024 (Tue).<br><strong>2.&nbsp;</strong><strong>New Demiurge Hero, \"Gnosis Nella\"</strong><br> - We will be releasing Gnosis Nella, a new Demiurge Hero, during this Festival.<br>&nbsp; Gnosis Nella possesses various debuffs that target all enemies&nbsp; and is expected to show aptitude in PvP content through the \"I Am the Sole Perfection\" skill &nbsp; that removes enemies' buffs and stuns them.&nbsp; In addition, her high Chain Points supply, Weakness Gauge reduction, targeted cooldown increase,&nbsp; and more will highlight her strength in PvE battle as well, making her a hero that can play a big role &nbsp; in whichever deck you place her in.&nbsp; Get ready to meet Gnosis Nella, the versatile hero that can be utilized in both PvE and PvP!<strong>3.&nbsp;</strong><strong>Story Event Dungeon \"In the Great New World,\" \"Automaton of a World Reversed\" Update</strong><strong><br></strong>- \"In the Great New World,\" which is a story set in a dark fantasy world ruled by Nella,<br>&nbsp; you will find 6★ Legendary Weapons and Accessories in the Event Shop, unlike before.&nbsp;<br>&nbsp; We hope you enjoy the story dungeon that will be available with Gnosis Nella's release on November 5th, &nbsp; and we hope you equip her with the powerful gear optimized for her, including the adorable Chibi Monad Eva.&nbsp;\n Furthermore, \"Automaton of a World Reversed,\" which is a story centered\n around Epsilon and Vlada, will be updated on&nbsp; &nbsp; \n&nbsp;November 19th and will provide various rewards.&nbsp;<strong>4.&nbsp;</strong><strong>New 3★ Heroes \"Rey\" and \"Hilde\"</strong><br>- Two new 3<strong>★</strong> heroes will be released during the Festival period.<br>&nbsp; &nbsp;Don't forget to check out Rey, the bright and friendly optimist, and Hilde, the shy battle maid.<br><strong>5.&nbsp;</strong><strong>Events during the Festival</strong><strong><br>&nbsp;</strong><strong>1) <u>Recruitment Support Event to celebrate the release of Gnosis Nella</u>&nbsp;</strong><br>&nbsp;- Alongside the beginning of the Festival on November 5th, we will be providing<br>&nbsp; &nbsp; users with Limited Recruitment Tickets worth 100 Festival recruitments&nbsp; &nbsp; through the 7-Day Check-in Event, the Festival Web Event, Coupons, and more.&nbsp; &nbsp; Make sure to participate in the events during the Festival and get your rewards.</p><strong>&nbsp;2)<u> Increased Duplicate Hero Pieces Event</u></strong><br>   &nbsp; -&nbsp;The returning Duplicate Hero Piece Increase Event is only applied to Festival recruitments<br> &nbsp; &nbsp; &nbsp;and will begin on November 5th, which is when Gnosis Nella is released.<strong>&nbsp;3) <u>Festival-exclusive Check-in</u></strong><br>   - There will be a 2-week-long 7-Day Check-in Event following each regular update on November 5th and November 19th.<br> &nbsp; &nbsp;&nbsp;Users will be able to claim various rewards just by regularly checking in during the Festival.<strong>&nbsp;4) <u>Festival Bingo Event</u></strong><br>   - A Bingo Event will be held where users can acquire various items, including a costume for \"Rey,\" the new hero,<br> &nbsp; &nbsp; as well as new growth-related resources.<p><br>※&nbsp;Previously\n purchased (paid) Call of the Demiurge items will be exchangeable for \nLimited Recruitment Tickets during the festival period and will be added\n to the Currency Shop.<br>The exchange rate will be set at 1:1.5, reflecting the existing value.<strong>[Content Update and the addition of a Permanent Event]</strong></p><p><strong>1.&nbsp;</strong><strong>Content Update</strong>&nbsp;</p><p><strong>&nbsp;1)&nbsp;</strong><strong><u>Scheduled for 11/05 (Tue)</u>:&nbsp;<strong>Expanded difficulty for Special Request: Ecology Study and Special Request: Identification, </strong></strong><br><strong><strong>&nbsp; &nbsp; &nbsp; New Gear Enhancement System</strong></strong><strong>&nbsp;</strong><br>-&nbsp;To provide users with the sense of progression of an RPG and a new in-game goal,<br> &nbsp; &nbsp;&nbsp;we are expanding the difficulty of the Special Request dungeon to 13 stages.-&nbsp;Clear the dungeons by fighting the stronger Special Request bosses, \n &nbsp; &nbsp;and upgrade your heroes that have been stuck by performing\n breakthrough on Armor and enhancing Exclusive Equipment/Talismans. \n&nbsp; &nbsp;Regarding the enhancement of Exclusive Equipment, the \nupdates will take place prioritizing the heroes that see more use, &nbsp; &nbsp;and further details will be provided through a patch note in a future update.<strong>2)<u>&nbsp;</u><strong><u>Scheduled for 11/19 (Tue)</u>:</strong> Main Story Season 3 Area 1, 2 Update</strong><br> -&nbsp;The Story for Season 3 will be updated, as was mentioned in the previous Developer's Note.<br>-&nbsp;&nbsp;We have previously mentioned that it would consist of 3 areas,&nbsp; &nbsp; &nbsp;but the specs have decreased since our initial plan, so we will only be adding 2 Normal/Hard areas instead.&nbsp; &nbsp; We would like to apologize for the change in plans. &nbsp; &nbsp; We are still planning to continuously update 1 Story Area per month, &nbsp; &nbsp; so we hope you keep an eye out for the regular Story Area updates.<strong>3)&nbsp;<strong><strong><u>Scheduled for December</u>:&nbsp;<strong>Upcoming Updates</strong></strong></strong></strong><br>-&nbsp;New content [Irregular Extermination] will be added,<br> &nbsp;&nbsp;and there will be an overall renewal of [Guild Raid] and [World Boss]. &nbsp;&nbsp;Further details will be provided through a future patch note.<strong>2. New Permanent Event</strong><br><strong>&nbsp;1)&nbsp;<u>Scheduled for 11/5 (Tue)</u>: Special Request Permanent Event</strong><br>-&nbsp;&nbsp;According to data, we've deduced that many Masters have been struggling to <br>&nbsp; &nbsp;clear the Special Request Dungeons Stage 8 and higher. &nbsp; &nbsp;A new permanent event will be added to lower the entry barrier of Special Requests  &nbsp; &nbsp;to make it easier for users to farm gear and enjoy the content to its fullest. &nbsp; &nbsp;The event will be available when the Special Request content is released, &nbsp; &nbsp;and we are planning to create simple missions through which you can gain gear and growth resources, &nbsp; &nbsp;as well as 3☆ Earth, Water, and Fire Heroes that will help you clear the Special Request Dungeons. &nbsp; &nbsp;This event will be added on top of the Special Request dungeon difficulty expansion, &nbsp; &nbsp;so we hope that existing Masters can aim for a new goal, while new Masters can aim for  &nbsp; &nbsp;completing the dungeon.</p>&nbsp;<p><strong>[Improvements]</strong></p><p><strong>1. Quality of Life Improvements</strong><br><strong>&nbsp;1) <u>Scheduled for 11/19 (Tue)</u>: Lowered difficulty for Adventure License Quirk Enhancement</strong><br>   - We are planning to lower the points required to purchase Proof of Worth from the Adventure License Shop <br>\n &nbsp; &nbsp;from 500 License Points to 125 License Points per purchase\n in order to allow more Masters to enhance their License Quirks.&nbsp; &nbsp;Masters that have made purchases before this change will be sent the difference via mail.&nbsp;\n &nbsp;We will provide more information about the points that are to be \nsent through a separate notice or a maintenance notice.&nbsp;</p><hr><p><strong>[Developer's Note Thank-You Gift]</strong></p><p><strong>&nbsp;- Coupon Code: </strong>OUTERNOTE9<br><strong>&nbsp;- Schedule: </strong>11/1 (Fri) – 11/29 (Fri) 14:59 UTC<br><strong>&nbsp;- Coupon Rewards: </strong>Ether x1,000<br>&nbsp;</p><p>Whenever we reach out with these Developer's Notes, we can't help but think that we have <br> much more to prove to match the incredible amount of love and support we receive from the Masters.<br> That is why reaching this 1.5-year anniversary with the Masters means so much to us. We have no doubt that it was only possible due to the Masters that have been supporting us throughout the whole ride.  We hope you thoroughly enjoy yourselves in this second festival that we've prepared to reciprocate the abundance of love and support you send our way.  The development team is working hard to prepare for the updates that will take place in the last two months of 2024,  and we will work hard in 2025 to provide you with exciting and entertaining content as well.  We are truly grateful to be spending this 1.5-year anniversary with you all. We will always strive to provide the best service for you  &nbsp;Thank you.  </p></div>",
      "images": [
        "/developer-notes/2024-11-01-developer-s-note-9-the-second-festival-and-content-update/b0e0a5a2c84d4ca3a0d81c1f385e6e88.webp"
      ],
      "uid": "developer-notes:2024-11-01-developer-s-note-9-the-second-festival-and-content-update"
    },
    {
      "id": "2024-07-26-developer-s-note-8-regarding-upcoming-updates-for-the-second-half",
      "title": "Developer's Note #8: Regarding Upcoming Updates for the Second Half",
      "date": "07-26-2024",
      "date_iso": "2024-07-26T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2024-07-26-developer-s-note-8-regarding-upcoming-updates-for-the-second-half/561305b69fde4d00bd8aeaa5f5a5bfd0.webp\" class=\"fr-fic\"><br><br></p><p>Hello, Masters!<br> This is Moonsoo Hyun, the producer of OUTERPLANE.<br>  First, we would like to sincerely apologize for any concerns and uncertainties  caused by the seasonal limited pickup content introduced in the 7/16 (Tue) update. We are carefully reviewing each valuable opinion sent in and conducting  in-depth discussions based on these insights to identify and improve potential areas. Rest assured, we will do our best to implement the necessary changes.  In this 8th Developer's Note, we would like to share our plans for the second half of 2024.  We are working diligently to develop and update various new content and events. Here is a brief introduction to the content we are preparing along with the expected schedule.&nbsp;</p><hr><p><strong>[Planned Updates for the Second Half of the Year]</strong></p><p><strong>1. Content Update Direction</strong></p><p>When you visit OUTERPLANE, we believe it’s essential to always have something worthwhile available. <br>\n To achieve this, we are focusing on developing new content and regular \nevents, dividing our efforts into these two main categories.<br><strong>1) New Content</strong><strong><br>&nbsp;</strong>-&nbsp;We have alleviated growth difficulties through the introduction of Quirks and Precise Craft, <br> &nbsp;&nbsp;resulting in an overall increase in the specs of our Masters.<br> &nbsp;&nbsp;As a result, high-difficulty content such as Weapon/Armor Raid Dungeons, Guild Raids, and World Boss encounters  &nbsp;&nbsp;have become generally easier to clear. \n &nbsp;&nbsp;We are now entering a stage where it is challenging to \nmaintain a sense of continuous growth and set new, challenging goals. &nbsp;→\n Considering the current situation, we plan to adjust the overall \ncontent direction by adding higher-difficulty endgame content. This new \ncontent will be designed to offer simple challenges and a sense of \nachievement on a weekly basis.&nbsp;Alongside the expansion of \nhigh-difficulty new content, please note that the difficulty levels and \nrewards of Currency Dungeons will also be adjusted to increase the basic\n growth rate.</p><p><strong>2) Regular Events</strong><br>-\n&nbsp;We are preparing to continuously offer various events centered \naround Seasonal Events featuring limited-time seasonal heroes and \nOUTERPLANE Festival events with exclusive festival heroes. <br>Our goal is to ensure you have a fun and engaging experience while playing.</p><p>→&nbsp;The first OUTERPLANE Festival is scheduled to take place from the end of July to the end of August, <br>lasting approximately 4 weeks.<br>&nbsp;Starting with this festival event, we will do our utmost to provide a variety of rewards and enjoyable experiences.</p><p><br><b>2. Planned Events for the Second Half of the Year</b><br><em>※ Please note that these improvements are currently under review and subject to change.&nbsp;</em><br><br><strong>1) OUTERPLANE Festival</strong><br>- Every 2 to 3 months, a regular event called OUTERPLANE Festival will be held, featuring a variety of rewards.<br> &nbsp;&nbsp;:&nbsp;&nbsp;New Demiurge-level heroes will be added, and the rewards for duplicate pickups will be increased. &nbsp; &nbsp; &nbsp;Additionally, various rewards will be provided based on event equipment acquisition.</p><p>- The first festival will begin on 7/30 (Tue).<br>\n &nbsp;&nbsp;: With the addition of the new hero Gnosis Dahlia, we plan \nto offer rich rewards of Limited Recruitment Tickets and <br>&nbsp; &nbsp; Ether up to 100 recruits during the event period&nbsp;to support your&nbsp;acquisition of new hero.Previously\n purchased (paid) Call of the Demiurge items will be exchangeable for \nLimited Recruitment Tickets during the festival period and will be added\n to the Currency Shop.</p><p>The exchange rate will be set at 1:1.5, reflecting the existing value.</p><p>Additionally, during the OUTERPLANE Festival, you can use Limited Recruitment Tickets alongside Ether. <br>This allows you to acquire the new Demiurge-level character at a discounted price.</p><p><br><strong>2) Seasonal Events (Halloween/Christmas)</strong><strong><br> -&nbsp;</strong>While we conduct regular story events every month,<br> &nbsp;&nbsp;seasonal events are larger-scale events featuring limited heroes.<br> &nbsp;&nbsp;In the second half of 2024, we are preparing Halloween and Christmas events.  &nbsp;&nbsp;We will ensure that these events provide more rewards and benefits,&nbsp;&nbsp; &nbsp;&nbsp;aiming to offer an enjoyable experience without the inconveniences seen in the summer events.</p><p><br><strong>3. Upcoming New Content&nbsp;</strong><br><em>※ Please note that these improvements are currently under review and subject to change.</em><br><br><strong>1) Skyward Tower Revamp: Very Hard Difficulty and Synchro Room Added&nbsp;</strong>: <u>Scheduled for Late July to Early August</u><strong><br>&nbsp;</strong>-&nbsp;The Hard difficulty of the Skyward Tower will be changed to a monthly rotation format, similar to the Normal difficulty.<br>&nbsp; &nbsp; Currently, the clear rewards for each floor will be transferred to the initial clear rewards. <br>&nbsp; &nbsp; After the initial clear, you will receive a new currency, Automaton Coin, for subsequent clears.&nbsp;\n &nbsp; You will be able to use Automaton Coins to purchase various \nitems in the newly available Skyward Tower exclusive shop.&nbsp; &nbsp;This update is scheduled to be implemented on 7/30. &nbsp;\n &nbsp;Please note that floors cleared before 7/30 will be marked as \ncompleted, and after the reset on 8/1, you will start receiving rewards \nfor repeated clears.</p><p><br> &nbsp;<u>Very Hard Difficulty Added</u><br>  :&nbsp;&nbsp;A new PvE content, the Very Hard difficulty of the Skyward Tower, will be added.<br>\n &nbsp;This will provide new challenge objectives for Masters who have \nreached a certain level of growth, including final growth through \nQuirks.    :&nbsp;&nbsp;The Very Hard difficulty will feature weekly\n challenges, with 5 new floors opening each week, for a total of 20 \nfloors over 4 weeks. :&nbsp;&nbsp;Along with the addition of the \nVery Hard difficulty, we will make improvements to enhance the \naccessibility and ease of clearing the existing Normal and Hard \ndifficulties.</p><p><br> <u>Synchro Room</u><br>\n  :&nbsp;&nbsp;With the addition of the Very Hard difficulty, we will \nimplement improvements to facilitate entry and clearing of the existing \nNormal and Hard difficulties. <br> &nbsp;&nbsp;Notably, the Synchro Room system will be introduced to support clearing the Skyward Tower on Hard difficulty.\n :&nbsp;&nbsp;It is a new feature in the Base that allows you to select \n1-3 star heroes and achieve a certain level of growth without the need \nfor additional growth currency. :&nbsp;&nbsp;This system is expected\n to make clearing the Skyward Tower on Hard difficulty easier and will \nserve as a gateway to accessing the final difficulty, Very Hard.</p><p>&nbsp; <u>Quick Climb Feature&nbsp;</u><u><br></u>:&nbsp;&nbsp;- A Quick Climb feature will be added. <br> :&nbsp;&nbsp;This will help reduce the hassle of repetitive gameplay.</p><p><br><strong>2)&nbsp;</strong>Adventurer License and Weekly Raid Missions<strong>&nbsp;</strong>:&nbsp;<u>Scheduled for September</u><br>- This content, in a Boss Rush format, allows you to use unique Quirks&nbsp;&nbsp;<br> exclusive to this mode to gradually challenge higher difficulty bosses. - In response to Adventurers' Guild Cindy’s request,&nbsp;&nbsp; players can increase their adventurer level and attempt to upgrade their Adventurer License.&nbsp;&nbsp; This content is designed to offer weekly goals and a sense of progression by defeating progressively harder bosses in stages.\n - This content is planned to offer high-grade gems, which are currently\n relatively difficult to obtain, and will provide various rewards beyond\n just gem farming.</p><p><br><strong>3) Irregular Extermination</strong><strong>&nbsp;</strong>:&nbsp;<u>Scheduled for October</u><br>- This content, inspired by the prelude to Season 2’s Irregular enemies, <br>\n &nbsp;&nbsp;involves facing off against three types of Irregular Named \nbosses before taking on Irregular Queen Nadja in a joint \noperation/raid-style format.&nbsp;- It will reset at regular \nintervals and is being developed as a content option that can be enjoyed\n solo or with friends and guild members.</p><p><br><strong>4) Main Story Season 3</strong><strong>&nbsp;</strong>:&nbsp;<u>Scheduled for November</u><br>- The first part of Season 3 is scheduled to be released in November.<br>\n - The first part consists of three areas and will focus on the story \nunfolding in Eseph, which is ruled by Iota, as many Masters have \nanticipated.&nbsp;- Following the initial update, as previously announced, new areas for Season 3 will be added every 1-2 months. We appreciate your continued interest and support.</p><p><br><strong>5) Monad Gate</strong>&nbsp;:&nbsp;<u>Scheduled for December</u><br>- Monad Eva, who observes various parallel worlds while waiting for the day she can meet her Master again.<br> &nbsp;&nbsp;You can participate in the parallel worlds she observes and enjoy stories with various possibilities.\n - By incorporating roguelike elements, this content will allow for \ncontinuous repeat plays and offer various rewards unique to this mode, \nproviding meaningful gameplay objectives for players.</p><p><br><b>4. Other Improvements</b></p><p><strong>1) Quality of Life Improvements</strong><strong>&nbsp;</strong>:<u>&nbsp;Within August&nbsp;</u><br>-&nbsp;<b>Filter Improvements</b>: To improve the usability of equipment and hero filters, we are adding new filters and adjusting the reset timing.<br>-<b>&nbsp;&nbsp;Event Schedule&nbsp;&nbsp;and Buff Visibility Improvements</b>: UI improvements will be made to enhance event remaining time and buff visibility<br>-&nbsp;&nbsp;<b>Story Skip</b>:\n To enhance convenience for Masters who wish to focus solely on battles,\n a feature will be provided to skip the story on a daily basis.<br>-&nbsp;&nbsp;<b>Precision Crafting Substat Change Automation</b>: A feature will be introduced to automatically consume accumulated Effectium to obtain desired substat equipment.<br>-&nbsp;&nbsp;<b>Improvements will be made to save decks for World Boss and Guild Raid battles </b>: Improvement to eliminate the inconvenience of resetting with each rotation<br>-&nbsp;<b>&nbsp;Memorial Match Swee</b>p : The addition of the Memorial Match Sweep feature will help reduce the time spent on routine tasks.</p><p>-&nbsp;&nbsp;<strong>World Boss Shop Improvements:</strong> The purchase cost of available costumes in the shop has been reduced.</p><br><strong>2) Content Improvement</strong><s><br></s>&nbsp; <u>Guild Raid</u><br>  :  The guild raid battles, which have been repetitively patterned since their opening, will be prioritized for renewal.<br>&nbsp;\n &nbsp; &nbsp;ㄴ We plan to enhance the sense of teamwork among guild \nmembers by making the experience of defeating enemies more immersive. \nAdditionally, we will address the issue where masters who have completed\n their growth always receive the same score with full gear. → After\n the renewal mentioned above, we will assess the status of guild raids \nfor Masters on each server and decide whether to merge the raids.&nbsp;<p>&nbsp; <u>Asynchronous Arena New Season</u><br>  :  The new season of the arena, which has been operating as a pre-season due to various issues, is set to begin.<br>\n  :  From 8/13 to 10/13, a new league called 'League of Glory' will take\n place. Throughout the league, from start to finish, players can earn \nvarious rewards, including Glunite and Legendary 6-star Lifesteal Set \nArmor, through the arena shop.: &nbsp;After conducting one additional arena season, we will reevaluate the need to merge servers for the asynchronous arena.</p><p>In\n addition to the improvements mentioned above, we will make every effort\n to address any issues that Masters may encounter within our capacity.</p><hr><p><b>[Developer's Note Thank-You Gift]</b></p><p><strong>- Coupon Code: </strong>OUTERNOTE8<br><strong>- Schedule: </strong>7/26 (Fri) ~ 8/23 (Fri) 14:59 UTC<br><strong>- Coupon Rewards: </strong>1,000 Ether<br><br>Thanks to the heartfelt feedback and support from our Masters, we have been able to make progress with OUTERPLANE.We will always strive to provide our best by delivering high-quality content and service.Thank you.</p></div>",
      "images": [
        "/developer-notes/2024-07-26-developer-s-note-8-regarding-upcoming-updates-for-the-second-half/561305b69fde4d00bd8aeaa5f5a5bfd0.webp"
      ],
      "uid": "developer-notes:2024-07-26-developer-s-note-8-regarding-upcoming-updates-for-the-second-half"
    },
    {
      "id": "2024-05-22-a-thank-you-letter-and-gifts-from-the-producer",
      "title": "A Thank You Letter and Gifts from the Producer",
      "date": "05-22-2024",
      "date_iso": "2024-05-22T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2024-05-22-a-thank-you-letter-and-gifts-from-the-producer/b63357d089974facb8bcbb5d65c78735.webp\" class=\"fr-fic\"><br></p><p><br>Hello, Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.OUTERPLANE, launched globally on May 23, 2023, is already celebrating its first anniversary.On behalf of the development team at OUTERPLANE,  I would like to extend my deepest gratitude to all the Masters who have loved and enjoyed OUTERPLANE over the past year.Time has flown by so quickly that it feels like just yesterday was May 23 of last year. Yet here we are, a year later.The excitement and nervousness of meeting Masters from around the world, the thrill of our initial launch amidst many worries,&nbsp;the disappointment I felt when our imperfections and mistakes let you down,&nbsp;and\n the satisfaction that came from resolving various issues through the \nfeedback of our dedicated Masters—all of these experiences have been \ndeeply impactful.The many joyful and challenging memories bring the past year back to me as I express my gratitude to you today.Being able to connect with so many Masters through OUTERPLANE has been a tremendous blessing for us.For\n this, we are truly grateful. Ultimately, it is your warm encouragement \nand thoughtful advice that have helped us create a better OUTERPLANE \ntoday.While there are still many areas within the game that need improvement,  we will always listen to your feedback. Our team is committed to doing its best and continually improving so that you can enjoy OUTERPLANE for many years to come.</p><hr><p><img src=\"/developer-notes/2024-05-22-a-thank-you-letter-and-gifts-from-the-producer/149af9ce15964ed39c8aa16dbcf45499_002.webp\" class=\"fr-fic\"><br></p>&nbsp;<table><tbody><tr><td><strong>Date</strong></td><td><strong>Claim Period (UTC)</strong></td><td colspan=\"2\"><strong>Compensation</strong></td></tr><tr><td>05-23</td><td>05/23 (Thu) 00:00 ~ 05/23 (Thu) 23:59</td><td>Call of the Demiurge (Event) x 50</td><td>Stamina x 100&nbsp;</td></tr><tr><td>05-24</td><td>05/24 (Fri) 00:00 ~ 05/24 (Fri) 23:59</td><td>Special Recruitment Ticket (Event) x 5</td><td>Gold x 300,000</td></tr><tr><td>05-25</td><td>05/25 (Sat) 00:00 ~ 05/25 (Sat) 23:59</td><td>Special Recruitment Ticket (Event) x 5</td><td>Gold x 300,000</td></tr><tr><td>05-26</td><td>05/26 (Sun) 00:00 ~ 05/26 (Sun) 23:59</td><td>Call of the Demiurge (Event) x 50</td><td>Stamina x 100&nbsp;</td></tr></tbody></table><p><br>Once again, we thank you for being with us over the past year. <br> As a token of our gratitude, we have prepared rewards for you.You can check your rewards in your mailbox starting May 23th.Wishing you good health and days filled with happiness always.Thank you.- Moonsoo Hyun -</p></div>",
      "images": [
        "/developer-notes/2024-05-22-a-thank-you-letter-and-gifts-from-the-producer/b63357d089974facb8bcbb5d65c78735.webp",
        "/developer-notes/2024-05-22-a-thank-you-letter-and-gifts-from-the-producer/149af9ce15964ed39c8aa16dbcf45499_002.webp"
      ],
      "uid": "developer-notes:2024-05-22-a-thank-you-letter-and-gifts-from-the-producer"
    },
    {
      "id": "2024-04-17-developer-s-note-7-regarding-upcoming-updates",
      "title": "Developer's Note #7: Regarding Upcoming Updates",
      "date": "04-17-2024",
      "date_iso": "2024-04-17T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/9e7943b48a57485d8015573f51ecb094.webp\" class=\"fr-fic\"><br></p><p>Hello, Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.<br> Thank you as always for your continued interest and support for OUTERPLANE.First, I'd like to apologize to all our players who waited for the Developer's Note for being unable to reach out sooner.&nbsp;I'd also like to apologize for the inconvenience caused by stability issueswith the World Boss and other newly updated content. \n Our priorities were focused on providing a stable service to our \nplayers, and, as a result, we found it difficult at the time to provide \ncommunication regarding the direction of future updates. We'd like to \nask for your kind understanding in this regard.In this 7th Developer's Note, we would like to provide you with details regarding the direction of future updates.&nbsp;</p><hr><p><strong>[Upcoming Updates]</strong></p><p><strong>1. Terminus Isle Exploration / Quirks / Precise Craft</strong><strong>&nbsp;</strong></p><p>We've\n received a lot of feedback from our players saying that there was \ninsufficient routine content to enjoy after completing the story.</p><p>We\n prepared and carried out beta tests for the World Boss and Real-Time \nArena content in order to address this issue, but the barrier to entry \nturned out to be a bit too high to be an effective solution for players \nstill in the middle of progressing their accounts.</p><p>As such, we've \ndecided that the addition of routine content that can also help players \ntake on the upcoming World Boss and Real-Time Arena upon their full \nrelease is the highest-priority task currently facing OUTERPLANE, and so\n we will be making the following updates to provide fun new content for \nplayers to enjoy.<br>&nbsp;<br> &nbsp;1) <u>New Content: Terminus Isle Exploration</u></p><p><img src=\"/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/828a7cfde9c74513954a6f6d38cd34e0.webp\" class=\"fr-fic\"><br></p><p><img src=\"/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/215510b6144044bba43123caacaf7f2d.webp\" class=\"fr-fic\"><br><em>&nbsp;※\n The image above is currently under development and is shown without \nmultilingual support. It may be subject to change upon release.</em><br><br>-&nbsp;On Terminus Isle, players can explore the island and clear events to obtain various rewards.&nbsp; &nbsp; Players can access Terminus Isle after they've cleared at least one Special Request dungeon at Stage 8 or above. &nbsp;\n &nbsp;Exploration progress is reset every Monday, and players will be \nable to select between 10 different difficulty levels depending &nbsp;\n &nbsp;on their level of progress. Through Terminus Isle Exploration, \nplayers will be able to obtain resources used in the newly added&nbsp;</p>&nbsp; Quirk and Precise Craft systems, and they can also look forward to obtaining massive rewards by defeating the <p>&nbsp;&nbsp;new\n boss&nbsp; Ziggsaron, the Ravenous Wolf King, who appears at certain \nintervals during the Terminus Isle Exploration.</p> <br> &nbsp;2) <u>Quirks</u><br><u><img src=\"/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/48303520f7d74b24bb903349b34269a0.webp\" class=\"fr-fic\"><br></u><em>※\n The image above is currently under development and is shown without \nmultilingual support. It may be subject to change upon release.</em><br><br>-&nbsp;&nbsp;Quirks are a new growth system that can be advanced using points acquired through the Terminus Isle content,&nbsp; <p>&nbsp; &nbsp; &nbsp;and have been designed to help players more easily challenge higher-difficulty content. &nbsp; &nbsp;&nbsp;<br>&nbsp;\n &nbsp; &nbsp;Through Quirks, players can enhance the stats of Heroes by\n element and class, and can upgrade stats that are effective <br>&nbsp; &nbsp; &nbsp;in progressing through PvE.</p> &nbsp; &nbsp;&nbsp;Furthermore, players can also upgrade stats that help them throughout the game overall, <br> &nbsp; &nbsp;&nbsp;such as ones that enhance their resource acquisition or lower crafting costs.<br>  &nbsp;3) <u>Precise Craft</u><br><u><img src=\"/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/f3142e2ccece4756bcf0a1ba0083f838.webp\" class=\"fr-fic\"><br></u><em>※\n The image above is currently under development and is shown without \nmultilingual support. It may be subject to change upon release.</em><br><br> -&nbsp;&nbsp; Precise Craft can be accessed through the base, and it is intended to reduce the difficulty of obtaining Legendary gear. &nbsp; &nbsp;&nbsp;It will consume resources obtained through Terminus Isle Exploration, &nbsp; &nbsp;&nbsp;and players will be able to select the unique and main stats of a Legendary piece of gear,  &nbsp; &nbsp;&nbsp;and roll repeatedly for substats within certain bounds to craft gear with their desired stats.<p><strong>2. World Boss Official Launch</strong><br> Many players have sent us feedback during the first World Boss beta test<br> that the content was difficult to enjoy for newer players.  As such, we will be taking player feedback into account and dividing up difficulties and leaderboards so that players can take on World Bosses that match their progress. Please note that we will be working on these changes with a target launch date of late June to early July. &nbsp; &nbsp; We are currently working on new World Bosses to reduce the potential fatigue of having to  face the same World Boss month after month, and we are also working on World Boss-exclusive costume rewards &nbsp;to provide players with an additional incentive to take on the challenge.</p>Please note that we may hold another World Boss beta test prior to its official launch <br> to test the aforementioned changes.<p><strong>3. Main Story Update</strong></p><p><img src=\"/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/10fa7e06c51a4bb086e4404808a56d98.webp\" class=\"fr-fic\"></p><p><img src=\"/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/85a3d328d1e846328114168ecd99dccb.webp\" class=\"fr-fic\"></p> I would first like to apologize for not being able to bring you the main story update sooner <br> due to the work on it taking longer than expected.<br> We will be bringing you the new installment of the main story, Season 2 Part 2, on the 21st of May, and we hope you will be able to enjoy it as much as possible. \n Also, in order to reduce the likelihood of another such extended hiatus\n between story updates, we are planning to bring you future story \ncontent on a regular schedule. Starting with Season 3, we are hoping to release at least 1 new area every 1 to 2 months following the initial story update.\n While the scale of each individual update will be smaller, we are \nhoping this will help reduce the size of the gap between story releases.\n As story content takes a lot of time and resources to produce, we are \nunable to provide a specific date for the release of Season 3 at this \ntime. We ask for your kind understanding, and we will do our best to \nbring it to you as soon as possible.<p><strong>4. Quality of Life Improvements</strong><br> We have reviewed the feedback our players have provided through various channels, <br>&nbsp;and we are working to address them via various quality of life improvements.</p><p>We have added a sweep function to the equipment dungeon,<br> and we are planning to add a sweep function to Memorial Match in the Arena. <br>\n Also, we are hoping to soon unveil the Ultimate Skill (Skill 3) skip \nfunction that was delayed due to the large amounts of systematic \nimprovements that had to happen in order for it to be implemented.   We plan to continue making improvements to the game based on the feedback provided to us by our players, and we will do our best to provide our players with an enjoyable experience through a stable service and engaging gameplay.</p><hr><p><strong>[Developer's Note Thank-You Gift]</strong></p><p>- <strong>Coupon Code</strong>: OUTERNOTE7<br> - <strong>Coupon Redemption Period</strong>: 4/17 (Wed) ~ 5/15 (Wed) 14:59 UTC<br> - <strong>Coupon Rewards</strong>: 500 Ether<br> <br> On May 23rd, OUTERPLANE will be reaching its 1-year anniversary. We would like to express our heartfelt thanks for all our players  who have enjoyed OUTERPLANE and shown us love and support over the past year.   We are hard at work preparing a plethora of events and content in celebration of our 1-year anniversary! </p><p>We will continue working hard to make OUTERPLANE the best game that it can be.<br> <br>&nbsp;Thank you.</p> <br>&nbsp;<br>&nbsp;</div>",
      "images": [
        "/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/9e7943b48a57485d8015573f51ecb094.webp",
        "/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/828a7cfde9c74513954a6f6d38cd34e0.webp",
        "/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/215510b6144044bba43123caacaf7f2d.webp",
        "/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/48303520f7d74b24bb903349b34269a0.webp",
        "/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/f3142e2ccece4756bcf0a1ba0083f838.webp",
        "/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/10fa7e06c51a4bb086e4404808a56d98.webp",
        "/developer-notes/2024-04-17-developer-s-note-7-regarding-upcoming-updates/85a3d328d1e846328114168ecd99dccb.webp"
      ],
      "uid": "developer-notes:2024-04-17-developer-s-note-7-regarding-upcoming-updates"
    },
    {
      "id": "2024-01-19-a-letter-of-apologies-for-issues-regarding-real-time-arena",
      "title": "A Letter of Apologies for Issues Regarding Real-Time Arena",
      "date": "01-19-2024",
      "date_iso": "2024-01-19T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2024-01-19-a-letter-of-apologies-for-issues-regarding-real-time-arena/364b77620554442e8925ecadd625bc39_002.webp\" class=\"fr-fic\"><br><br></p><p>Hello,&nbsp;Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.<br>This marks our first greetings in the year 2024&nbsp;for our Masters.&nbsp;We extend our heartfelt wishes for good health, happiness, and joy throughout the new year.&nbsp;With\n the first update of the year, we introduced the Real-Time Arena \ncontent, enriching the elements for your enjoyment and providing new \nplay goals for game progression. The Real-time Arena beta test was launched to improve the service's stability and ensure a more enjoyable pre-season. We sincerely apologize for any inconvenience caused by the various issues that arose after the update on 1/16 (Tue).  Our team is actively working to resolve these issues promptly. For detailed information on known issues, please refer to the [<u><a href=\"https://page.onstove.com/outerplane/en/list/123732\" target=\"_blank\" class=\"card__content__link\" rel=\"noopener noreferrer\">Known Issues notice</a></u>]. &nbsp;<br>We will keep you informed of any additional issues discovered through continuous monitoring. &nbsp;<br>We appreciate your understanding that resolving some issues may take time.  Please note that temporary maintenance may be conducted during this process.We are dedicated to doing our utmost to address the confirmed issues and reinforce internal processes to prevent similar occurrences.Your active participation in the Real-time Arena beta test has greatly contributed  to identifying and resolving these issues promptly. Once again, we express our gratitude and seek your understanding. We eagerly anticipate your continued participation during the remaining beta test period. <strong>[Developer’s Note Gifts]</strong><br><strong>-&nbsp;</strong><strong>Coupon Code</strong><strong>:</strong>&nbsp;OUTERRTA<br><strong>-</strong>&nbsp;<strong>Coupon Redemption Period</strong>: 1/19 (Fri) ~ 2/16 (Fri) 14:59 UTC<br><strong>-</strong>&nbsp;<strong>Coupon Rewards</strong>:&nbsp;500 Ether<br><br>We will continuously strive to create a more enjoyable environment for our Masters. Thank you. </p><p>&nbsp;<br><img src=\"/developer-notes/2024-01-19-a-letter-of-apologies-for-issues-regarding-real-time-arena/6429cf22c0204cc1875cc0a52c4897d5.webp\" class=\"fr-fic\"><br><br></p></div>",
      "images": [
        "/developer-notes/2024-01-19-a-letter-of-apologies-for-issues-regarding-real-time-arena/364b77620554442e8925ecadd625bc39_002.webp",
        "/developer-notes/2024-01-19-a-letter-of-apologies-for-issues-regarding-real-time-arena/6429cf22c0204cc1875cc0a52c4897d5.webp"
      ],
      "uid": "developer-notes:2024-01-19-a-letter-of-apologies-for-issues-regarding-real-time-arena"
    },
    {
      "id": "2023-12-14-developer-s-note-6-hero-fixes-delay-of-real-time-arena-and-holiday-event",
      "title": "Developer's Note #6: Hero Fixes, Delay of Real-Time Arena, and Holiday Event",
      "date": "12-14-2023",
      "date_iso": "2023-12-14T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2023-12-14-developer-s-note-6-hero-fixes-delay-of-real-time-arena-and-holiday-event/fb171f2511a6460abeed8afca6d1a5dc.webp\" class=\"fr-fic\"><br></p><p>Hello, Masters!<br>This is Moonsoo Hyun, the producer of OUTERPLANE.<br> &nbsp;It's already&nbsp;December, marking the end of the year.&nbsp;During\n this chilly season, we would like to extend well wishes for your \nwell-being and hope that your days are filled with warmth.&nbsp; &nbsp;Today,&nbsp;we present the 6th Developer Note, addressing the details of the hero balancing adjustment,&nbsp;&nbsp;the schedule delay of Real-Time Arena and holiday event details.</p><hr><p><strong># Hero Balance Adjustments</strong><br>\n Following the Demiurge Drakhan update, many of our Masters expressed \nconcerns about the new hero's performance falling short compared to the \nacquisition and growth difficulty. <br> We apologize for not meeting satisfaction in terms of the new hero's performance balance.   Based on your feedback, internal reviews have confirmed some hero balance adjustments, including Demiurge Drakhan. While\n detailed specifics may undergo fine-tuning according to internal \nsimulation results, we plan to maintain the balancing direction as \nfollows: </p><p><strong>[Will be implemented following the Update on 12/19/23 (Tue)]</strong></p><p><b>◈ Demiurge Drakhan</b><br> We have determined that her overall performance is limited <br> before reaching 6-star transcendence, making it challenging to utilize her effectively after recruitment. To address this, we plan to adjust her balance as follows: <b>&nbsp; 1)</b>\n We will redistribute the effects of transcendence and add an effect that lets her take reduced damage <br>&nbsp; &nbsp; &nbsp; &nbsp; from attacks that target all enemies. This adjustment aims to provide a more noticeable increase in <br>&nbsp; &nbsp; &nbsp; &nbsp; performance upon recruitment and growth through each transcendence.</p><p><b>&nbsp; 2)</b> Skill 2: An additional penetration buff will be added to enhance the overall damage dealing capabilities of both the caster<br>&nbsp; &nbsp; &nbsp; &nbsp;and allies through improvements to her Skill 2, Doom Heralding Cry.<br>With these adjustments, we aim to enhance her ally protection abilities and introduce a buffer role, addressing her deficiencies as a Defender and making her more versatile in both PVE and PVP.</p><p><strong>[Will be implemented following the Update on 1/2/24 (Tue)]</strong></p><p><b>◈ Ame</b><br>Ame's damage-dealing abilities, particularly before equipping her Exclusive Equipment, <br>will be enhanced to solidify her position as a damage dealer suitable for various content. </p><p>&nbsp; <b>1)&nbsp;</b>Mikazuki 1st Art: Blooming and Burst Skill - Sakura, Chiru will be changed to an attack that targets all enemies upon<br>&nbsp;\n &nbsp; &nbsp; &nbsp; acquisition, with increased damage dealt to an \nadvantageous element and a granted Attack buff when attacking. &nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; The Burst Skill will permanently apply as an attack that targets all enemies.</p><p>&nbsp; <b>2)</b> Mikazuki 2nd Art: Pruning – The effect of increased damage dealt to bosses, originally from her Exclusive Equipment, <br>&nbsp; &nbsp; &nbsp; &nbsp;will be added to her passive effect, combined with the existing critical rate effect.</p><p><b>&nbsp; 3) </b>Mikazuki 3rd Art: Flower Charm - The conditions for triggering the Sakura, Chiru/Ume Ichirin buffs will be adjusted, <br>&nbsp;\n &nbsp; &nbsp; &nbsp; allowing for a quicker acquisition of the Ume \nIchirin buff specialized for attacking with a single attack.</p><p><b>&nbsp; 4)</b> Exclusive Equipment: The effect will be changed to increase damage dealt to Water enemies.<br><br>We look forward to your support for Ame, who now possesses a conditional attack targeting all enemies, enhanced damage-dealing abilities, and faster Ume Ichirin buff acquisition.</p><p><b>◈ Sterope</b><br>Sterope, identified as the least frequently used hero, will undergo a significant adjustment due to factors such as PVP balance<br> changes that diminished the value of Accuracy and Effectiveness.   In response, Skill 3 – “Fight Ferociously!” will see substantial adjustments for overall improvement. The unique buff of Skill 2, 'Keraunos,' will be removed, and in its place, the Unhealable effect will be granted as a battle entry passive and an additional effect of Skill 3. These adjustments aim to make Sterope more versatile, allowing her to be used in various situations compared to her current state with the newly added utility effect.This adjustment aims to improve usability in dungeons requiring the Unhealable effect and Earth/Light raids, while also exerting a strong impact on certain PVP team compositions. We hope you anticipate these forthcoming adjustments.</p><p><strong># The Delay in the Real-Time Arena Schedule</strong></p><p>To provide our Masters with a higher-quality experience,<br> we have regrettably postponed the release of the Real-Time Arena, initially planned for the last update of 2023.<br> We sincerely apologize to our Masters who have awaited the Real-Time Arena content. We want to assure you that we are committed to delivering content that meets your satisfaction.  The updated schedule will be announced at a later date, and we will make every effort to release it as soon as possible.Your understanding is greatly appreciated.&nbsp;</p><p><strong># holidays Event Details</strong></p><p>To ring in the end of 2023 with OUTERPLANE,<br> festive celebrations will begin following the update on 12/19 (Tue) and continue for two weeks. <br> We hope that you will enjoy the festivities.  Immerse yourself in the story event, \"<u>Holidays with an Archdemon</u>,\" <br> and, by participating in event dungeons, obtain holiday lobby backgrounds, the new hero Dahlia, <br>and the adorable fiend Beth's holiday costume.In anticipation of the upcoming holidays,  we've arranged a 12-day Check-in Event running from December 14 to 25. Join in daily to receive abundant login rewards.Please check the details in a <u><a href=\"https://page.onstove.com/outerplane/en/view/9912545\" target=\"_blank\" class=\"card__content__link\" rel=\"noopener noreferrer\">separate notice</a></u>.</p><p>As our last holiday gift to you, we're planning surprise Drop Rate Up events featuring the most beloved heroes, <br>Demiurge Stella and Demiurge Astei.<br> We hope you enjoy the holidays and year-end festivities with OUTERPLANE.</p><hr><p><strong>[Developer’s Note Celebration Gifts]</strong><br>-&nbsp;<b>Coupon Code</b>: OUTERNOTE6<br>-&nbsp;<b>Coupon Redemption&nbsp;Period</b>: 12/14 (Thu) ~ 01/11 (Thu) 14:59 UTC<br>- <b>Coupon Rewards</b>: 500 Ether\n<br> <br>Looking ahead to 2024, the OUTERPLANE development team is dedicated to providing you with even more enjoyable services.Thank you, and happy holidays, everyone!</p></div>",
      "images": [
        "/developer-notes/2023-12-14-developer-s-note-6-hero-fixes-delay-of-real-time-arena-and-holiday-event/fb171f2511a6460abeed8afca6d1a5dc.webp"
      ],
      "uid": "developer-notes:2023-12-14-developer-s-note-6-hero-fixes-delay-of-real-time-arena-and-holiday-event"
    },
    {
      "id": "2023-11-06-developer-s-note-5-november-to-december-balance-adjustments",
      "title": "Developer’s Note #5” November to December Balance Adjustments",
      "date": "11-06-2023",
      "date_iso": "2023-11-06T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2023-11-06-developer-s-note-5-november-to-december-balance-adjustments/6f396837335c47d4832ae1b479e15aa1.webp\" class=\"fr-fic\"><br><br>Hello, Masters! This is Moonsoo Hyun, the producer of OUTERPLANE.  Today, we are pleased to present you with the 5th Developer's Note, in which we aim to offer further information about the balance adjustments mentioned in our previous Developer’s Note.</p><hr><p><strong>◈ Balance Adjustments</strong><strong><br></strong>Balance adjustments will be carried out on both PVP and PVE <br> to mitigate uncertainty in PVP and refine the dominance of certain combinations, items, and core combat mechanics. <br>This will diversify the choice of using different offense and defense decks. As a result, with the upcoming real-time PVP in mind, \n the direction for asynchronous PVP will be to enhance the satisfaction \nof victory and alleviate the stress related to progression.  For PVE, we plan to ease the challenges faced during early and mid-game adventures and the growth process, while also reducing the difficulty of dungeons with exceptionally high failure rates.  <strong>◈ Balance Adjustment Details</strong><br> Due to the nature of numerical balance, radical modifications can bring about excessive side effects.  <br> Therefore, we are approaching modifications with caution, and we kindly request you to refer to the adjustment details below. ※\n Please note that the current changes are in the development and \nsimulation stages, and there may be some modifications when they are \napplied in the actual update.  <strong>1. Basic Battle Logic Adjustments</strong><br></p><table><tbody><tr><td>No.&nbsp;</td><td>Category</td><td>Details</td><td>Effective date</td></tr><tr><td>1</td><td>Random Speed Adjustment at the Start of Battle</td><td><br><a href=\"/\" class=\"sc-handle\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>#Implemented</strong></a> following the Update on 10/24<br> <br> We have reduced the random range due to the observed occurrence of random values exceeding the expected range.   - Current:  5% ~ 5% / Expected: 0% ~ 5%  The above modification was made to minimize uncertainty stemming from random values   and to ensure that the efforts and investments made by our Masters in terms of time and significant costs do not go to waste.</td><td>10/24<br>&nbsp;[Applied]</td></tr><tr><td rowspan=\"4\">2</td><td rowspan=\"4\">In the Resurrection mechanism,&nbsp;</td><td><br>we found that the advantages of Resurrection/Revival in PVP were excessive, <br>which increased uncertainty in the outcome of battles. &nbsp;\n We also observed that this led to overly uniform deck compositions and \nhindered the formation of effective offensive teams against defensive \nones.With these concerns in mind, we made the following adjustments.</td><td rowspan=\"4\">12/5</td></tr><tr><td><br># Current<br>  - Revival/Resurrection Effect: All debuffs are dispelled, and skill cooldown is maintained. &nbsp; Heroes will be resurrected with their Priority at defeat. &nbsp; (Health is set according to each Heroe's skill/item effects.)  - (Enhanced) Resurrection Effect: All debuffs are dispelled, and skill cooldown is reset. &nbsp; Heroes will be resurrected with their Priority at defeat. &nbsp; (Health is set according to each Heroe's skill/item effects.) &nbsp;# Expected  Debuffs are dispelled and skill cooldown is reset / Health rules remain the same as before / Changes in Priority for both PVE and PVP  - PVE: Remains the same as before.  - PVP: Adjustments will be made as follows&nbsp; ㄴ Heroes will now be resurrected with 50% of their Priority at the time of defeat deducted &nbsp; &nbsp; &nbsp; (This will be applied as the new Arena league buff effect)&nbsp; ㄴ E.g. If a Hero's Priority is at 50% at the time of defeat, they will be resurrected with 25% Priority.</td></tr><tr><td><br>We anticipate that the above changes will likely reduce the PVP dominance of the <br>Water Elemental Hero “Mene” compared to the past.  Similarly, the application of the same logic to the Artifact \"Resurrection Token,\" which can be used by Healers, will result in a certain decrease in dominance.However, in PVE, we will maintain the existing rules, and we hope that Mene, designed for use in higher difficulty/content, will continue to maintain her value as it stands today.</td></tr><tr><td><br>The new Arena league is scheduled to begin on 12/4, <br>and these adjustment changes will be implemented in the form of buffs when the new Arena league starts. For stability reasons, these changes are planned to be applied after the 12/5 maintenance.  Please note that these buffs will not be applied &nbsp;on the league's starting day, 12/4.</td></tr><tr><td>3</td><td>Penalty for missing hits reduced.</td><td><br>While\n this mechanic is common in many games, in OUTERPLANE, the frequent \noccurrence of missed shots, influenced by hit/miss statistics, can make \nthe game less enjoyable. <br> Therefore, we have made the final decision to ease the penalty for missed shots. Since users have direct control over Accuracy/Evasion stats, we plan to primarily ease the penalty for missed shots, which we initially applied more rigorously.  1. Current Missed Hit Penalty&nbsp; &nbsp;: No critical hits occur / Final damage reduced by 75% / No debuff effects from skills are applied2. Expected Missed Hit Penalty&nbsp; &nbsp;: No critical hits occur / Final damage reduced by 50% / No debuff effects from skills are applied</td><td>11/21</td></tr><tr><td>4</td><td>The Probability of Missed Hits</td><td><br>To improve the player experience and reduce uncertainty in PVP matches, &nbsp;<br>\n we have determined that it is necessary to adjust the frequency of \nmissed hits to make the missed hit probability more predictable. The most significant issue at present is the relativity in stat comparisons, and the unpredictability of how often missed hits will occur during an attack.  Therefore, we plan to adjust the maximum probability of missed hits as follows:  1. Current: Missed hits occur up to around 70% based on the lowest Accuracy/highest Evasion stats  2. Expected: Missed hits occur up to around 25% based on the lowest Accuracy/highest Evasion stats              (When adding Heroes with Evasion, we plan to approach it by adding to the probability of missed hits.)  In contrast to the maximum value in the mathematical domain, it is anticipated that Masters will experience a miss rate of approximately 0% to 15%.  \n Consequently, the discomfort associated with missed hits is expected to\n be considerably alleviated compared to the previous setup.  However, since the survival stats of most classes were based on the Evasion stat,   particularly for Bruisers countering Strikers and Defenders relying heavily on the Evasion stat,  an overall rebalancing of survival stats is being implemented. This will involve different adjustments in terms of bonuses and penalties for each class, and detailed information will be provided at the time of the update.</td><td>11/21</td></tr></tbody></table><p><br><strong>2. PVP Balance Adjustments&nbsp;</strong></p><table><tbody><tr><td>No.&nbsp;</td><td>Category</td><td>Details</td><td>Effective date</td></tr><tr><td>1</td><td>PVP Buff (Duelist's Pledge)</td><td><br>The effect was introduced with the assumption that it would reduce excessively prolonged battles. <br> It primarily applied to the attacking team, taking into account the inherent disadvantage of the defensive team.  However, upon reviewing the complete dataset, it was found that the defensive team's success rate in defense was higher than expected.   Consequently, it was determined that the effect did not need to be applied exclusively to the attacking team.  It has already been adjusted in the first phase, delaying its initial occurrence. The adjustment is aimed at controlling situations where battles are prolonged.\n The penalty will be adjusted to affect all teams, and in the event that\n all participating Heroes on both sides die simultaneously, the victory \nwill be awarded to the defensive team. 1. Damage Target: Current: Applied to offensive team only &gt; Expected: Applied to all teams</td><td>12/5</td></tr><tr><td>2</td><td>PVP Buff (Exclusive League Buff)</td><td><br>After the balance adjustment update, a new asynchronous PVP league is scheduled to begin.<br> As mentioned earlier, we are currently working on adjusting the PVP balance in the direction of reducing uncertainty.     \n In particular, we have identified that the dual-stat computation \nstructure of accuracy/evasion/effectiveness/effect resistance increases \nuncertainty   when using Heroes with debuff effects, and imposes excessive usage constraints. \n We have considered the radical approach of completely removing \neffectiveness/effect resistance. However, since there is a possibility \nof these elements being used as pattern factors in higher-level dungeons\n in PVE,  we have decided to apply league-exclusive buffs in a way that mitigates these conditions, particularly in PVP. Furthermore, please note that we plan to extend the league-exclusive buffs, which were previously only available in the Diamond tier and above, to the Gold tier and above.   1. Scheduled Buffs: Apply +n Effectiveness to all participants (Attack and Defense teams)&nbsp; &nbsp;ㄴ We will assign an integer value to approach zero, with the aim of minimizing the expected&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;occurrence of Resistance for the target. As\n a result, [Resistance] will no longer be triggered, and it is expected \nto reduce unforeseeable variables. Additionally, there will be a \nsignificant reduction in the maximum evasion probability, contributing to an improvement of the basic logic.</td><td>12/5</td></tr></tbody></table><p>&nbsp;<br><strong>3. Hero Balance Adjustments</strong></p><table><tbody><tr><td>No.&nbsp;</td><td>Category</td><td>Details</td><td>Effective date</td></tr><tr><td>1</td><td>Tio</td><td><br>While the presence of Silenced and Cooldown Reduction debuffers has already reduced the significance of skill burst 1-3, <br>\n we have determined that the scenario where players can endlessly use \nthese skills to withstand high-tier PVP does not offer a positive \nexperience.   Therefore, the following adjustments are being implemented.  1. Effect for Skill Burst Lv.1 of the skill, “This Shot Won't Hurt”, will be adjusted&nbsp; ㄴ Current: Reduces “This Shot Won't Hurt” Cooldown by 2 turns&nbsp; ㄴ Adjusted: Reduces “This Shot Won't Hurt” Cooldown by 1 turn</td><td>11/21</td></tr><tr><td>2</td><td>Eliza</td><td><br>In the Guild Raid, she is currently being utilized with Beth, <br>but as she was originally intended to be a valuable asset in PVP,  we are looking to enhance her potential for inclusion in offensive teams by making some minor adjustments. The use of debuffs in general has become more challenging due to the prevalence of immunity sets. \n Therefore, we intend to make some incremental improvements to the \nviability of using her as part of offensive teams until new Heroes that \ncan dispell debuffs are introduced.   1. Adjustments will be made to certain effects for the skill “Bloody Roar” &nbsp; ㄴ Current: Inflicts Bleeding on a random enemy for 2 turn(s) while ignoring Resilience.&nbsp; ㄴ Adjusted: Inflicts Bleeding on the enemy with the highest speed for 2 turn(s) &nbsp; &nbsp; &nbsp; while ignoring Resilience.</td><td>11/21</td></tr><tr><td>3</td><td>Rhona</td><td><br>We've\n realized that the Heroes obtained through area clear missions have \nsignificantly low utility, regardless of the acquisition difficulty.<br> As a result, we plan to introduce changes to their exclusive equipment and certain skill effects to unlock new uses for them.  This adjustment is designed to transform them into a health-based damage dealer with respectable speed, eliminating the need for a Critical Hit setup. Please refer to the changes at the time of the update.</td><td>11/21</td></tr><tr><td>4</td><td>Demiurge Astei</td><td>As a result of adjustments to the resurrection mechanism, <br>certain aspects may be weakened compared to the previous state.<br> Considering the acquisition difficulty and value of Demiurge Astei, we have raised the Priority increase upon resurrection.  Consequently, there will be a slight improvement in PVE performance, while PVP performance will remain at its previous level.   1. Adjustments will be made to the Priority for the skill, “The People on Earth”&nbsp; ㄴ Current: +50% Priority after Resurrection&nbsp; ㄴ Adjusted: +80% Priority after Resurrection</td><td>12/5</td></tr><tr><td>5</td><td>Class Stat Adjustments</td><td>We are reevaluating stat values, including Health and Defense, <br>which encompass Accuracy and Evasion, as part of an overall stat adjustment. <br>\n This is being done to maintain the value of certain classes that \nconsider Evasion a primary survival stat.(Class/The values will be \nindividually applied based on the characteristics of each subclass.)We will provide detailed adjustment information through announcements in the Update notice.</td><td>11/21</td></tr></tbody></table><p><br><strong>4. Equipment Balance Adjustments</strong></p><table><tbody><tr><td>No.&nbsp;</td><td>Category</td><td>Details</td><td>Effective date</td></tr><tr><td rowspan=\"2\">1</td><td rowspan=\"2\">Legendary Gear Unique Effect</td><td><br>We have identified that certain Legendary equipment exhibit excessively high synergy <br>when combined with specific Heroes or classes. Therefore, adjustments are being made to address this issue.Initially, adjustments will be made to the following category of equipment, and there is a possibility of further additions as we monitor the situation.</td><td rowspan=\"2\">11/21</td></tr><tr><td><br># Blue-Gems White Ring / Legendary Accessory (Defender)<br>  1. Current Unique Effect&nbsp; &nbsp;: Has a [80%] chance to increase the Priority of the caster by [15%] when hit2. Expected Unique Effect&nbsp; &nbsp;: Has a [100%] chance to increase the Priority of the caster by [10%] when hit &nbsp; &nbsp; (Activated once per turn)</td></tr></tbody></table><p><br><strong>5. PVE Balance Adjustments</strong></p><table><tbody><tr><td>No.&nbsp;</td><td>Category</td><td>Details</td><td>Effective date</td></tr><tr><td>1</td><td>Base &gt; Combat Calculation Module and Auto Combat</td><td>We\n have decided to remove the combat calculation module in the Base that \nupgrades the functionality of auto combat as it is deemed unnecessary \nand has become a barrier to early progression. <br>Consequently, this \nfeature will be eliminated, and auto combat will be enhanced to offer a \nmore streamlined and definitive auto combat experience.(Burst/Skill \nChain use and Battle settings) </td><td rowspan=\"2\">11/7</td></tr><tr><td>2</td><td>Boss Monster difficulty level</td><td># Difficulty level reduction for certain area bosses/gimmicks&nbsp;<br> 1) 2-11 : Core Guardian<br> 2) 3-11 : Forest King 3) 4-5 : Veronica  4) 4-11 : Schwartz5) Hardmode Adventure 10-6: Demiurge Stella\n&nbsp; &nbsp; (There is a certain failure rate in dungeons that are led by a story team.&nbsp; &nbsp; &nbsp;Hence, we will be enhancing the stats of NPC in these dungeons.)</td></tr></tbody></table>&nbsp;<hr><p>In this 5th Developer’s Note, <br>we would like to provide you with details about the balance elements that will be adjusted in this year's update.<br>Starting with this balance adjustment, we plan to review overall data approximately every three months and implement balance patches accordingly. We will provide further details through separate announcements once the schedule is confirmed. Please note that regardless of the overall direction of the adjustments, we will offer compensation to Masters who have   already acquired and been using these Heroes. Furthermore, as mentioned in the previous Developer's Note, we are actively preparing for real-time PVP, with a targeted release in December.We hope that you will look forward to this upcoming Update.<strong>[Developer’s Note Celebration Gifts]</strong><br>-&nbsp;<strong>Coupon Code</strong>: OUTERNOTE5<br>-&nbsp;<strong>Coupon Redemption&nbsp;Period</strong>: 11/06 (Mon) ~ 12/07 (Thu) 14:59 UTC<br>- <strong>Coupon Rewards</strong>: 500 Ether<br><br> This is all we have prepared for you for the 5th Developer’s Note.We will continuously strive to create a more enjoyable environment for our Masters.Thank you.</p></div>",
      "images": [
        "/developer-notes/2023-11-06-developer-s-note-5-november-to-december-balance-adjustments/6f396837335c47d4832ae1b479e15aa1.webp"
      ],
      "uid": "developer-notes:2023-11-06-developer-s-note-5-november-to-december-balance-adjustments"
    },
    {
      "id": "2023-10-31-developer-s-note-4",
      "title": "Developer’s Note #4",
      "date": "10-31-2023",
      "date_iso": "2023-10-31T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2023-10-31-developer-s-note-4/777560342db64bff972e6dfea6994c53_002.webp\" class=\"fr-fic\"><br><br></p><p>Hello, Masters!<br> This is Moonsoo Hyun, the producer of OUTERPLANE.<br> It's hard to believe it's already been half a year since I first greeted all of you, Masters. I am filled with gratitude to all the Masters who have played and cherished OUTERPLANEfrom the end of spring, through the hot summer, and into the beautiful fall.Today, we’re announcing details of ongoing improvements for the second half of the year and providing details about the half-year anniversary event.</p><hr><p><strong>◈ Improvements Details</strong><strong><br></strong>As mentioned in our previous Developer's Note,  <br>we have prioritized improving existing issues and inconveniences over adding new features. <br>We believe that this approach is more important for both our current and future OUTERPLANE players. In line with this, we have been working on the following improvements  based on feedback from many of our players.Many\n improvements, including those related to Arena, Guild, and Equipment \nPresets, were implemented with the 10/24 Update.   Further improvements \nare scheduled to be introduced in the upcoming updates on 11/7 and \n11/21. <strong>1. 10/24 Improvements</strong></p><p>&nbsp;<strong>1) Arena Improvements&nbsp;</strong></p><table><tbody><tr><td>No.</td><td>Category</td><td>Details</td></tr><tr><td>1</td><td>Minimizing the Arena Rank Refresh Interval</td><td>We have reduced the Arena Rank refresh interval from the previous 1-hour period, <br>&nbsp;enhancing the ability to respond quickly in high-tier player matches.</td></tr><tr><td>2</td><td>Memorial Match</td><td>To enhance notifications for Memorial Matches that might be missed, <br>&nbsp;we've improved convenience by implementing red dots and text notifications in case of any uncompleted Memorial Matches.</td></tr><tr><td>3</td><td>Enhanced Arena Ranking Rewards</td><td>Added initial Rank rewards for reaching Top 100, <br>&nbsp;offering additional rewards to Masters aiming for top PvP rankings.</td></tr><tr><td>4</td><td>Simplified Arena Reward Acquisition</td><td>To make it easier to earn victory points and climb the tiers during Arena matches,<br>&nbsp;we have introduced NPC opponents in the Gold and Platinum ranks.</td></tr><tr><td>5</td><td>Arena Defense Record Improvements</td><td>Improvements have been made to the Arena Defense Record, allowing you to check the opponent's attacking team.</td></tr><tr><td>6</td><td>Arena Win Rate Display Improvements</td><td>Improvements have been made to display the attack and defense win rates separately during Arena battles.</td></tr><tr><td>7</td><td>Initial Speed Policy Adjustments</td><td>To alleviate the negative experience of Masters who invest a lot of time in gear farming,<br>&nbsp;the first turn's random speed modifier at the start of a battle will be changed from -5~5% to 0~5%.</td></tr><tr><td>8</td><td>Auto Combat Setting Button</td><td>An Auto Battle Settings button has been added when entering Arena battles,<br>&nbsp;allowing Masters to easily edit and use their auto battle settings.</td></tr></tbody></table><p><br><strong>2) Guild Improvements</strong></p><table><tbody><tr><td>No.</td><td>Category</td><td>Details</td></tr><tr><td>1</td><td>Guild and Global Chat Adjustments</td><td>We\n have removed low-priority messages from the Global Chat, including \nLegendary Gear acquisition notifications, and from the Guild Chat, such \nas 3-Star Hero recruit messages.</td></tr><tr><td>2</td><td>Guild Buff Room Improvements</td><td>We\n have made improvements to allow players to check the available buff \ndetails in the Guild Buff Room and to receive Guild Buffs in the Lobby \nas well.</td></tr><tr><td>3</td><td>Guild Board</td><td>Improvements have been made to display red dots if there are any remaining Guild Raids or Guild Security Area.</td></tr><tr><td>4</td><td>Guild Raid Improvements</td><td>Improvements\n have been made to the management of clearing teams, making it easier to\n operate the clear decks by recording the team for each Guild Raid boss.</td></tr><tr><td>5</td><td>OtherGuild Improvements<br></td><td>[Improvements]<br> - Improvements have been made to allow players to check detailed Guild information when joining a Guild<br> - We have improved the clarity of the remaining time for rejoining the Guild after leaving it. - Improvements have been made to allow players to check information about other Guilds even while being a member of a Guild. - Improvements have been made to the information display to make Guild details more clearly visible when joining a Guild.\"  [Fixes]&nbsp;-\n An issue where the system message in Guild Chat was displayed \nincorrectly when a Guild announcement was written in multiple lines will\n be fixed.</td></tr></tbody></table><p><strong><br>3) Other Improvements</strong></p><table><tbody><tr><td>No.</td><td colspan=\"3\">Category</td><td>Details</td></tr><tr><td>1</td><td colspan=\"3\">Modeling Improvements - Stella</td><td>We received a lot of feedback expressing disappointment with the initial impressions. <br>&nbsp;As a result, we are working on improvements, and the first modeling to undergo renewal will be Stella.</td></tr><tr><td>2</td><td colspan=\"3\">Clear Team Records</td><td>We have introduced a feature that allows players to record the latest clearing team for high-difficulty dungeons. <br>&nbsp;Additionally,\n we've improved the Team Formation screen for dungeons where you failed,\n enabling you to view the successful records of other Masters.</td></tr><tr><td>3</td><td colspan=\"3\">World Map</td><td>Improvements have been made to allow players to check the stat/skills of the boss on the World Map.</td></tr><tr><td>4</td><td colspan=\"3\">Weapon/Accessory Display</td><td>Improvements\n have been made to the display to provide clearer information on which \nmain options will be added to weapons and accessories.<br>&nbsp;Improvements\n have been made to the display to provide clearer information on which \nmain options will be added to weapons and accessories in the Gear \ndungeon rewards list.</td></tr><tr><td>5</td><td colspan=\"3\">Event Dungeons</td><td>Improvements\n have been made to the notification system to provide clearer alerts \nwhen it's close to the end time for exchanging materials or the weekly \nopening time for locked dungeons.</td></tr><tr><td>6</td><td colspan=\"3\">Inventory Expansion</td><td>A function to increase inventory space by +100 slots to address the issue of equipment inventory shortages will be added.</td></tr><tr><td>7</td><td colspan=\"3\">Daily Missions</td><td>Adjustments have been made to the flow to ensure that daily missions can be completed even when focusing on specific content.</td></tr></tbody></table><p><br><strong>2. Upcoming Improvements</strong><br># We are currently preparing improvements based on the schedule provided below. <br>Please understand that some schedule changes may occur depending on the development progress.<strong>1) Visual Improvements</strong><br>We\n have received a lot of feedback regarding the initial impressions, and \nas a result, we are currently working on editing resources to improve \nthis aspect.<br>We plan to implement some of the improvements in the near future, and we also see this as a long-term challenge that we aim to address.</p><table><tbody><tr><td>No.</td><td>Category</td><td>Details</td><td>Schedule</td></tr><tr><td rowspan=\"6\">1</td><td rowspan=\"6\">Modeling Improvements</td><td>K &gt; Remodeling <br>&nbsp;: We plan to enhance the quality and overall impression of hair and face modeling.</td><td>11/21</td></tr><tr><td>Eva &gt; Remodeling / Partial Redesigning <br>&nbsp;: We plan to enhance the quality and design of hair and face modeling.</td><td>11/21</td></tr><tr><td>Tanya &gt; Redesigning <br>&nbsp;: Following the overall design modification, we plan to have her appear in the tutorial dungeons.</td><td>11/21</td></tr><tr><td>Idith &gt; Redesigning<br>&nbsp;: After the overall design modification, we plan to have her appear in the beginning areas.</td><td>11/21</td></tr><tr><td>Tio &gt; Remodeling <br> : We plan to improve the quality of hair and face modeling for Tio, <br>&nbsp; &nbsp;as she is a frequently used hero and is rewarded early on in the Check-In rewards.</td><td>11/21</td></tr><tr><td>Cindy &gt; Remodeling<br> : We plan to improve the quality of hair and face modeling for Tio, <br>&nbsp;: as she is a commonly used Hero in PvP content and more.</td><td>11/21</td></tr><tr><td rowspan=\"2\">2</td><td rowspan=\"2\">Early Stage Dialogue Improvements</td><td>We plan to renew the scenario screen UI (dialogue scene) which is most frequently viewed.</td><td>11/7</td></tr><tr><td>We are prioritizing the improvement of background images used in early-stage dialogue scenes <br> and are in the process of retouching existing 3D backgrounds to make them appear more like 2D backgrounds. <br>&nbsp;These changes will initially be applied to the tutorial and Area 1.</td><td>11/7</td></tr><tr><td>3</td><td>CG Improvements</td><td>We plan to renew some of the scenario CGs that appear in the main scenario.<br>&nbsp;Additionally,\n we will be incorporating an updated version with improved illustration \nquality, along with design changes for the existing redesigned Heroes.</td><td>11/7<br>&nbsp;11/21</td></tr><tr><td>4</td><td>Others: GUI Improvements</td><td>We plan to modify and implement changes to certain screen UI designs, along with the introduction of new fonts.<br> We plan to apply the changes to certain screen UI designs.<br> We awill focus on improving the most prominently exposed areas, and we plan to continue making long-term adjustments.  - Dialogue Scene / Tutorial Pop-up Screen - Multilingual translations will be provided for Tutorial Help - Hero screen and overall thumbnail improvements - Lobby screen improvements&nbsp;- Screen improvements including Shop / Daily Missions</td><td>11/7</td></tr></tbody></table><p><br><strong>2) Content Improvements and Adjustments</strong><br>- We are currently reviewing various aspects to address potential factors that may lead to players leaving the game.<br>&nbsp; &nbsp;We hope to ensure that new players can easily get into the game and have a positive experience.&nbsp; &nbsp;: To address these changes and the&nbsp; &nbsp;potential differences in rewards that may affect existing players,&nbsp; &nbsp;we plan to provide separate compensation to our current players when the improvements are implemented.- After reviewing our internal data,  &nbsp;\n &nbsp;we've identified areas where the player experience is diminished \ndue to insufficient opportunities for free Gacha rolls &nbsp; &nbsp;and limited chances to engage in Gacha.&nbsp; &nbsp;We are considering various approaches to address this issue and ensure a stable service.&nbsp; &nbsp;As part of our efforts to improve the situation, we plan to make changes to our mileage policy.&nbsp; &nbsp;We will provide further details about these changes through a separate announcement in the future.</p><table><tbody><tr><td>No.</td><td>Category</td><td>Details</td><td>Schedule</td></tr><tr><td>1</td><td>Check-in Rewards</td><td>Adjustments and improvements will be made to the rewards for New / Veronica’s Recruitment Supply / Season 2 Check-In Rewards.<br>&nbsp;Improvements\n will be made to provide more recruitment and growth opportunities \ncompared to the previous system. Additionally, we've made it possible to\n obtain Tio as a Day 1 Check-In reward, allowing you to go on adventures\n with her immediately.</td><td>11/7</td></tr><tr><td>2</td><td>Content Unlock Time Adjustment</td><td>Since the majority of content unlocking is concentrated in Area 3, <br> which is causing a lack of information and disrupting early game progression,<br>&nbsp;we have decided to make adjustments and improvements to certain tutorial and content unlock times.</td><td>11/7</td></tr><tr><td>3</td><td>Area Clear Missions and Guide Quests</td><td>Adjustments will be made to Clear Missions in existing Season 1 Normal/Hard Areas<br>\n : We plan to increase the unit mission intervals and adjust the \nrewards, allowing you to reset short-term goals by claiming rewards.<br> \n Veronica, a versatile hero with both short-term and long-term utility, \nwill replace Rhona as the distributed hero, improving usability.  &nbsp;As a result, guide quest pathways and rewards will be adjusted to reflect these changes.</td><td>11/7</td></tr><tr><td>4</td><td>Start Dash</td><td>After\n analyzing the complete dataset, we have observed that the Earth Hero, \nNoah, has an overwhelmingly high selection rate of 80%. <br> We believe that this has a negative impact on the game's diversity and fun factor. As a result, we will be making adjustments.<br>\n : While existing heroes have their own utility, we have noticed that \ntheir usefulness in adventure progression is lower than that of Noa. \nThey lack universality.     Therefore, we plan to make the following\n changes to all Start Dash heroes except Noa to ensure that early-game \nprogression is smoother, regardless of which hero you choose.&nbsp; &nbsp;- Current: Noa / Eliza / Laplace / Alice / Maxwell&nbsp; &nbsp;- Expected: Noa / Valentine / Rin / Eternal</td><td>11/7</td></tr><tr><td>5</td><td>Base &gt; Combat Calculation Module and Auto Combat</td><td>We\n believe that the Combat Calculation Module in Base for upgrading the \nAuto Combat feature is unnecessary and rather distracts the progress of \nthe game. Therefore, this feature will be removed, and improvements will\n be made to provide the final Auto Combat feature when using Auto \nCombat. (Burst/Skill Chain and Battle Settings)</td><td>11/7</td></tr></tbody></table><p><br><strong>3) Other Improvements</strong></p><table><tbody><tr><td>No.</td><td>Category</td><td>Details</td><td>Schedule</td></tr><tr><td>1</td><td>Codex</td><td>The\n ‘Receive All’ feature to receive all rewards when achieving the Growth \nGoal of Hero/Equipment and Collection Goal will be updated.</td><td>11/7</td></tr><tr><td>2</td><td>Costumes</td><td>Improvements will be made direct players to the purchase screen when checking unowned costumes.</td><td>11/7</td></tr><tr><td>3</td><td>Side Story Pieces</td><td>[Applied]<br> Changed to select 2-Star pieces from 1-Star pieces as a default<br>  [Scheduled] Improvements have been made to the team formation screen to allow the selection of reward pieces,&nbsp; and we plan to provide a pop-up notification if limited pieces are set as a reward.</td><td>11/7</td></tr><tr><td>4</td><td>Daily Missions</td><td>Improved UI to easily check daily/weekly mission rewards&nbsp;</td><td>11/7</td></tr><tr><td>5</td><td>Trust Level</td><td>Improved to display preferred Presents of each Hero</td><td>11/21</td></tr><tr><td>6</td><td>Filter</td><td>Improvements will be made to Hero/Equipment filters to make management easier</td><td>11/21</td></tr><tr><td>7</td><td>To prevent any inequality among Masters</td><td>concerning the acquisition of Sigma rewards,<br>&nbsp;we have made improvements so that Sigma is acquired automatically upon completing the 100th floor of Skyward Tower.</td><td>11/7</td></tr><tr><td>8</td><td>Expedition Team</td><td>We\n have increased the expedition time, which will now require reconnection\n in a simplified format compared to the previous version. &nbsp;<br>&nbsp;Additionally, there will be a reduction in stamina consumption.</td><td>11/7</td></tr></tbody></table><p><br>In addition to the improvements mentioned above, <br>we are currently examining various aspects of the game for further improvements.  We will continue doing our best to provide you with a more stable and enjoyable gaming experience.We would also like to extend our heartfelt apologies for any inconvenience caused by the motions and effects similarity issue of the new Hero, Akari.  We will modify and update current Akari’s motions and effects in the near future.We will do our best to prevent a recurrence of this situation  by strengthening the tracking of processes and results.We apologize again for any inconvenience caused by this issue. <strong>◈ Half-Year Anniversary Event</strong><br> We are thankful for the 6 months spent with our Masters thus far. <br> OUTERPLANE's half-year anniversary is just around the corner. On 11/18, to celebrate our half-year anniversary,  we're preparing a special event for our Masters.           During this event, Masters will have the opportunity to obtain 200 free Recruits through weekly Check-In Event rewards and currency. We hope our Masters are looking forward to the event starting on 11/21. (※ The Recruitment Ticket (Event) rewarded in this event does not provide any mileage rewards.)</p><hr><p>That's it for the November update in this Developer’s Note. <br> Apart from the information provided today, there are also some balance adjustments planned. <br>  We will promptly notify you through a separate Developer's Note. We're not just focusing on improvements and adjustments but also working diligently on creating new heroes, systems, and content.  We're committed to delivering a more enjoyable experience with substantial updates and events before the year comes to a close.<strong>[Developer’s Note Celebration Gifts]</strong><br>- <strong>Coupon Code</strong>: OUTERNOTE4<br>- <strong>Coupon Redemption&nbsp;Period</strong>: 10/31 (Tue) ~ 11/30 (Thu) 14:59 UTC<br>- <strong>Coupon Rewards</strong>: 500 Ether<br><br>We hope that our Masters are looking forward to the upcoming half-year anniversary event and update.  Once again, we would like to express our gratitude to all the Masters for their continued interest and support for OUTERPLANE.  Thank you.</p></div>",
      "images": [
        "/developer-notes/2023-10-31-developer-s-note-4/777560342db64bff972e6dfea6994c53_002.webp"
      ],
      "uid": "developer-notes:2023-10-31-developer-s-note-4"
    },
    {
      "id": "2023-09-15-developer-s-note-3-apologies-for-service-instability",
      "title": "Developer's Note #3: Apologies for Service Instability",
      "date": "09-15-2023",
      "date_iso": "2023-09-15T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2023-09-15-developer-s-note-3-apologies-for-service-instability/2ca3c80182804225a6b2fc76bdf3eb97.webp\" class=\"fr-fic\"><br></p><p>Hello,\n Masters. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<br> This is Moonsoo Hyun, the producer for OUTERPLANE.<br>&nbsp;</p><p>In\n today's Developer's Note, we would like to extend our heartfelt \napologies for the inconvenience caused by various issues and provide a \nbrief overview of the upcoming updates planned for the second half of \nthis year.</p><p><br> The completion of the first part of Season 2 on \n8/29 was intended to bring joy to our Masters, but unfortunately, it \nresulted in inconveniences due to various issues. We deeply apologize \nfor any inconvenience you may have experienced.<br> &nbsp;Our \ninitial goal was to add planned update content to minimize any periods \nwhere our Masters might lack engaging content. However, we understand \nthat this led to a decline in service quality. We are committed to \nreevaluating our internal development processes to ensure service \nstability and prevent such inconveniences in the future.</p><hr><p><strong>◈&nbsp;Update Information for the Second Half of the Year</strong></p><p><br> Here's a glimpse of what's in store with our upcoming updates for the second half of the year:<br> \n Among the promised update details mentioned in the previous note, most \nhave been implemented, except for the addition of Light and Dark \narmor/weapon raid dungeons. Initially, both Light and Dark raid dungeons\n were scheduled for release on 9/12. However, due to ongoing service \ninstability and our focus on improving service quality, we have decided \nto release the Light and Dark armor/weapon dungeons separately.   We appreciate your understanding regarding the delay in content updates.  <u>The main content updates</u> planned are as follows (please note that these may be subject to change based on development schedules):<br> <br><strong>1) Light/Dark Element Armor Raid</strong></p><p><strong>2) Light/Dark Element Weapon Raid</strong></p><p><strong>3) Elemental Tower</strong></p><p><strong>&nbsp; &nbsp; </strong>&nbsp;: A content designed to offer consistent rewards at moderate difficulties, distinct from the Skyward Tower.</p><p><strong>4) World Boss</strong></p><p>&nbsp;\n &nbsp; &nbsp;:&nbsp;Engage in a battle against a formidable boss, \ncompeting individually against players from the entire server. </p><p>&nbsp; &nbsp; &nbsp; &nbsp;This content is designed to motivate players aiming for PvE excellence.</p><p><strong>5) Real-time Arena</strong></p><p>&nbsp; &nbsp; &nbsp;:&nbsp;The long-awaited Real-time Arena will make its debut in the latter half of this year.<br> <br>&nbsp;We also plan to implement the following improvements to <u>enhance</u> your gameplay experience:</p><p><br> <strong>1) QoL Improvements</strong><br>&nbsp;\n &nbsp; &nbsp;:&nbsp;We have received numerous QoL improvement \nsuggestions since launch and have already implemented some. </p><p>&nbsp; &nbsp; &nbsp; &nbsp;Additional QoL improvements are in the pipeline.<br><strong>&nbsp;2) Balance Adjustments</strong></p><p>&nbsp;\n &nbsp; &nbsp;:&nbsp;We intend to readjust the fundamental&nbsp;balance \nand make necessary adjustments to hero and item effects before the \nrelease of the Real-time Arena.<br>&nbsp;</p><p>Throughout the latter \nhalf of the year, we will continue to make updates based on the outlined\n content, adding a new regular event area each month. <br> <br>&nbsp;While\n we have plans to expand Skyward Tower Hard Mode and The Archdemon's \nRuins, as well as&nbsp;make improvements that boost overall \nparticipation rates and tweak the difficulty of existing content based \non comprehensive data analysis, our immediate priority is to allocate \ndevelopment resources toward balance adjustments, improving overall \nservice stability, and enhancing QoL, rather than introducing new \nsystems or content.</p><hr><p>It's been over 100 days since OUTERPLANE's official launch. <br> <br> We want to express our gratitude for the incredible support our Masters have shown.  &nbsp;While\n Eva's Master may be \"K,\" we always remember that OUTERPLANE's true \nMasters are our players. As developers, we are committed to delivering \nstable services and enjoyable content for as long as possible.</p><p>We look forward to bringing you even more exciting content in the future. <br>&nbsp;</p><p>As\n a token of our appreciation for your patience and loyalty, we have \nprepared special celebration gifts in honor of this Developer's Note.</p><p><strong>[Developer’s Note Celebration Gifts]</strong></p><p><strong>- Coupon Code:</strong>&nbsp;<strong>OUTERGIFT</strong></p><p><strong>- Coupon Redemption&nbsp;Period: </strong>9/15 (Fri) ~ 10/14 (Sat) 14:59 UTC</p><p><strong>- Coupon Rewards:</strong> Special Recruitment Tickets x10</p><p>Thank you.</p></div>",
      "images": [
        "/developer-notes/2023-09-15-developer-s-note-3-apologies-for-service-instability/2ca3c80182804225a6b2fc76bdf3eb97.webp"
      ],
      "uid": "developer-notes:2023-09-15-developer-s-note-3-apologies-for-service-instability"
    },
    {
      "id": "2023-06-16-developer-s-note-2-update-roadmap-and-direction-of-development",
      "title": "Developer's Note #2: Update roadmap and direction of development",
      "date": "06-16-2023",
      "date_iso": "2023-06-16T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><img src=\"/developer-notes/2023-06-16-developer-s-note-2-update-roadmap-and-direction-of-development/aa5d1430279944c9971475fe55ffc6d6_002.webp\" class=\"fr-fic\"><p>Hello,\n Masters. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <br> This is Moonsoo Hyun, the producer for OUTERPLANE.<br> First,\n I'd like to apologize for the inconvenience caused by various issues \nthat have occurred after the June 7th update. The issues that we have \nidentified have been addressed through the June 13th update, and we will\n do our best to respond to any issues that might remain or be newly \ndiscovered as quickly as possible so that we can minimize any potential \ninconvenience to our players. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; </p><p>In\n today's Developer's Note, we'd like to announce our planned updates \nthrough the month of August. In addition, as many of our players have \nraised questions regarding topics such as when Demiurge Stella will \nbecome available, the schedule for new hero releases, and the balance \nadjustments as mentioned in the previous Developer's Note, I'd like to \ntake some time today to address them and talk about our plans going \nforward.</p><p><strong>1. Update Roadmap: Overall Direction and Update Details</strong><br>&nbsp;<strong>▶ Update Direction</strong><br><strong>&nbsp;1) Short-Term Direction</strong><br> - Primarily, we are focusing on resolving various issues remaining within the game and reducing gameplay fatigue.<br>\n - To that end, we will be reducing the difficulty of Daily Missions \nwhile also improving the supply of Clear Tickets    and how they're \nacquired. We will also be reducing the difficulty of purchasing gear \nfrom the Survey Hub, thereby indirectly reducing the difficulty of \nprogressing through Hard difficulty.   Additionally, with the recent \naddition of Guild Raid content,   some quality of life issues have come \nto light regarding exchanging  gear sets, and we will be working to \ndevelop and implement a solution as quickly as possible.- We are \nalso working to improve various other elements throughout the game,   \nand until we feel that enough issues have been resolved and that the \ngame has stabilized,   we plan to continue releasing patches on a weekly\n schedule.<strong>2) Mid- to Long-Term Direction</strong><br> - \nWe are planning updates that will expand the scope of available content \nin order to provide players      with more gameplay to enjoy and more \nobjectives to work towards.<br> -  Key points for each month's updates are as follows:</p><p><strong># June</strong></p><p>-\n In June, our goal is to introduce group content for Guilds to enjoy \n&nbsp;and gameplay objectives for individual players through the \naddition of Guild Raids and a League system for the Arena.<br>- We are \naware of the various issues that are affecting Guild Raids, and we plan \nto fix as many of them as    we can before the next season begins in \norder to ensure that our players have a more enjoyable and comfortable \nexperience.<br>- As there is not much time left in the month, we plan to\n focus on providing stable updates while moving forward with various \nplanned improvements.</p> <br> <strong># July</strong><br>\n - July marks the beginning of summer, and the beginning of our summer \nevent. (This will likely come in the form of a new Summer Event Story \nArea)<br> - Furthermore, our main content update will feature the \nexpansion of difficulty levels for the Special Request Dungeons used to \nfarm equipment.  - We also plan to expand the Archdemon's Ruins, and\n Challenge Missions will be added to the Guide Quest that provide \nchallenges involving new content.  <strong># August</strong><u><br></u>- In August, we plan to update the Story area of Season 2 Part 1.<br>\n - Additionally, Light/Dark Element Raids will be added as well as Hard \ndifficulty to the Skyward Tower to provide additional challenges for \ndaring Masters who wish to take them on.<p><strong>3) Events</strong><br>- Events to promote various in-game content will take place regularly on a weekly cycle following the July 4th maintenance.<br> - The events will rotate on a per-week basis and will consist of the following:    : Increased Raid gear drop chance and decreased crafting cost      : Increased acquisition of Pieces from Side Stories and increased acquisition of Investigation points     : Increased acquisition of Arena Medals and increased acquisition of Guild Coins and Medals         :Various other events such as hot time events</p><p>&nbsp;- There will also be additional events outside of the fixed schedule outlined above.<br>&nbsp;\n &nbsp;: We expect to release Event Story Dungeons at a rate of about 1 \nper month and estimate the volume to be similar to <br>      or greater than The Reaper and the Gangster.<strong>▶ Update Summary<br>&nbsp;</strong>-\n Many of you have provided us with valuable insight regarding \ninconveniences in the user experience     and the structure of the game.<br>-\n With that in mind, we are preparing the following updates that will \ntake place through August. Please refer to the image below for details.</p><img src=\"/developer-notes/2023-06-16-developer-s-note-2-update-roadmap-and-direction-of-development/b4a658ab19e542478f487d69581929d8.webp\" class=\"fr-fic\"><p><br><strong>2. Recruitment and Balance<br> ▶ Recruitment<br>&nbsp;</strong><strong>1) Plans for New Hero Releases</strong><br> - We plan to release new heroes at a steady pace of once every 2 weeks.<br>\n : The new heroes are being planned to fill in gaps in the availability \nof 3★ heroes of each battle type for every element in order to round out\n team compositions when building elemental teams. We plan for these \nheroes to have effective use cases in PvE, PvP, or Guild Raids depending\n on their characteristics.  <strong>2) Demiurge Stella Recruitment</strong><br>- Demiurge Stella, the highly anticipated final boss of Season 1, is scheduled to be added with the June 20th update.<br>-\n Given her iconic status as a character, we plan to introduce her \nthrough an exclusive recruitment   under the theme of Season Boss \nRecruitment.   Her Targeted Drop Rate Recruitment will be available for a\n period of about 3 months,   so that players will have a chance to \nrecruit her without being too pressed for time.- Demiurge Stella \nwill be available for recruitment through a separate recruitment \nresource,    Call of the Ruler, which can be purchased from the in-game \nshop.- In order to provide a wider variety of opportunities to \nacquire Call of the Ruler, exclusive missions will be available whose \ncompletion will provide 2 free recruitment opportunities every day for 1\n month following the update. (Up to 60 recruitments in total)- \nDemiurge Stella was designed as a Light element Bruiser Striker, and she\n displays outstanding performance in PvP and Boss Raids.</p><p><strong>▶ Hero Balance<br>&nbsp;</strong><strong>1) Hero Recall Feature</strong><br>-\n The Hero Recall feature as mentioned in the previous Developer's Note \nis planned to be introduced as a part of the June 27th update. (The name\n of this feature may be subject to change)<br>- This feature will be \navailable through the Hero screen. Using it will refund all growth \nresources used on the hero with the exception of Hero Pieces, and \nobtained Exclusive Equipment will be taken back. (Slotted Gems will be \nmoved to the Inventory)- Codex Growth Goal rewards and Trust Level rewards will not be provided a second time. (Does not apply to Exclusive Equipment)-\n This feature will be available for use 2 times, and the benefits will \nbe provided equally to all accounts. (New accounts included) <strong>&nbsp;2) Hero Balance Details</strong><br><u>2-1.</u> First, we have made adjustments to Rin and Alice on June 13th.<br>    ㄴ Rin: The effects of Skills 1 and 3 have been modified to allow Rin to better serve her role as a damage dealer against <br>                   Fire element enemies, and the damage of her Burst level 3 has been increased.    ㄴ Alice: The effects of her Skill 2 and her Exclusive Equipment have been enhanced to improve her performance in PvP. <u>2-2.</u> We plan to make the following changes as part of the 2nd balance update<br>          (June 27th / to be introduced with the Hero Recall feature) <br>    ㄴ Talisman Adjustments         : The Talisman's Chain Points/Action Points recharge effect will no longer activate from additional attacks. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;(Does not apply to additional turns)</p><p><br><u>2-3.</u>\n Currently, Noa and Vera are the only heroes capable of recharging Chain\n Points/Action Points through the method above, and therefore they will \nbe the only heroes affected by this change.                             \n    <br>    ㄴ Because Noa's damage increase proportional to Max Health \nis capped,          we decided that there were largely no issues with \nher damage output.                                                <br>    ㄴ However, we felt that her ability to reduce Weakness Gauge and recharge Chain Points through additional attacks \n          and her Skill Chain Passive were too powerful, so we have made\n these adjustments.                                                     \n       <u>2-4.</u> We plan to introduce these changes side by \nside with the Recall feature to minimize any inconvenience players might\n encounter while progressing through the game.<br><br></p><p><u>2-5.</u> Additional Adjustments<br>\n     ㄴ While Noa is meant to be a damage dealer effective at generating \nChain Points, a critical element in clearing Boss Raids, <br>           we felt that dependency on her had become excessive, leading us to the changes outlined above.            In exchange, the following adjustments will also be made to Chain Point generation as a whole.                     : Adjustment to Chain Point generation depending on the elements of heroes on the team               # Before = 4/5/6/7 per hero of the same element in the team &gt;&gt;&gt; After = 4/6/7/8&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; : We expect this change to improve \nSkill Chain generation in the early game and in later Raid Dungeons that\n players will be tackling with heroes of a single advantageous element. \n&nbsp; &nbsp; </p><u>2-6</u>. Future Balance Adjustment Plans (After July)<br>     ㄴ We plan to make changes improving Weakness Gauge reduction and Chain Point generation for natural 3★ heroes. <p>&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; (These changes are still under review, and \nwe plan for them to be implemented between late June and early July.)<br><br>We\n will do our best to adhere to the development plans outlined in this \nDeveloper's Note, and we will review each and every update with care to \nmake sure players can enjoy the game to its fullest.  We hope that you have a fantastic summer, and we wish you all the best. OUTERPLANE will continue to listen to your valuable opinions. &nbsp;Thank you. &nbsp; </p></div>",
      "images": [
        "/developer-notes/2023-06-16-developer-s-note-2-update-roadmap-and-direction-of-development/aa5d1430279944c9971475fe55ffc6d6_002.webp",
        "/developer-notes/2023-06-16-developer-s-note-2-update-roadmap-and-direction-of-development/b4a658ab19e542478f487d69581929d8.webp"
      ],
      "uid": "developer-notes:2023-06-16-developer-s-note-2-update-roadmap-and-direction-of-development"
    },
    {
      "id": "2023-06-02-6-2-fri-developer-s-note",
      "title": "6/2 (Fri) Developer's Note",
      "date": "06-02-2023",
      "date_iso": "2023-06-02T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><p><img src=\"/developer-notes/2023-06-02-6-2-fri-developer-s-note/28a775ebef2c43898c6f942d88f0732e_002.webp\" class=\"fr-fic\"></p><p>Hello, Masters.<br>This is Moonsoo Hyun, the producer of OUTERPLANE.<br>We are truly happy and grateful to have been able to officially launch the game on the planned date of May 23rd.&nbsp;We would like to thank all our players who have believed in us and shown us patience. As\n for myself, I have been hard at work since the official launch playing \nthe game alongside everyone else and preparing for upcoming updates.</p><p>Seeing so many players enjoy the game is really encouraging for us at the development team, <br>and we are working hard every day to continue developing the game. <br>At the same time, we are aware of the various issues affecting the game, such as bugs, connection instability, and other issues spread throughout different areas of content. We take these issues very seriously, and I would like to take this opportunity apologize for any inconvenience you might have experienced.Currently, our team is in the process of preparing improvements for the game while working with Smilegate Megaport, our publisher, to review player feedback and statistics from the game. We hope to provide you with continued improvements alongside our planned updates.Today, I'd like to introduce you to some improvements and updates we have planned for the 7th of June, and beyond the topics discussed today, we'll continue to keep our eyes and ears open for player feedback to bring you a more enjoyable gaming experience.</p><hr><p><strong>▶&nbsp;6/7 Maintenance and Update</strong></p><p><strong># Key Improvements</strong></p><p><strong>1. Improvements to Recruitment: Mileage carryover and increased recruitment chance</strong><br>First, let's take a look at improvements to recruitment. <br>Mileage\n obtained while recruiting heroes will no longer disappear, and instead \ncarry over into the next drop rate up recruitment. Hero recruitment \nchance will also be increased, allowing players to obtain new heroes and\n drop rate up heroes more easily. While we also plan to bring improvements to the products and perks available in the shop, we have decided to prioritize improving recruitment, the feature most often used by players, in order to lower the difficulty of acquiring new heroes.※&nbsp;Mileage\n carryover will begin with the currently ongoing Rin and Valentine Drop \nRate Up Recruitments, and remaining mileage will not be converted into \nStar's Memory.</p><p><strong>2. Improvements to Hero Pieces: Regular events and cost re-evaluation</strong></p><p><strong>A. &nbsp;</strong> &nbsp; Many players have brought up the issue of difficulty related to collecting pieces to transcend heroes, <br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;and we plan to prioritize looking into possible solutions and relaxing its difficulty. <br>&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp;We plan to lower the cost associated with \nhero transcendence from where it was initially so that 6 star heroes &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;become attainable with less resources and effort.</p><p><strong>B. &nbsp; </strong>&nbsp; &nbsp;Specifically, starting from June 7th, there will be regular events providing increased drop rate for pieces, <br>&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; and the pieces of certain heroes will be \nmade available through upcoming event and content rewards.&nbsp;<br></p><p><strong>C. &nbsp; &nbsp; </strong>&nbsp;The value of 6-star transcendence will also be adjusted in order to progressively <br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;bring down their total cost in terms of time and resources. <br>&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;These changes are still a work in \nprogress, and we will provide additional details through a future \nnotification.</p><p><strong># 6/7 Update Notice</strong></p><p>While\n this update will come with a variety of changes such as bug fixes, \nstability improvements, resource modifications, the notable contents of \nthe update will consist of the following three elements.<br><br></p><p><strong>1. New Character</strong></p><img src=\"/developer-notes/2023-06-02-6-2-fri-developer-s-note/95befeb027a141e6879f4bd4b0ed2fa3.webp\" class=\"fr-fic\"><table><tbody><tr><td><strong>[Eternal]</strong><br>Eternal is a charming yet deadly hero (fire element/mage/enchanter) <br>capable of inflicting a wide range of powerful debuffs to enemies. She can provide versatile support in battle with her debuffs that reduce Defense and Speed.</td></tr></tbody></table><p><br>As she provides speed and stability in clearing fire element armor and weapon raids, <br>we expect to see her widespread adoption.</p><p><strong>2. Guild Raid</strong></p><p><img src=\"/developer-notes/2023-06-02-6-2-fri-developer-s-note/fd07191d5f244872a46db235ae4d70b5.webp\" class=\"fr-fic\"></p><p>&nbsp;<strong> &nbsp;i.</strong>&nbsp; &nbsp; In Guild Raid, you will cooperate with your guildmates to challenge powerful bosses <br>&nbsp; &nbsp; &nbsp; &nbsp; and compete with other guilds over the course of 2 weeks to reach the top of the leaderboard.<br></p><p>&nbsp; <strong>ii.</strong> &nbsp;There you will find sub bosses called Geas Guardians and a main boss based on each season's theme. <br>&nbsp; &nbsp; &nbsp; &nbsp; You must work with your guildmates to first defeat the Geas Guardians, <br>&nbsp;\n &nbsp; &nbsp; &nbsp; then use the Geasa you've acquired to take on the \nmain boss as efficiently as possible and reach for the highest score.</p><p>&nbsp;<strong>iii. </strong>&nbsp; This season's Guild Raid will feature [Devout Follower of Scientific Inheritance Maxwell]. <br>&nbsp; &nbsp; &nbsp; &nbsp; Challenge Maxwell who has been reborn as a powerful water element boss to obtain various rewards <br>&nbsp; &nbsp; &nbsp; &nbsp; with your fellow guild members.</p><p><img src=\"/developer-notes/2023-06-02-6-2-fri-developer-s-note/10dc21b3bc5d48c0acfe1f285b79c14f.webp\" class=\"fr-fic\"></p><p> &nbsp;iv. &nbsp; Developer's Gameplay Tip</p><p>&nbsp; &nbsp; 1) Working with your guild members, first defeat the Geas Guardians and make use of the various <br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Geasa you acquire to help you in your fight against the boss.</p><p>&nbsp; &nbsp; &nbsp;2)&nbsp; Scientific Inheritance Devotee Maxwell is weak against earth element heroes. <br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Laine, Yuri, and Alice will be especially effective at countering his main mechanic.</p><p><strong>3. Event Dungeon</strong></p><p>An event dungeon, The Reaper and the Gangster, will be added. You will be able to check out a short story of the <br> new hero Eternal and obtain various rewards.<br>You will also be able to get a cute mascot character based on Eternal, so please make sure to enjoy this new content!</p><p><img src=\"/developer-notes/2023-06-02-6-2-fri-developer-s-note/fe9cde427768427088437fa61a961a97.webp\" class=\"fr-fic\"></p>There will also be other various improvements and changes. <br>We will provide the details in the 6/7 patch notes that will be released on 6/6.<p><strong># Improvements Planned for after June 7th</strong></p><p>We have received your feedback regarding the following issues, and we plan to address them <br>and make improvements as outlined below. We are planning to roll out these changes as quickly as possible, <br>but as these changes will require additional development, we\n would like to ask for your understanding in our being unable to specify\n an exact date for their implementation at this time. However, \nindividual changes among these that can be implemented quickly will be \napplied as soon as possible following a review of overall content balance. We will provide the details of the timeline for each of these changes through a future notification.</p><p><strong>1. Changes to Hero Growth</strong></p><p>We have noticed an issue where team compositions become more stagnant the more gameplay progresses. <br>This has the potential to not only negatively impact hero balance but also increase the difficulty of account progression.</p><p>In order to allow players to more easily raise a wider hero pool and access a greater variety of content, <br>we plan to implement the following changes.<br><strong>A.&nbsp; </strong>&nbsp;Increased income for growth-related resources<br>&nbsp; &nbsp; &nbsp; &nbsp;The daily entry limit for the Gold, EXP, <br>&nbsp;\n &nbsp; &nbsp; &nbsp;and Upgrade Stone farm dungeons will be slightly \nincreased to alleviate their scarcity at a basic level, &nbsp; \n&nbsp; &nbsp; &nbsp;and in order to promote growth after level 60, which\n can be demanding in terms of EXP and Upgrade Stone requirements, &nbsp;\n &nbsp; &nbsp; &nbsp;the entry limit of limited-entry dungeons and the \noverall EXP gain in Hard difficulty will be increased. &nbsp; &nbsp; &nbsp; &nbsp;This will also provide a slight increase to the availability of presents, &nbsp; &nbsp; &nbsp; &nbsp; shortening the time required to acquire exclusive equipment.</p><p><strong>B.</strong>&nbsp; &nbsp; Decoupling Hero Levels and Upgrades<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;At present, due to max level being limited by Upgrade Stones, <br>&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp;hero growth can stall altogether when a hero\n reaches max level while the required Upgrade Stone dungeon is not \navailable.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;While the \ncurrent relationship between skill enhancement and hero upgrades will be\n maintained, &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;we will be changing \nhero level requirements so that heroes will be able to reach level 100 \nregardless of upgrade status &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;given sufficient acquisition of EXP.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Following the changes above, upgrades will be carried out independently, &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; and hero growth resulting from upgrade level will be slightly increased.&nbsp;</p><p><strong>&nbsp; C.&nbsp; &nbsp; </strong>Hero Resource Recall<br>&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We will develop and implement a \nfeature allowing players to recall resources spent on hero growth that \nthey wish to undo.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \n&nbsp;This feature will likely come with a limit in its number of uses, <br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;but a function to reset the growth of a hero (excluding transcendence) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;and recall the resources spent will be provided by default for each account.</p><p><strong>&nbsp; &nbsp;D:</strong>&nbsp; &nbsp; Other<br>&nbsp;\n &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;We plan to slightly increase the \navailability of lower tier Skill Books that can be found through the \nResource Shop <br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;and Infinite Corridor.</p><p><strong>2. Changes to Hero Balance</strong></p><p><strong>&nbsp;i. </strong>&nbsp;\n  We will be adjusting hero balance in order to resolve the issue of \nstagnating team compositions and to improve the utility of underused \nheroes. Furthermore, we plan to adjust the balance of Talismans that \nserve as the core of boss battle strategies.<br><br></p><p><strong>ii. &nbsp;</strong> Should this process result in a nerf, we will be providing hero resource recall functionality at the same time, <br>&nbsp; &nbsp; &nbsp; &nbsp;and we will announce the details through an advance notice before proceeding with the changes. <br>&nbsp; &nbsp; &nbsp; Our intended goal is to increase the pool of viable heroes for each area of content, &nbsp; &nbsp; &nbsp; and as our vision for the game remains to allow for the levelling and gearing of heroes of each element &nbsp;\n &nbsp; &nbsp; to the requirements&nbsp; respective to each area of \ncontent, we will do our best to avoid nerfs that may cause players \nconcern.</p><p><strong>&nbsp;iii.</strong>  Rather than carry out these changes in a rush, we plan to carefully look into repercussions these changes <br>&nbsp; &nbsp; &nbsp; &nbsp;may have in the game's overall combat. <br>&nbsp;\n &nbsp; &nbsp; &nbsp; Further more, we plan to continue with regular \nbalance adjustments as part of our update schedule going forward.</p><p><strong>&nbsp;iv. &nbsp;</strong>In\n the nearest future, this will happen in the form of buffs to 2 heroes \nwhose utility has fallen greatly behind our expectations.</p><p>&nbsp; &nbsp; &nbsp;1) <strong>Rin</strong><br>&nbsp;\n &nbsp; &nbsp; Our initial intent was to allow players to take advantage\n of Rin's AoE attacks to easily progress through Story Mode <br>&nbsp; &nbsp; &nbsp; &nbsp;in the early game, and for her to become an effective main DPS against fire in the late game. &nbsp; &nbsp; &nbsp; &nbsp;As her current performance is falling behind relative to expectations, we will be giving her a buff.</p><p>&nbsp; &nbsp; 2)&nbsp; <strong>Alice</strong><br>&nbsp; &nbsp; Our goal for Alice was for her to be hero whose moderate PvE performance would be made up for by <br>&nbsp; &nbsp; &nbsp;a stellar performance in PvP. &nbsp; &nbsp; As her usage rates appear to be low due to issues with the Priority Gauge increase effect on her skill 2 &nbsp; &nbsp; and the activation chance of the effect on her exclusive equipment, we will be giving her a buff.</p><p><strong>3. Changes to Monster Balance (Mechanics)</strong></p><p><strong>&nbsp;i. &nbsp; </strong>We are aware of certain monster mechanics that can pose too high of a hurdle, and we will be making changes accordingly.</p><p><strong>&nbsp;ii. </strong>&nbsp; As there is a sense of accomplishment in overcoming these hurdles, <br>&nbsp;\n &nbsp; &nbsp; &nbsp; we will be adjusting these mechanics to pose a \nmore reasonable challenge rather than dial the difficulty down too far.</p><p><strong>&nbsp;iii</strong>. &nbsp; First, certain Bosses encountered during initial progression that are too difficult will have the difficulty of <br>&nbsp; &nbsp; &nbsp; &nbsp; their mechanics adjusted down (Area 6 Deckard / Area 10 Ksai / Demiurge Stella), <br>&nbsp; &nbsp; &nbsp; &nbsp; and in the Skyward Tower, bosses that become a hurdle for players, such as Sigma, &nbsp; &nbsp; &nbsp; &nbsp;will have their difficulty re-evaluated and adjusted again.</p><p><strong>4.&nbsp; Changes to Side Stories</strong></p><p>We have noticed an issue where players spend all of their side story entries through piece farming <br>and become unable to view the story. Changes will be made so that side story entries will not be expended <br>outside of dungeons where pieces can be collected.</p><hr><p>I'm glad to have been able to introduce myself through a developer's note.<br>I hope this post will help alleviate some of the inconveniences players may have experienced since the game's launch.<br>We will continue to communicate with you, the players, and listen to our your voicesin order to bring you a wonderful and inspiring adventure in the world of OUTERPLANE.</p><p>Last but not least, we have prepared a small gift as a thank-you to all our players.</p><p><strong>[Developer's Note Thank-You Gift]</strong></p><p>- Availability: 6/2 (Fri) - 6/7 (Wed) 23:59 KST</p><p>- Gift: 500 Ether</p><p>* You can find the gift in the mailbox by logging into the game within the time period specified above.<br><br></p><p>We hope for your continued love and support for OUTERPLANE.<br>The world of Mirsha awaits you.<br>Thank you.</p></div>",
      "images": [
        "/developer-notes/2023-06-02-6-2-fri-developer-s-note/28a775ebef2c43898c6f942d88f0732e_002.webp",
        "/developer-notes/2023-06-02-6-2-fri-developer-s-note/95befeb027a141e6879f4bd4b0ed2fa3.webp",
        "/developer-notes/2023-06-02-6-2-fri-developer-s-note/fd07191d5f244872a46db235ae4d70b5.webp",
        "/developer-notes/2023-06-02-6-2-fri-developer-s-note/10dc21b3bc5d48c0acfe1f285b79c14f.webp",
        "/developer-notes/2023-06-02-6-2-fri-developer-s-note/fe9cde427768427088437fa61a961a97.webp"
      ],
      "uid": "developer-notes:2023-06-02-6-2-fri-developer-s-note"
    },
    {
      "id": "2023-05-22-your-curiosity-satisfied-director-s-q-a",
      "title": "Your curiosity satisfied! Director's Q&A",
      "date": "05-22-2023",
      "date_iso": "2023-05-22T00:00:00.000Z",
      "author": null,
      "sourceUrl": null,
      "coverImage": null,
      "html": "<!----> <div><img src=\"/developer-notes/2023-05-22-your-curiosity-satisfied-director-s-q-a/b09f9ec06b5f4be6a5aa4d03af9ed831_002.webp\" class=\"fr-fic\"><p><strong>The Action Anime, OUTERPLANE</strong></p><p><strong>Hello, this is OUTERPLANE.</strong></p><p>We gathered together frequently asked questions from our community</p><p>and gave them to our director to answer.</p><p>Please take a moment to check out our down-to-earth Q&amp;A! :-)</p><p><strong>Q1. Do you have plans for a real-time arena, and if you do, when will it be implemented?</strong></p><p>We\n are currently in the process of developing a real-time arena, and we \nhave plans to implement it in-game. However, we hope you understand that\n it is difficult for us to pin down an exact date for its implementation\n at this time.</p><p>Our\n number one priority at the time of the global launch is to support our \nplayers so that they are able to achieve a steady sense of growth and \nsettle into the game through game modes such as story mode and raid \ndungeons.</p><p>As\n the real-time arena is being prepared to be a part of endgame content, \nwe plan to introduce it after taking player progression and statistics \ninto account. Once the time frame of its implementation has been \ndecided, we will announce the specifics through updates and notices.</p><p><strong>Q2. Will the global launch take place through the addition of new languages and servers to the existing version?</strong></p><p><strong>Also, will we be able to freely select our servers after the launch?&nbsp;</strong></p><p>Yes, the global launch will come in the form of new servers being added and new languages being supported.</p><p>Japanese\n voices will be added in the global version, and text translations will \nbe available in Korean, Simplified Chinese, and Traditional Chinese, \nalong with English which is already in the game.</p><p><strong>Q3. Will we be able to freely select our servers after the launch?</strong></p><p>Yes, you will be able to select your server.</p><p><strong>Q4. Do you have plans to release a PC version, and if so, what will its system requirements be?</strong></p><p>We are currently planning to expand to the PC platform through Google Play Games.&nbsp;</p><p>We are aiming for its implementation within the month of June, and we will soon announce the details through a notice.</p><p><strong>Q5. Why is there a limit on Stamina purchases when the game puts so much emphasis on gear farming?</strong></p><p>Analyzing\n other similar turn-based games with respect to new player experience \nand service longevity has led us to the conclusion that the factor most \nresponsible for the continuously widening gap in power between users was\n a system that allowed for gear farming with no limit to Stamina.</p><p>That\n is why we decided to put a limit on Stamina in OUTERPLANE so that \nplayers can enjoy the game more casually in comparison to other \ngames.&nbsp;</p><p>However,\n the limit on Stamina purchases is up for change depending on what \nplayers find more enjoyable once the game has officially launched.&nbsp;</p><p>If any changes do occur in the future, we will disclose the details in advance through an announcement.</p><p><strong>Q6. How is OUTERPLANE different from other turn-based RPGs?&nbsp;</strong></p><p><strong>We\n know that the Speed stat also exists in OUTERPLANE. Does that mean \nOUTERPLANE will be another game where the fastest person always comes \nout on top?&nbsp;</strong></p><p>Yes,\n the Speed stat also exists in OUTERPLANE. In many turn-based games, \nSpeed holds the position of a highly important and versatile stat. In \norder to lower the dependence on Speed in PvP, OUTERPLANE has placed its\n focus on Accuracy and Evasion.&nbsp;</p><p>In\n the early game, it will be possible to use the Speed stat to gain the \nupper hand in PvP, but as time progresses, we expect players to be able \nto overcome the Speed stat through the use of Accuracy and Evasion sets,\n as well as by utilizing various team compositions and mechanics such as\n Counterattack and Revenge. Additionally, we will continuously monitor \nPvP statistics so that various team compositions and strategies become \nviable.</p><p><strong>Q7.&nbsp;</strong><strong>There\n have been complaints from users who have played the build launched in \nSingapore, Malaysia, and the Philippines regarding the difficulty of \nacquiring growth materials.</strong></p><p><strong>They\n found raising star levels to be especially difficult, which resulted in\n the gameplay feeling slow. How do you plan to address this issue?&nbsp;</strong></p><p>We understand that this question is related to Hero Piece farming.&nbsp;</p><p>Our\n data suggests that it takes three months to fully transcend 3 Star \nHeroes, 45 days for 2 Star Heroes, and one month for 1 Star Heroes.</p><p>This might seem like an appropriate amount of time to some, while it might seem too long to others.</p><p>At\n present, Hero Pieces can be farmed by playing Side Stories. Players can\n also transcend Heroes by using Ether obtained while playing or by using\n duplicate pulls from Recruitment.</p><p>In\n addition to this, we plan to regularly produce and release a variety of\n events and event dungeons. We plan to provide an opportunity for \nplayers to obtain certain Hero Pieces more easily through such content, \nand we will continue to hold discussions regarding the most suitable \napproach based on player opinion and the status of live operations.</p><p><strong>Q8. Will there be pity?</strong></p><p>The pity is set to 200 pulls.</p><p><strong>Q9, There has been a lot of talk regarding the use of illegal programs. How do you plan to respond to this issue?</strong></p><p>Ever\n since the game's launch in Singapore, Malaysia, and the Philippines, we\n have continued to ban accounts that made use of illegal programs and \nhave posted notices in this regard.&nbsp;</p><p>Once\n the usage of illegal programs is identified, we first make a record of \nthe relevant data then proceed with administrative action after \nadditional investigation.&nbsp;</p><p>Please\n note that we adhere to the steps outlined previously as immediate \nadministrative action without the saving of records leaves open the \npossibility for the users of illegal programs to abuse the system. We \nwill continue to do our best to ensure that players can enjoy OUTERPLANE\n in a pleasant environment.</p><p><strong>Q10. Will there be pets?</strong></p><p>Currently, we have no plans to add pet-related systems.&nbsp;</p><p>However, we do have plans to provide a system where players can obtain SD characters through event dungeons.&nbsp;</p><p>At\n the moment, players have the ability to use Heroes they've obtained to \ndecorate their lobbies. We are currently developing a feature that will \nallow players to use the SD characters they collect to decorate their \nlobbies as well.</p><p><strong>Q11. I would like to hear your honest opinion regarding the criticism that the 3D cut scenes look unnatural.</strong></p><p>As gamers first, we are well aware of the areas of our game that fall short and we are doing all that we can to remedy them.</p><p>We are also making efforts to improve our capabilities and pursue the path to a more polished game.</p><p>Specifically,\n we are in the process of recruiting additional talent and devoting more\n of our resources towards improving the game's quality.</p><p>As\n a company that places emphasis on in-game action and its presentation, \nVAGAMES aims to leverage its strengths to bring to life elements that \nare not easily found in other turn-based games.&nbsp;</p><p>We are confident that the players will share our enthusiasm in this regard.</p><p>We have received a lot of feedback and requests regarding the Ultimate animations during the CBT, and we agree with them.</p><p>We\n will try our best to overturn these reactions and ensure that \nOUTERPLANE can match other recently-released games. We won't let you \ndown :-)</p><p><strong>Q12.\n A lot of high-quality games have come out recently. What unique \nstrengths does OUTERPLANE have to offer that make it stand out in such a\n competitive market?&nbsp;</strong></p><p>We do think that we have lost a small portion of our competitive edge compared to when we first began developing the game,</p><p>but we firmly believe we possess a unique charm of our own.</p><p>Since\n OUTERPLANE is a game with its roots in the subculture genre, we \nrecognize the importance of its story and the narrative of its \ncharacters.&nbsp;</p><p>As\n such, we believe our strength lies in the foundation that we have built\n that allows for the seasonal release of stories with a clear and \ncomplete scope.</p><p>We\n will ensure that the stories do not take too long to play out and that \nthey are not dragged out to the point where players become unable to \nrecall past narratives.</p><p>Additionally,\n since OUTERPLANE is a turn-based strategy game, our developers have \ninvested many hours in ensuring that monsters come with diverse \npatterns,&nbsp;</p><p>and\n that players have the opportunity to feel a sense of accomplishment \nthrough the building of optimized team compositions to challenge them. \nWe believe this provides us with a sufficient competitive edge.</p><p>We\n believe that the continued development of our unique battle systems and\n strategic elements will allow OUTERPLANE to possess a charm not seen in\n competing titles.</p><p><strong>Q13. Many of the prominent games support full dubs. Do you have plans to fully dub OUTERPLANE in the future?</strong></p><p>Currently, we have no plans to fully dub the game.</p><p>In\n our past experience, fully dubbing a game has been a major cause of \ncontent update delays. For now, we will be focusing our internal \nresources on ensuring the game successfully finds its feet, and we will \nconsider introducing full dubbing in the future taking into \nconsideration the state of the game's live operations.</p><p><strong>Q14.</strong>&nbsp;<strong>It felt like there was a lot of effort put into the cutscenes and modeling of 2 Star Heroes.</strong></p><p><strong>How much content will we be able to enjoy while exclusively using lower-star Heroes?</strong></p><p><strong>Or will the game be only playable with a party of 3 Star Heroes?&nbsp;</strong></p><p>While we can't say going forward that they will be able to completely replace 3 Star Heroes,&nbsp;</p><p>in\n the current version, it is entirely possible to clear endgame content \nby investing in 2 Star Heroes which require comparatively fewer \nresources.</p><p>Personally,\n I use 2 Star Dolly in the majority of content, 2 Stars Sofia and Marian\n in the Fire Element Armor Raid up to Stage 10, and 2 Star Vera as an \nexclusive DPS in The Archdemon's Ruins. 2 Star Iris and Parti have \nexcellent synergy with each other and are more than capable of \nfulfilling main/sub DPS roles.</p><p>Other\n than that, certain 2 Star characters can act as counters to certain \nkinds of bosses, which means that investing in these characters can \nallow players to negate certain mechanics or provide stability in those \nencounters.</p><p><strong>Q15. How much time will players have to invest daily into playing OUTERPLANE?</strong></p><p>Once\n you've advanced to a certain point with in-game progress and Hero \ngrowth, you will be able to finish your daily routine within 30 minutes.</p><p>To help with this, the number of Clear Tickets provided by your Base will increase according to your Player Level.</p><p>That said, we will also be providing support for players who wish to enjoy more gameplay.</p><p><strong>Q16. If Heroes only acquire bonuses in a team with Heroes of the same element,&nbsp;</strong></p><p><strong>then\n there seems to be no merit to using Heroes whose elements are different\n from each other. How do you plan on handling this issue in the \nfuture?&nbsp;</strong></p><p>Content\n such as raids are designed to be tackled with single-element \ncompositions, whereas in PvP, more focus will be put on the skill \neffects, rather than the elements, of the Heroes that make up the team.</p><p><strong>Q17. I think the game would be much more enjoyable if the maximum Stamina was about 180.</strong></p><p>The maximum level is currently set to 50. This will be gradually increased over the course of live operations.&nbsp;</p><p>Maximum Stamina is planned to be increased accordingly.</p><p><strong>Q18. Do you plan to release character merch in the future?&nbsp;</strong></p><p>We do have plans to release merch for sale,</p><p>and we're preparing to make them available through the Smilegate Shop.</p><p><strong>Q19. Do characters—whether they be allies or enemies—become slower when they take hits?</strong></p><p>No,\n they do not. However, certain Heroes and monsters can inflict debuffs \nthat decrease speed and use skills that immediately decrease the \nPriority Gauge,</p><p>so getting hit by these skill effects can end up delaying your turn.</p><p><strong>Q20. Do you have plans to release skins for Heroes in the future?</strong></p><p>We\n do. They will be made available through various means such as through \nBattle Pass rewards and event dungeon rewards, among others.</p><p>We'll continue working hard to make OUTERPLANE a memorable and enjoyable experience for everyone.</p><p>Thank you.</p></div>",
      "images": [
        "/developer-notes/2023-05-22-your-curiosity-satisfied-director-s-q-a/b09f9ec06b5f4be6a5aa4d03af9ed831_002.webp"
      ],
      "uid": "developer-notes:2023-05-22-your-curiosity-satisfied-director-s-q-a"
    }
  ]
}