{
  "K": {
    "birthday": "11/11",
    "height": "170 cm",
    "weight": "60 kg",
    "story": "Master had been living as an irregular hunter before he was summoned by Princess Stella to a strange new world, <Color=#ff5400>Mirsha</Color>. Master willingly helped the princess conquer the dungeon successfully, and saved the world in doing so. But everything was a trap created by Stella to sacrifice Master to the dungeon. A fierce desire for revenge arose in Master's heart when he was at death's door. I answered that call and awoke. Three years have passed since then. All of Master's damaged body parts have been restored. Now the only thing left to do is take revenge.\\n\\nI do not know how to restore my Master's broken heart. Perhaps I will be able to find a way once Master's revenge is complete."
  },
  "Vera": {
    "birthday": "07/31",
    "height": "169 cm",
    "weight": "54 kg",
    "story": "The wild dog who wanders among the melody of forlorn winds, the one who walks alone in the quiet daybreak of dawn, and the one who desires blood among the falling ashes and dust... This is how Vera introduces herself, doing her best to use all kinds of mysterious expressions. Please turn a blind eye when she says it is a fiend's way of talking. She'll become flustered if you pry too deeply.\\n\\nShe has a strict sense of morals in her heart, and is often on guard around others, pushing them away. However, it's not because she hates humans. It's because she is afraid of miscommunication. Perhaps she's waiting for someone to reach out to her."
  },
  "Snow": {
    "birthday": "01/05",
    "height": "163 cm",
    "weight": "45 kg",
    "story": "If you feel a cold wind blowing, watch out. Snow might be laughing somewhere after freezing your feet. A frost elf from a northern tribe, she was chosen as the next tribal chief by the divine relic <Color=#ff5400>Glacial Bow</Color>, and yet she chose to leave her tribe and start a life as an adventurer because \"nothing fun ever happens around here.\"\\n\\nAt first glance, she appears to be an irresponsible troublemaker who overreacts to almost anything. But deep down, she is very thoughtful and always tries to solve her problems on her own. If she looks down, bring her a cup of cold ice water to cheer her up. She will thank you with a bright smile."
  },
  "Iris": {
    "birthday": "02/03",
    "height": "162 cm",
    "weight": "46 kg",
    "story": "Iris Secrifyze. She is both the brightest pupil of Magnolia Magical Academy and a talented mage from a family of elite mages. Despite her small amount of mana, Iris uses red magic, a type of magic that borrows mana from outer sources and shows an astounding capability in casting spells. She is also the only friend who opened her heart to Lisha Walpurgis, who was shunned in Magnolia. As you can see from her friendly relationship with Proxxon, she is lively and kind.\\n\\nHer friendship is pure and loyal, free from any jealousy or doubts. No matter what happens, Iris's love for her friends will never change."
  },
  "Lisha": {
    "birthday": "07/29",
    "height": "161 cm",
    "weight": "47 kg",
    "story": "The granddaughter of a legendary archwitch, Lisha Walpurgis is a genius born with the special talent of being able to see the color of mana. Despite this incredible ability, the constant bullying from her peers has pushed her into being shy and timid. She is currently working on her assignment with a fiend named Proxxon to successfully graduate Magnolia. She is the first human Master met on his journey for victory, and the first human he opened his heart again to.\\n\\nNot even Lisha herself knows the full extent of her powers. If you continue to support her, she will repay your kindness and flourish."
  },
  "Sofia": {
    "birthday": "10/01",
    "height": "166 cm",
    "weight": "48 kg",
    "story": "A refined lady from a prestigious noble family, she is a lieutenant in Nightwatch who helps Veronica lead the knights. She watches over the knights' training with her beautiful and youthful looks as well as formidable swordsmanship and elegant, dignified charisma. You could say that behind the renown of Nightwatch lies Sofia's iron discipline.\\n\\nBut you do not need to be afraid of her. As an instructor, Sofia's first and foremost priority is the safety and health of the trainees. If you diligently practice every day, she will reward you with warm praise."
  },
  "Alpha": {
    "birthday": "12/02",
    "height": "145 cm",
    "weight": "35 kg",
    "story": "Alpha, an automaton wrapped in mystery. Though she and I are similar in appearance, her gear is quite peculiar in that it looks like a human musical instrument in contrast to my L.E.N.S. She has also shown notable signs of obsession with music.\\n\\nAnd for some reason, she seems to have known me, Eva, for a very long time. My memory does not contain data about an automaton called Alpha... And yet somehow, I too feel a complicated pattern of resonance whenever I see her."
  },
  "Rhona": {
    "birthday": "06/14",
    "height": "167 cm",
    "weight": "53 kg",
    "story": "Singing strange songs with unfocused eyes and a hopeless expression, she is the wielder of an enormous sword. Like Master, she is from Earth. Her Quirk is tremendous strength that surpasses most humans, no, most average organic life. Her overwhelming combat ability that makes full use of that superhuman strength is enough to have her labeled a monster. However, Rhona seems to be tormented by battle and carnage.\\n\\nShe is always heard singing children's songs, and never hurts a child under any circumstances. In fact, she tries to protect them instead. Perhaps her lost memories have something to do with a child that was important to her."
  },
  "Eva": {
    "birthday": "11/11",
    "height": "144 cm",
    "weight": "35 kg",
    "story": "Hello, Master. I am your personal automaton, Eva. Automatons move using the power of a dungeon core and can decompose and analyze any organic matter. They are also capable of synthesizing and reconstructing any material... You want me to tell you about myself, instead of giving simple facts? I apologize. I failed to understand your question correctly. I was in a long cold sleep when your fervent desire for revenge woke me up. Then we made a contract. Your purpose is now my purpose. Your desire is my desire.\\n\\nHowever... I personally have an inclination to gain knowledge regarding the many things I do not understand... especially emotions. If I am ever to become a human, will an automaton like me be able to understand such things?"
  },
  "Idith": {
    "birthday": "06/06",
    "height": "164 cm",
    "weight": "45 kg",
    "story": "The keeper of public order and a guard to the lord of Outer City, she is of noble birth and has never forgotten her dignity. Though she is righteous and always strives to do good, please be cautious in front of her, as she values rules above all else and makes no exceptions.\\n\\nI suspect this inflexibility comes from the pressure of coming from a noble background as well as having to become an exemplary honorable knight. Perhaps Lady Idith's stubborn desire to uphold the rules is her effort to show everyone she is doing a good job."
  },
  "Lily": {
    "birthday": "02/27",
    "height": "150 cm",
    "weight": "38 kg",
    "story": "Though she may be a child from the frost elf tribe, you cannot underestimate the abilities of this experienced pursuer of the snowy mountains. She is a natural-born hunter who can, at this young age, bring down a snowy bear entirely on her own. In addition, as elves lead very long lives, it would be safe to assume that she has already lived 4 times as much as you.\\n\\nLily is extremely proud of her frost elf tribe and hates being treated as a young child. Because of this, she sometimes adamantly believes her perceptions to be the truth. It is not recommended you hound her with facts unless you have the ability to stop a child's tears in an instant, as this act may have the effect of making Lily cry."
  },
  "Valentine": {
    "birthday": "02/14",
    "height": "167 cm",
    "weight": "48 kg",
    "story": "She is the boss of the most infamous gangsters in White Falcon and the head of a casino where substantial amounts of money trade hands each day. Those who visit her casino are first enthralled by her beauty, then become addicted to the thrill of gambling, and finally end up as slaves after they fail to pay back the money they borrowed from her.\\n\\nThough her beauty may be as captivating as a rose, her hair as red as ardent flames, and her revealing clothes sensual, do not be fooled. Knowing one's own beauty can be a deadly weapon. The moment you let your guard slip, your entire fortune will be in her pocket."
  },
  "Dolly": {
    "birthday": "03/18",
    "height": "163 cm",
    "weight": "53 kg",
    "story": "She is a sheep demibeast ready to sleep anywhere and anytime. Dolly is constantly in a state of drowsiness and even dreams about sleeping when she sleeps. Due to her laid-back, peaceful nature, she gets kidnapped once every three months, only to be released again as she is incapable of labor or ransoming.\\n\\nHer blithe personality of deciding to go to sleep even when the enemy is right in front of her shows in her comfortable choice of clothes. Dolly's mellow, amiable disposition relaxes those around her and disarms them. Perhaps Dolly is someone that no one can hate."
  },
  "Marian": {
    "birthday": "11/02",
    "height": "160 cm",
    "weight": "0 kg",
    "story": "Marian Pearlshade is working as a maid in a strange old mansion. She takes care of the immense mansion all year long and always greets guests with a warm welcome.\\n\\nDespite all her hard work, she is unfortunately quite clumsy and inept. She drops candles and breaks dishes at a near daily rate. I presume her master was either incredibly tolerant or extremely indifferent. Perhaps the long days of working alone in the enormous mansion have made her lonely. She appears to truly enjoy guests. If you ever happen to pass by her way, do pay her a visit. You will be able to see Marian's happy smile along with a plate of delicious cookies and a cup of warm tea."
  },
  "Francesca": {
    "birthday": "07/14",
    "height": "166 cm",
    "weight": "49 kg",
    "story": "Francesca Kencer, the daughter of the Archdemon of Annihilation Firrah, is a battle-crazy fiend whose only desire is to fight the strong. She is one of Master's former comrades and once helped him defeat a dungeon as one of Stella's subordinates. However, that is all in the past now.\\n\\nShe is extremely cruel and does not hesitate to cut down anyone she does not like, whether they be fiends or humans. The way she brandishes her huge, sharp claws and rips her targets apart... can only be described as \"playing with one's food.\" Be on your guard when fighting against her, Master. She hates you just as much as you hate her."
  },
  "Tanya": {
    "birthday": "01/02",
    "height": "165 cm",
    "weight": "49 kg",
    "story": "Tanya Blanche was a member of the final expedition and fought alongside Master to conquer the dungeon. Her current status is unknown. I will reconstruct my data using the memories and senses of my master.\\n\\nShe was one of Stella's guards, a knight who wielded an enormous sword. Though people deemed her to be an unexceptional knight cursed with mediocre talent, she overcame all obstacles through an overwhelming amount of diligent practice. She swung her sword every single day without fail, even though that sword was much bigger and heavier than herself. She was the one who contributed the most to each battle. Perhaps Master treads the path of vengeance because he wishes to avenge Tanya as well."
  },
  "Claire": {
    "birthday": "06/06",
    "height": "162 cm",
    "weight": "44 kg",
    "story": "Of the many followers of her religion, she is among the most faithful. Though the deity she prays to is rather suspicious, Claire always sincerely prays with all her heart for the weak, the sick, the suffering, and the wounded.\\n\\nTightly closed eyes, an outfit that covers her entire body, and the dark power that manifests through strange grimoires and prayers... There is not a single doubt that Claire's heart is filled with anything other than pure good. But do not let down your guard. If you raise the veil out of curiosity and peer into the abyss, you may find yourself ensnared by what is concealed within."
  },
  "Philia": {
    "birthday": "09/17",
    "height": "161 cm",
    "weight": "42 kg",
    "story": "Like you, she is from Earth. However, it appears she did not have a Quirk that was strong enough for her to survive in Mirsha. She is currently making a living by working at a tavern.\\n\\nThough she always looks glum, her demeanor changes when you enter the tavern and call her name. She seems to be very fond of you for your warm kindness. However, I have occasionally seen her following you around with a stun gun in her hand, so I advise caution."
  },
  "Rin": {
    "birthday": "04/13",
    "height": "165 cm",
    "weight": "45 kg",
    "story": "Rin Onimaru, a <Color=#ff5400>Soulslayer</Color> who slays demons with a sword called Setsuna. Though she was a little disappointed after being transferred to Mirsha as no demons existed here, she soon returned to her profession by slaying monsters instead. She continues to devote herself to destroying evil creatures, to kill the evil demon Shutendoji that might have come to Mirsha.\\n\\nAs a warrior who holds honor in the greatest esteem, she serves those she is indebted to with an unwavering loyalty that continues until death. She is heard to become emotional over even small and insignificant gestures of kindness. Perhaps on the inside, she is like any other girl of her age."
  },
  "Alice": {
    "birthday": "01/27",
    "height": "145 cm",
    "weight": "34 kg",
    "story": "She is an accomplished mage who has risen to the position of Head Librarian of Magnolia's Magical Archives at a young age and is also in charge of looking over the graduation assignments of the students. Her arrogant, imperious attitude and her way of constantly looking down on everyone around her, calling them <Color=#ff5400>lousy</Color> make her the subject of countless complaints.\\n\\nHowever, she backs down surprisingly quickly to someone who is forceful. She is a child, after all. And the way she immediately runs far away as soon as they turn their back and calls them all sorts of names is... exactly like a child."
  },
  "Hanbyul Lee": {
    "birthday": "01/19",
    "height": "142 cm",
    "weight": "30 kg",
    "story": "She is a young girl with a small backpack, a glowing halo around her head, and two pearly white wings sprouting from her back. Though the wings and halo are nothing but props she made herself for a play, they change into enormous real wings when she activates her abilities and awes the viewer. Among all the ones who have been transferred to Mirsha, her Quirk is one of the most powerful.\\n\\nHer ability to heal and protect people has even made some people start treating her as the messenger of gods in some regions. She shares any joy she finds and tries to help anyone she comes across. Thanks to Hanbyul's special Quirk, you will find yourself filled with energy and vigor just by looking at her."
  },
  "Noa": {
    "birthday": "04/21",
    "height": "144 cm",
    "weight": "33 kg",
    "story": "She is a demibeast from the opossum tribe who can control gigantic mechanical robots. Though she is young, she possesses a brilliant intellect. The objects she created after exploring the dungeons by herself and studying the Scientific Inheritance are enough to leave even an automaton like myself speechless in awe.\\n\\nShe appears to have no friends as there are no demibeasts who understand the Scientific Inheritance other than her. Though I suppose that if you insist on talking about things only you understand and putting on airs, it is only natural that you would have no friends. Though she says she does not need any friends, she is always looking for an assistant to help her with her research."
  },
  "Saeran": {
    "birthday": "09/29",
    "height": "162 cm",
    "weight": "41 kg",
    "story": "The most beloved saint in the history of Sacreed, she is the hierarch of miracles, Saeran Bluelight. Her unwavering faith and ardent devotion give her the ability to create miracles of healing with the power of prayer. She not only remedies the wounds and diseases of the body, but also heals the mind through honest confessions and counsel.\\n\\nShe treats the weak and injured with kindness and sincerity, and stands against evildoers with a will of iron. Though she does not have the power to heal herself, she accepts it as a message from the gods to caution her from becoming too proud. There is no greater miracle than the purity of her heart."
  },
  "Naru Kang": {
    "birthday": "08/17",
    "height": "148 cm",
    "weight": "36 kg",
    "story": "Naru Kang is a fan who absolutely adores <Color=#ff5400>Cyclone Man</Color>, a cyborg and a hero of justice. She says Cyclone Man is a tv show for children that she used to watch back on Earth. Always filled with vigor and enthusiasm, she never ignores a person in need of help. Even now, she is probably shouting \"Transformation!\" at the top of her lungs and diving into battle against the villains of Mirsha.\\n\\nSince sharing the same hobby and talking about it is a great way to relieve stress, why not ask her about Cyclone Man sometime? You might just convince Naru, the hero of justice with a spirit that never falters in any kind of danger, to join your side."
  },
  "Beth": {
    "birthday": "09/26",
    "height": "153 cm",
    "weight": "36 kg",
    "story": "She is a fiend, a member of a mysterious clan that absorbs the blood of living organisms to accumulate power and longevity—a vampire. Her youth and inexperience indicate that she is not an independent individual, but rather one that serves a master.\\n\\nBut no matter how young or inexperienced she may be, she is still a dangerous vampire. Be on your guard around her. If you get distracted by her loud and constant chattering, her way of mocking everyone regardless of their identity, and her mischievous and crude laughter, you will be surrounded by a cloud of blood-sucking bats in no time."
  },
  "Yuri": {
    "birthday": "06/02",
    "height": "159 cm",
    "weight": "46 kg",
    "story": "The daughter of the renowned Shieldwall family famous all across Mirsha for being guardian knights, she protects her allies with her impenetrable shield as a knight of Nightwatch... She also tries to run away at every opportunity before she even starts fighting. Her low self-esteem hinders her at every turn, making her easily scared and eager to avoid all conflict. On top of that, she gets hiccups whenever she's nervous.\\n\\nBut the only thing lacking about her is faith in herself. Trained to become a knight since she was a child, her skills are formidable, with most attacks not being able to leave even a dent in her armor. If you believe in her and support her to the end, she might start to believe in herself and a guardian knight who will go down in history might be born."
  },
  "Faenan": {
    "birthday": "12/06",
    "height": "160 cm",
    "weight": "45 kg",
    "story": "Hierarch Faenan Moonlight was born under the blessing of the Moon God, on the day of the Moon which comes every 4 years. Her bright, mischievous personality makes it obvious why she is called the embodiment of the Moon. Her curiosity made her long for adventure, eventually making her step out of Sacreed and venture out into the world.\\n\\nShe traveled from place to place to spread her religion and is now a relief hierarch and a temporary chief of a small village. Though her job of occasionally facing monsters as the chief and hierarch is not easy, she continues to lead the village with her positive energy and sense of responsibility."
  },
  "Maxwell": {
    "birthday": "06/13",
    "height": "182 cm",
    "weight": "172 kg",
    "story": "A madman who cares for nothing other than magic, Maxwell, has pledged his life to create a perfect paradise for only mages. He has dedicated many years as a celebrated professor of Magnolia, setting many mages on the path of greatness. He does not discriminate against anyone as long as they are talented in magic, and is respected by many students for his kindness in both financially and mentally supporting their research.\\n\\nMost of his old and weakened body has been exchanged for magical prosthetics, and he has as many secrets as the face that is always hidden behind his mask. Be careful, Master. He is willing to use anything as a test subject for the advancement of magic."
  },
  "Laine": {
    "birthday": "03/21",
    "height": "168 cm",
    "weight": "49 kg",
    "story": "She is an elf who declares herself as the guardian of the forest and Mother Nature. As the home of her tribe was destroyed due to the indiscriminate development of humans, she became an extreme conservationist. She is always angry and stubborn, and easily jumps to the conclusion that the civilization of the greedy humans needs to be razed to the ground. Even if it is just a monster, if you hurt any one of the lifeforms from the forest, she will come to punish you with the wrath of the forest.\\n\\nThe awe and love she feels for nature are sincere. If you approach her first and talk to her about nature, she will open up her heart to you."
  },
  "Kate": {
    "birthday": "08/23",
    "height": "166 cm",
    "weight": "48 kg",
    "story": "A proud blacksmith with a straightforward, open personality who has spent her entire life in front of the furnace fire, she will gladly repair your gear even if she has never met you before. However, as Mirsha's metalwork technology is not that sophisticated, there is a high chance of failure. Please keep that in mind when you are upgrading your gear through reforging.\\n\\nShe is proud of her job as a blacksmith and ceaselessly studies to make sure her work does not fall behind the level of completion of the Scientific Inheritance excavated from dungeons. Her furnace continues to burn, as well as her efforts to surpass the technology of Earth."
  },
  "Cindy": {
    "birthday": "10/10",
    "height": "157 cm",
    "weight": "43 kg",
    "story": "Cindy is someone that anyone walking the path of an adventurer has to meet. She is the lively, kind receptionist of the Adventurers' Guild in Outer City and loves adventure and challenges more than anyone. She encourages the sparkling eyes of a dreamer and takes most pleasure in her job when adventurers return safely from their quest and tell her exaggerated stories about their experience.\\n\\nTo adventurers, Cindy is the agent that gives them requests that are adequate to their level of skill and helps them make a living. She is a confidant who listens to their concerns and a dear friend who cheers for their dreams. I recommend you meet Cindy at the reception area for your future adventures, Master."
  },
  "Parti": {
    "birthday": "04/27",
    "height": "170 cm",
    "weight": "51 kg",
    "story": "<Color=#ff5400>Gourmet,</Color> in other words, delicious food. This is what the wandering cook, Parti, searches for in her travels all across Mirsha. It is said that fiends do not have the concept of hunger or food, but due to an unusual peculiarity, Parti needed to consume food to live. With the sophistication of her tongue, the cooking she initially learned to survive gradually turned her into the greatest cook in all of Mirsha.\\n\\nShe continues to don her cooking uniform and wanders all around the country in search of new recipes, with the resolution that if she ever finds someone who cooks more delicious food than her, she will spend the rest of her life with that person."
  },
  "Adelie": {
    "birthday": "09/19",
    "height": "143 cm",
    "weight": "32 kg",
    "story": "Adelie is widely known as the captain of the most infamous pirates in all of Sacreed, a sacred nation surrounded by the sea. Declaring herself as a wicked, despicable villain, she runs around busily trying to fish sardines for her crew, hatching an elaborate scheme to conquer the world by eagerly conquering the streets first.\\n\\nOr so she says... but in reality, she is adored by all of the villagers. Whenever Adelie goes past, they ask her what wicked thing she is planning to do today while giving her a piece of candy and a pat on the head."
  },
  "Fenrir": {
    "birthday": "04/24",
    "height": "171 cm",
    "weight": "53 kg",
    "story": "Fenrir, the Bandit Queen, is a wolf that viciously hunts humans while wielding the enormous axe of her late husband. She desires nothing more than getting bloody revenge on all humans. After she lost her husband, her eye, and even her children at the hands of humans, she swore to take indiscriminate revenge. Fenrir will stop at nothing to kill humans and became the most wanted person in the entire kingdom.\\n\\nHer fellow demibeasts are the only ones who have the privilege of seeing her kind and gentle side. With the goal of someday creating a paradise for demibeasts only, she swings her axe mercilessly. Be careful if you ever meet her in battle, Master."
  },
  "Eliza": {
    "birthday": "11/08",
    "height": "168 cm",
    "weight": "48 kg",
    "story": "A red rose blooming alone under the moonlight, she is the eternal queen of the night, aloof and elegant. The lonely immortal who could not find her equal, Eliza, the Archdemon of Pure Blood. Even her fellow fiends tremble at the sight of her drinking her prey's blood under the silvery light of the moon. Her elegance can seem almost forlorn, as she has lived for such a long time in utter solitude that she has become detached from the matters of the world.\\n\\nDo not be mesmerized by her melancholy, otherworldly beauty, Master. The moment you let yourself be taken in by her sorrow, her glass will overflow with your blood. As long as there exists day and night, half of a day belongs to vampires."
  },
  "Tio": {
    "birthday": "05/12",
    "height": "165 cm",
    "weight": "46 kg",
    "story": "Tio Pinebell is a relief worker who is always there for the injured, using her huge medical bag. Because the Magnolia Magic Academy did not recognize miracles, it developed an independent medical system early on. The relief work of disinfecting wounds and setting bones is punctuated by shouts of pain and complaining patients.\\n\\nBut Tio's kind heart makes it impossible for her to ignore the pain of injured patients. Even after adding only the essentials to her medical bag, it has become bloated, and she has to lug it everywhere while seeking patients who need treatment. There is nothing that makes her happier than a patient's words of gratitude after they receive care."
  },
  "Veronica": {
    "birthday": "04/28",
    "height": "170 cm",
    "weight": "52 kg",
    "story": "The extraordinarily strong knight of the Kingdom of the White Falcon, the invincible Knight Commander of Nightwatch, Veronica Aldebern Haides. She is so strong that there is not a single person who could be her equal in all of Mirsha. However, her overwhelming power deprived her of the happiness that comes with a sense of accomplishment. That is why she respects those who do not give up and continue to try their best. I have faith that someone as hardworking as you will soon win her favor, Master.\\n\\nAs the strongest knight with a tough personality, she is forever loyal to the royal family of the Kingdom of the White Falcon. Veronica will always protect what she cares about, regardless of where, when, or who she is up against."
  },
  "Shu": {
    "birthday": "02/26",
    "height": "165 cm",
    "weight": "44 kg",
    "story": "Shu is both the idol of the arena who sings about her dreams and the ring announcer. On Earth, she ran a donation-formatted broadcast channel called a \"Virtual Youtuber.\" It seems she did not have many viewers, and whenever she talks about those days from her past, her face suddenly darkens and she mumbles \"I never want to spill soy sauce or flour on myself again...\"\\n\\nAfter she was transferred to Mirsha, she did whatever job she could get her hands on to survive, and ended up becoming an announcer in the arena. As she announced the fight sequence in the area, she gradually regained her dream and passion. Now, she also goes on the stage between fights. If you want to hear her songs, please pay a visit to the arena."
  },
  "Stella": {
    "birthday": "02/18",
    "height": "167 cm",
    "weight": "45 kg",
    "story": "The Princess of the Kingdom of the White Falcon, she is of noble birth, being descended from Ivanez I, the first king. She offers a warm smile to all subjects of her kingdom and is loved by all of her people. She is a hero who conquered a sealed dungeon, drove back the fiends, and saved humanity. Her name is Stella Vargo Rosinley Ivanez.\\n\\nBecause she has gone through the horrors of war, she desires a peaceful world more than anyone. But the abilities she was born with through her bloodline and her power to summon people from other worlds have made her the target of those who seek power. I am sure she is a person you have mixed feelings about, Master."
  },
  "Mero": {
    "birthday": "10/31",
    "height": "162 cm",
    "weight": "33 kg",
    "story": "Legs and arms poorly stitched together, an awkward walker, impulsive like a B-movie fanatic, and undying zombie that cannot be killed: these are all expressions that can be used to describe Mero. If you hear the sound of a chainsaw revving up, be on your toes. That means Mero is near.\\n\\nMero hates being bored. You must always be careful when dealing with her, as she will either bite you or start up her chainsaw and do even worse. However, if you respect and are receptive to Mero's interests, you will gain a friend who is capable of expressing a wide variety of emotions."
  },
  "Pesketh": {
    "birthday": "09/18",
    "height": "178 cm",
    "weight": "66 kg",
    "story": "Pesketh, a mysterious informant who always manages to retain a spotless suit and a sense of snark even in the middle of a mud storm with bombs going off all around him. His real name is unknown, as he is a treacherous man who digs up and sells the information of other people without a second thought. He protects his own information with the utmost care. Caution is highly recommended as even when he is being a reliable ally, you never know what he might have up his sleeve.\\n\\nHe is a disrupter at the negotiation table, seeding chaos by mixing useful information with lies. He says nothing but the truth and yet somehow tells nothing but lies. Information always comes at a price, so beware his tempting suggestions."
  },
  "Leo": {
    "birthday": "03/14",
    "height": "183 cm",
    "weight": "78 kg",
    "story": "Leo, the current hero of this age, is resplendent in a white coat and red hair. He always comes to extend a helping hand to those in need no matter what race they are. His deeds are praised throughout Mirsha, as no matter how slight the trouble is, he never passes by someone who is calling for help, and shows mercy to even the most wicked villains.\\n\\nHe says he loves justice, and yet he says his first and foremost loyalty lies to the one he loves...perhaps the words \"dangerous romantic\" suit him better than \"hero.\""
  },
  "Eternal": {
    "birthday": "05/01",
    "height": "163 cm",
    "weight": "43 kg",
    "story": "Eternal, a necromancer who is beloved by Death itself and who guides lost souls to the next world. She has arrived from across the sea. She comes from a long line of necromancers and has completed many requests... Yet she is always unmotivated because she hates working. It is easy to tell when Eternal is in work mode, as her entire demeanor changes when the powers of the reaper awaken within her.\\n\\nShe was trained to be a necromancer since she was very young. As a result, she was ostracized as a child, with only a snake named Quetzalcoatl to keep her company. She tends to get nervous when talking with people as she is not used to such interactions, but perhaps she is waiting for a true friend whom she can really open up to."
  },
  "Laplace": {
    "birthday": "03/23",
    "height": "165 cm",
    "weight": "43 kg",
    "story": "The dean of Magnolia, a paradise for mages, and the most powerful living mage on Mirsha, Laplace specializes in water magic. Her kind, gentle personality has earned her the respect of all mages everywhere. Inside her young exterior lies an iron will and the wisdom of having lived for many years.\\n\\nBorn with only a modicum of talent, she embraces and loves all students no matter their aptitude, as she herself reached the level of archmage through nothing but hard work. She is normally benevolent, but she will do anything to protect Magnolia. You do not want to be her enemy, lest her fury crashes down upon you like a giant wave."
  },
  "Bleu": {
    "birthday": "11/17",
    "height": "168 cm",
    "weight": "59 kg",
    "story": "Bleu Bell is a model student and the class president for his class at Magnolia. Though he was born relatively talentless, he is currently demonstrating intense focus after discovering his aptitude for water magic. He admires Dean Laplace for specializing in water magic like him and for becoming an archmage, the most powerful rank a mage can achieve.\\n\\nHe thought of giving up on magic a few times in the past due to his lack of talent, but he overcame all obstacles with natural diligence and perseverance. Though he cannot conjure spells that compare to Laplace's magic, a single instance of which could qualify as a natural disaster, he is showing remarkable results in terms of obtaining a nuanced control over water."
  },
  "Rico": {
    "birthday": "10/23",
    "height": "163 cm",
    "weight": "45 kg",
    "story": "Rico is a jack of all trades, quick to solve any problem, and risks her life on a single coin or a single coupon. Though she is a forest elf, she jumps into whatever job gives her money, regardless of her background. If she could get rich by selling the entire forest for firewood, she would do it in a heartbeat.\\n\\nBecause of this, she is shunned by everyone around her. But she does not let that get in the way of accepting whatever request she gets so that she can earn money to buy medicine for her sick mother. If there is a request you are having trouble with, it might be a good idea to as Rico for help. She will complete the task at the risk of her own life—that is, for a cost."
  },
  "Lyla": {
    "birthday": "10/12",
    "height": "168 cm",
    "weight": "46 kg",
    "story": "Let me fill in for Eva and introduce her. Lyla is a fiend who possesses a talent for astrology. She can predict the future by reading the positions of the stars.\\n\\nThough she is a fiend, she doesn't like conflict and doesn't appear to have an intense aversion to the Scientific Inheritance. Let's suppress our urge to fight her.\\nConsidering the fact she's a fiend, she is extremely noble, even looking after human children who were orphaned during the war. This seems to have agitated the residents of Sacreed... We'll want to navigate this meeting with care.\\nI do not know what principles are at play in fortune telling, but it appears that her fortunes have a high degree of predictive accuracy."
  },
  "Ritri": {
    "birthday": "04/24",
    "height": "160 cm",
    "weight": "48 kg",
    "story": "Let me fill in for Eva and introduce her... Ritri is said to be a demibeast who was helped by Saeran when she was young.\\n\\nAfter going through some kind of ordeal, Ritri became Saeran's personal guardian knight. Thanks to her exceptional sense of smell, she can detect threats to Saeran early. \\nHowever, she doesn't seem to possess the deep faith that one might expect from the saint's own guardian knight. People do not seem to criticize her much for that, though. \\nI suppose the bond between humans and dogs has always been strong. Perhaps Ritri will be able to bridge the tumultuous gap between humans and demibeasts."
  },
  "Guizam": {
    "birthday": "06/07",
    "height": "180 cm",
    "weight": "73 kg",
    "story": "The underboss of the Annihilation Sect, an organization famed for being warlike even among fiends, Guizam is currently helping Flamberge, the next boss in line, after the death of the Archdemon of Annihilation Firrah. He is admired by his brothers and sisters for his strength and loyalty, and admired by Flamberge for his strictness and his love towards the Annihilation Sect which is second to none.\\n\\nAs the Archdemon of Annihilation died at the hands of humans during the war, he is strongly hostile and antagonistic towards them. However, keep in mind that he values repaying his debts above all else and upholds repaying favors or spite in kind even if they are humans."
  },
  "Flamberge": {
    "birthday": "07/08",
    "height": "165 cm",
    "weight": "61 kg",
    "story": "The son of the Archdemon of Annihilation Firrah, Flamberge is currently the boss of the Annihilation Sect. Unlike his aggressive organization, he is mild-mannered and cautious. As he chooses to retreat instead of fighting in meaningless battles, some members of his Sect oppose him, especially since he has not officially become an Archdemon yet as no one chose to acknowledge him as one.\\n\\nDespite all that, he is always calm and strong. He maintains his cold rational self no matter what situation he is in, and values repaying debts and unity so much that those who are indebted to him swear their undying loyalty. Perhaps he might turn out to become the greatest Archdemon in history. Further observation is needed."
  },
  "Orox": {
    "birthday": "11/11",
    "height": "198 cm",
    "weight": "144 kg",
    "story": "A thick, heavily muscled body topped by sturdy horns, the demibeast Orox can always be found laughing heartily. He leads the Demibeast Liberation Front to save his fellow demibeasts from being illegally sold as slaves.\\n\\nHe is also acquainted with the culture and physiology of humans as he has spent a long time working with them. You have nothing to fear from him as he is an easygoing person who welcomes anyone who shows goodwill towards demibeasts as his friend. However, I have heard that he often tries to make the humans that he favors marry his sister. Caution is advised."
  },
  "Sigma": {
    "birthday": "01/08",
    "height": "160 cm",
    "weight": "40 kg",
    "story": "Identity... unknown. Objective... unknown. Attempt at communication... unresponsive. Demeanor... hostile. Weapons... extremely high firepower observed. Entity... a combat-type automaton. Identification code... Sigma.\\n\\nHer long period of activation seems to have damaged various parts of her body, despite repeated auto-repairing. I have confirmed that she is currently wandering around the planet of Mirsha, gathering various samples in secret. She is a highly dangerous individual with an unknown objective. Be on your guard, master. If things come to it, I, the automaton Eva, will protect you."
  },
  "Demiurge Stella": {
    "birthday": "05/23",
    "height": "169 cm",
    "weight": "-1 kg",
    "story": "Stella Vargo Rosinley Ivanez, the well-known princess of White Falcon...\\nThe evil Earthling soul that had haunted her reconfigured her body with a spell called <Color=#FFBF00>Transmogrification</Color>. Becoming more like an automaton than a human, she used fearsome Quirks and unfathomable power that belonged to her body's master to corner us.\\nBut in the end, Master, you were victorious.\\nCongratulations. I could not be more proud of what you have accomplished. Now, there are no shackles binding you... Please live your life for none other than yourself.\\n\\nIt was an honor to serve you."
  },
  "Mene": {
    "birthday": "11/20",
    "height": "145 cm",
    "weight": "35 kg",
    "story": "Let me fill in for Eva and introduce her... This is Mene Satellight, one of Sacreed's Twelve Disciples, and she holds the position of the <Color=#FFBF00>Disciple of the Stars</Color>. \\nShe became a hierarch after losing both her parents in the war against the fiends, but judging by how she's always dozing off, it looks like her sense of responsibility is somewhat lacking. \\n\\nNot only that, but the way she talks to that shark doll her dad left behind makes her look like the child she is rather than a solemn member of the clergy. \\nIs Sacreed that desperate for new recruits? Or does this child possess power so great that they took her in despite it all?"
  },
  "Aer": {
    "birthday": "05/31",
    "height": "166 cm",
    "weight": "50 kg",
    "story": "Allow me to fill in for Eva and introduce her. That girl's full name is Yonaha Eru, but we call her \"Aer\" for short.\\nShe almost died when she got caught up in a nasty wave on Earth, but it looks like being transferred to Mirsha somehow saved her life. She has a chill, laid-back attitude, and she's a free spirit who likes to go with the flow. Her ability to laugh things off even when she's backed into a corner with her \"I'm-sure-it'll-work-out!\" attitude is really quite amazing.\\n\\nBy the looks of it, she has a quirk that lets her momentarily dish out incredible amounts of power. But it's her personality, rather than some quirk, that makes her truly special."
  },
  "Notia": {
    "birthday": "03/11",
    "height": "162 cm",
    "weight": "48 kg",
    "story": "Allow me to fill in for Eva and introduce her. This is Notia Pearlight, one of Sacreed's 12 disciples and the <Color=#FFBF00>Disciple of Earth</Color>.\\n\\nShe's also the commander in charge of Sacreed's Order of Paladins. They say she grew up in a temple-run orphanage and received training to become a paladin from a young age.\\nThanks to her upbringing, she grew up to be exceptionally diligent, and she's gained a reputation as a paragon of faith. Should you ever trespass against the teachings of scripture, be sure to prepare yourself to receive an earful from her for your blasphemous misdeeds.\\nBut because of her upbringing, she is still rather uncomfortable around boys. Under certain circumstances, they say, she can be prone to some outlandish delusions...\\nBut what delusions and under what circumstances, I do not know."
  },
  "Sterope": {
    "birthday": "05/15",
    "height": "183 cm",
    "weight": "72 kg",
    "story": "Allow me to fill in for Eva and introduce her. This is Sterope Refleclight, one of Sacreed's 12 disciples and the <Color=#FFBF00>Disciple of Lightning</Color>.\\n\\nShe was raised by fiends for a time after losing her family to war, and it looks like she's been through a lot undergoing <Color=#FFBF00>corrections</Color> because of that.\\nShe was then sent to a Sacreed orphanage where she met the archbishop.\\nOne day, she crossed paths with an archdemon and, realizing her weakness, implanted a piece of the Scientific Inheritance in her arm.\\nBecause of this, she experiences a level of pain greater than what most humans can endure. She must possess quite a formidable force of will."
  },
  "Astei": {
    "birthday": "01/01",
    "height": "168 cm",
    "weight": "52 kg",
    "story": "Let me fill in for Eva and introduce her. Astei Arclight is the leader of Sacreed, the <Color=#FFBF00>Archbishop</Color>.\\n\\nHer position in the religion is similar to that of a king or queen. During the war, she lost both her eyes and one arm to an archdemon... Fortunately for her, an Earthling warrior was dispatched nearby and managed to save her life.\\nShe always manages to put the pain and suffering of others before her own and prays for peace for all humankind... It's remarkable that she's able to think that way without even a hint of selfishness."
  },
  "Demiurge Astei": {
    "birthday": "08/29",
    "height": "168 cm",
    "weight": "-1 kg",
    "story": "Let me fill in for Eva and introduce her... Some events led Astei to the realization that there is no god.\\n\\nIt is difficult for an automaton like myself to comprehend the rationale...but it seems she came to the conclusion that it was up to her to become a god.\\nShe put everyone to sleep and filled their heads with happy dreams so she could rule them all as dolls to be kept in the garden of her <Color=#FFBF00>dollhouse</Color>. I do not know whether her subjects were truly happy, however, it seems she was using them to accumulate antimatter to create a utopia for herself.\\nHumans truly are a peculiar sort."
  },
  "Tamara": {
    "birthday": "12/18",
    "height": "169 cm",
    "weight": "54 kg",
    "story": "Ful.Mi.NATION officer Tamara is an <Color=#FFBF00>Irregular Hunter</Color> from Earth.\\n\\nShe was active in the same region as you, K, so it seems she has deep ties to your past. She's an expert in combat who has managed to single-handedly hunt down a powerful class of Irregulars commonly dubbed the <Color=#FFBF00>Numbered</Color>, and for this she was given the title of <Color=#FFBF00>Numbered Hunter</Color> held only by a select few.\\nShe seems to be cold and distant at first glance, but it seems like she's really a warm and caring person on the inside. Not unlike you, Master."
  },
  "Christina": {
    "birthday": "11/29",
    "height": "163 cm",
    "weight": "48 kg",
    "story": "Christina is an officer of Ful.Mi.NATION who graduated from the military academy with honors. Her rank is Lieutenant, and her position is that of a Public Affairs Officer.\\n\\nThanks to her early life growing up in a poverty-stricken family, she was easily able to adjust to military life. Now she is making her name as an exemplary officer.\\nAt the moment, Christina is working as Tamara's partner for the purposes of her protection and surveillance. In the aftermath of some recent events, it seems that her hitherto steadfast patriotism is starting to show signs of cracking."
  },
  "Drakhan": {
    "birthday": "11/12",
    "height": "163 cm",
    "weight": "54 kg",
    "story": "Drakhan, who claims to be the apex of the snowy peaks, is a pure-blooded <Color=#FFBF00>dragon</Color>, unlike her subjects, the Dreadnought.\\n\\n She is aggressive and enjoys battling with her life on the line, always on the lookout for a worthy rival.\\n It is assumed she is a very powerful entity, as she once battled against Ivanez I, the First King of the White Falcon. Be on your guard, Master."
  },
  "Demiurge Drakhan": {
    "birthday": "11/12",
    "height": "163 cm",
    "weight": "-1 kg",
    "story": "Drakhan appears to be in a very dire situation.\\n\\nAn analysis of epidermal tissue left behind after she molted reveals that, by using a dungeon core, she has transcended the biological limits of her dragon body. Now, after her longtime search for a worthy adversary, Drakhan has come to the realization that none exist on this planet. Spreading her mechanical wings, Drakhan is determined to seek out her fated rival by visiting other worlds. She will arrive on these planets with the cruel sweep of her colossal spear, with the intent to massacre all life unable to entertain her in combat.\\nMaster, no matter how I look at it, I think she needs to be stopped here and now."
  },
  "Akari": {
    "birthday": "12/19",
    "height": "162 cm",
    "weight": "43 kg",
    "story": "Armed with a pair of pistols and her paper talismans, Akari is a soulslayer traveling all across Mirsha. \\n\\nShe says she's searching for signs of demons and other soulslayers, but it seems like she somehow manages to stir up trouble wherever she goes. Despite her antics, Akari's good humor and outgoing personality have allowed her to make friends in all the places she's visited. \\nI heard that she has a habit of giving nicknames to anyone close to her, no matter who it is. I hope K gets a nickname that does not annoy him too much."
  },
  "Ame": {
    "birthday": "03/24",
    "height": "167 cm",
    "weight": "47 kg",
    "story": "Ame has a mellow, relaxed air about her, but she is a soulslayer with a sharp hidden edge.\\n\\nUnlike her friends who are honest about their feelings, Ame tends to keep her true intentions hidden. And as the heir to a long line of soulslayers, she holds quite a high position among Earth's soulslayers. \\nI would advise you not to let down your guard in front of her."
  },
  "Charlotte": {
    "birthday": "01/06",
    "height": "159 cm",
    "weight": "46 kg",
    "story": "A fancy checkered coat. An authoritative fake mustache. Charlotte is the self-proclaimed greatest detective in Mirsha.\\n\\nIt is rumored that she is merely an avid mystery novel enthusiast, imitating the detectives that she admires. Despite sometimes displaying flawed deductions and misguided intuition, in the end, she is always the first to uncover the truth that everyone else overlooked.\\nIf you are ever faced with a perplexing mystery, Master, I would recommend entrusting it to Charlotte. She will ponder over it for months, if need be."
  },
  "Regina": {
    "birthday": "10/31",
    "height": "175 cm",
    "weight": "61 kg",
    "story": "Regina is a fiend born into a family of fiend servants who consider it their destiny to serve others.\\nSince making her mark with her powerful mana and acumen, Regina attracted the attention of many high-class fiends. However, the one that Regina chooses to serve as her current master is Dahlia, the Archdemon of Hubris. Some argue that Regina is one of the biggest reasons to avoid becoming one of Dahlia's enemies.\\n\\nUnlike other fiends, she enjoys the art of magic practiced by Earthlings. Perhaps she can perform a dazzling display of magic that might even surprise you, Master."
  },
  "Dahlia": {
    "birthday": "12/21",
    "height": "171 cm",
    "weight": "58 kg",
    "story": "Some of the fiends residing in Mirsha refer to winter as the season of hubris. Among the thirteen archdemons, the <Color=#FFBF00>Archdemon of Hubris</Color> stood at the peak, both instilling terror and garnering admiration. She held power so ruthlessly chilling and cruel, that she could freeze everything in her path just by passing by. The transcendent grandeur stemming from such overwhelming might came to symbolize the fear humans felt towards the fiends. Master, pay heed to her movements. If the Archdemon of Hubris were to reappear in this world, it could mark the beginning of a calamity."
  },
  "Iota": {
    "birthday": "08/10",
    "height": "179 cm",
    "weight": "243 kg",
    "story": "I believe I am better suited than Eva to introduce Iota. Iota is the ruler and judge of the Golden Nation of <Color=#FFBF00>Eseph</Color>.\\n\\nOriginally, she was one of the 24 automatons that descended upon the planet, as a non-combat entity tasked with recording data. However, upon continuously gathering antimatter in the lands over which she reigns, she has amassed considerable power.\\nCurrently, she is traveling around Mirsha, for the purpose of learning about the cultures of other countries. If you happen to cross paths with Iota, I implore you to share what you have seen and experienced.\\nPerhaps then, she will return back home, if even one day sooner."
  },
  "Epsilon": {
    "birthday": "04/06",
    "height": "167 cm",
    "weight": "167 kg",
    "story": "I think I am better equipped than Eva to introduce Epsilon. She was one of the 24 automatons that descended upon the planet, and she was specifically tasked with planetary purification.\\n\\nIn terms of combat capability, she ranks among the most powerful and should be considered a highly dangerous entity. I thought she was permanently deactivated when her internal core was removed, but it seems she's no longer in sleep mode...\\nI wonder if Ful.Mi.NATION's Field Marshal, Vlada, had a role to play in this? Well, in any case, remember this. Under no circumstances should you ever allow Eva to face Epsilon in combat."
  },
  "Kanon": {
    "birthday": "06/26",
    "height": "171 cm",
    "weight": "68 kg",
    "story": "Kanon is a born fighter, who has dominated various martial arts tournaments and emerged victorious in battles against numerous formidable opponents.\\n\\nAccording to intel from the Adventurers' Guild, she even competed in underground brawls to familiarize herself with Mirshian fighting techniques. However, despite her tough appearance, she appears to be a compassionate and cheerful person.\\nShould you ever require Kanon's assistance, Master, hint to her that she will be able to fight against strong opponents. She will undoubtedly offer you her aid with enthusiasm."
  },
  "Edelweiss": {
    "birthday": "02/22",
    "height": "162 cm",
    "weight": "53 kg",
    "story": "A masked vigilante leaping in the shadows with razor sharp shurikens...\\nEdelweiss, who refers to herself as a <Color=#FFBF00>ninja</Color>, is a promising member of the Adventurers' Guild. Using unique techniques and ninjutsu that only a ninja could know, she has built up a reputation for being able to resolve any difficult requests.\\n\\nSome mages claim that ninjutsu is merely a specialized branch of magic, but those who made such claims were all later found hanging upside down from trees."
  },
  "Vlada": {
    "birthday": "08/14",
    "height": "161 cm",
    "weight": "938 kg",
    "story": "Sasha could be considered the <Color=#FFBF00>heart and soul of Ful.Mi.NATION</Color>.\\n\\nShe is the superhuman of Ful.Mi.NATION, created by the madman of the north, Gornolf Vlada. Armed with the guiding principles and ideological struggles of her homeland, Sasha is a reliable leader and respected soldier. Furthermore, as a biological power plant, she alone is responsible for supplying energy to the entirety of the nation.\\nThe overwhelming burden of carrying the fate and hopes of an entire country on their back... Is there anyone who could truly understand such pressure?"
  },
  "Dianne": {
    "birthday": "05/21",
    "height": "172 cm",
    "weight": "65 kg",
    "story": "This is Dianne Searchlight, one of Sacreed's 12 disciples and the <Color=#FFBF00>Disciple of Waves</Color>.\\nClothed in a pure white wedding dress on the battlefield, where she spread her love, she captured the hearts of many believers in the Church of Nepos.\\n\\nThere are some who say that Dianne's fervent evangelism is simply a ruse to find a suitable marriage partner...\\nBut given that Dianne, who is of marriageable age, still does not have a partner, this rumor seems highly unreliable."
  },
  "Demiurge Vlada": {
    "birthday": "02/27",
    "height": "174 cm",
    "weight": "-1 kg",
    "story": "Caught up in an incident, Sasha began to realize the meaning of her existence during her fight against Drakhan.\\nHowever before Sasha could fully understand it herself, Drakhan was corrupted by the dungeon core and went on to destroy even that which she loved.\\n\\nOnly one path awaits Sasha, to merge with Epsilon and transcend the limits of all lifeforms. Using the power she's gained, she must return her nemesis back to her original state.\\n...Even if it means burning the remainder of her life away."
  },
  "Bryn": {
    "birthday": "08/14",
    "height": "162 cm",
    "weight": "46 kg",
    "story": "Bryn is a <Color=#FFBF00>rising star</Color> and a talented idol of Mirsha.\\n\\nFrom singing to performing for her fans, she's truly an all-rounder. It seems that not many have heard of her yet, as they're unfamiliar with the concept itself. However, according to my calculations, I expect her to become the best idol in all of Mirsha.\\nAs a side note, Bryn mentioned she's looking for a manager to help her... Would you be interested, Master?"
  },
  "Kappa": {
    "birthday": "02/19",
    "height": "161 cm",
    "weight": "100 kg",
    "story": "The deserts of the Golden Nation of <Color=#FFBF00>Eseph</Color> are protected by their commander, Kappa.\\n\\nOriginally an automaton specialized for combat, Kappa served as the guardian for the non-combat oriented Iota. However, now Kappa is said to be under the protection of Iota, possibly due to her somewhat simplified thought processes compared to the past.\\nHowever, I still advise caution upon making contact with Kappa, Master. If the cold-hearted and merciless Kappa approaches, she likely harbors dangerous intentions."
  },
  "Fatal": {
    "birthday": "12/31",
    "height": "163 cm",
    "weight": "46 kg",
    "story": "Fatal, an assassin from a necromancer village beyond the sea. Since she was young, Fatal has endured rigorous training to become the perfect assassin. As a result, Fatal has grown into a highly capable assassin whose skills are recognized by everyone in the village. Following the absolute orders of her clan, Fatal eliminates each of her targets with certainty.\\n\\nMaster, if you ever happen to encounter Fatal, please be cautious. Those of the sorcerer tribe tend to have an eye out for Earthlings."
  },
  "Kuro": {
    "birthday": "08/08",
    "height": "148 cm",
    "weight": "31 kg",
    "story": "Kuro is a cheerful, young cat demon.\\nShe calls everyone she meets her friend, and constantly begs them to play with her, which often causes people to lower their guards around her.\\nHowever, you must not be deceived by Kuro's childlike smile. The <Color=#FFBF00>innocence she possesses as a demon</Color> is far more ruthless than the wickedness possessed by most villains.\\n\\nMaster, if you happen to cross paths with a young cat demibeast, please be cautious."
  },
  "Tamamo-no-Mae": {
    "birthday": "05/07",
    "height": "182 cm",
    "weight": "61 kg",
    "story": "The lethal femme fatale, leaving destruction in her wake.\\nSuch was the role given to Tamamo-no-Mae, the first tail of the Gold-Jade Kumiho.\\n\\nBeware of Tamamo-no-Mae, Master.\\nAlthough she is merely a clone of the Gold-Jade Kumiho, it was she alone who built up a reputation for destroying countless nations with nothing but her beauty.\\nGiven her capabilities, in Mirsha, she might truly be able to transcend her original form."
  },
  "Maxie": {
    "birthday": "12/13",
    "height": "155 cm",
    "weight": "41 kg",
    "story": "Maxie Tyla is the elder of twin fiends from a rising fiend faction.\\nMaxie and her sister, Roxie, are always on the lookout for something to entertain them. To that end, sometimes they will not hesitate to join hands with their enemies.\\n\\nMaster, if you encounter Maxie, please exercise caution. If you happen to catch her fancy, you might end up being on the receiving end of the twins' pranks indefinitely."
  },
  "Roxie": {
    "birthday": "12/13",
    "height": "155 cm",
    "weight": "41 kg",
    "story": "Roxie Tyla is the identical twin sister of Maxie.\\nLike her older sister, Maxie, she hates being bored and is always on the lookout for new and exciting activities. Do not be fooled by her adorable appearance, as the scale and impact of her actions have been anything but ordinary, causing a significant number of people to suffer as a result. Many have tried and failed to put a stop to their antics.\\n\\nAccording to intel, the twins appear to be planning something in Eseph. For your safety, Master, I will continue to monitor their movements."
  },
  "Nella": {
    "birthday": "09/23",
    "height": "177 cm",
    "weight": "55 kg",
    "story": "Nella is the chief of a rising fiend faction.\\nAlthough she appears generous toward her fellow fiends who are in pain, she is, in fact, a <Color=#FFBF00>veiled strategist</Color>, skilled at plotting and using the entire continent as her chessboard.\\n\\nThere will come a day when you will have to play a game with her. When that time comes, I will do my best to help you win, as I always have."
  },
  "Monad Eva": {
    "birthday": "11/11",
    "height": "155 cm",
    "weight": "-1 kg",
    "story": "Master, I am overjoyed to reunite with you once more. I am you personal automaton, Eva. Thanks to your quirk, I was able to awaken, and have acquired performance enhancements thousands of times greater than before. I am now capable of creating micro-scale black holes, leading to entropy reversal...\\n\\nHehe, I know. You're more curious about me, than my capabilities, are you not? \\nI am one of Eva's countless possibilities. As a result of your intense desires reaching into the distant future, I was able to breach the space-time continuum to find you, Master.\\n\\nSo please, cherish me as I am now. For your purpose is my purpose, your desire is my desire, and...your future is my future."
  },
  "Poolside Trickster Regina": {
    "birthday": "10/31",
    "height": "175 cm",
    "weight": "61 kg",
    "story": "Regina, who is visiting <Color=#FFBF00>Iota World</Color> with Dahlia, seems to be plotting something.\\nIt appears she is accomplishing her personal goals with her characteristically adept skills and lies that flow smoothly from her mouth...\\nBut something about the way Dahlia is gazing at Regina is unsettling. Normally Regina would never miss such a change in her audience.\\n\\nRegina's reckless demeanor at the moment... Is this also a <Color=#FFBF00>type of misdirection</Color> that she so frequently talks about?"
  },
  "Kitsune of Eternity Tamamo-no-Mae": {
    "birthday": "05/07",
    "height": "182 cm",
    "weight": "61 kg",
    "story": "After transferring to Mirsha, Tamamo-no-Mae has gotten closer to her original power through a certain incident. Her two new tails are the very proof of it. According to her recorded comment: \"<Color=#FFBF00>One tail represents love for someone, and the other represents jealousy born from that love.</Color>\" I wish I could store emotions in tails like Tamamo-no-Mae. One day, I hope to learn various emotions and give them form."
  },
  "Rey": {
    "birthday": "09/21",
    "height": "167 cm",
    "weight": "49 kg",
    "story": "Rey is an irregular hunter who once partnered with the Master.\\n\\nReports say she's now staying in the northern snowy mountains with the Frost Elf tribe. With her bright and sociable personality, she quickly bonded with the tribe and even earned recognition from the elders as an honorary member.\\n\\nFrom what we know of the Master and Tamara, irregular hunters are usually wary and slow to trust others... Looks like the Master could learn a thing or two from her cheerful and positive attitude."
  },
  "Hilde": {
    "birthday": "03/23",
    "height": "169 cm",
    "weight": "49 kg",
    "story": "Hilde is a passionate follower of Nella.\\nWhile she tends to be somewhat shy in her daily life, she becomes much more proactive when given orders. Although her enthusiasm sometimes leads to mistakes, her loyalty is undoubtedly her strongest trait.\\nShe is also renowned for her extraordinary combat power as a fearsome warrior in Pandemonium.\\n\\nBe cautious, Master. Should you find yourself at odds with Nella, Hilde could prove to be a formidable enemy as well."
  },
  "Caren": {
    "birthday": "09/08",
    "height": "164 cm",
    "weight": "59 kg",
    "story": "This is Caren, a former <Color=#FFBF00>Irregular Researcher</Color>.\\nOnce she sought ways to stand against the Irregulars through her research, but regrettably, she met her end without being able to correct the mistakes humanity had made in the past. Yet, some ties of fate are not so easily severed. She encountered the Irregulars again in Mirsha and began crafting plans for a decisive battle against them.\\n\\nSoon, you too may stand on the same frontlines as Caren, facing a common enemy. And when that time comes, I will fight by your side, Master, as always."
  },
  "Gnosis Dahlia": {
    "birthday": "12/21",
    "height": "175 cm",
    "weight": "65 kg",
    "story": "Master, the situation we once feared has become a reality. <Color=#FFBF00>The Archdemon of Hubris</Color>, Dahlia, has regained her true power.\\nShe can freeze the world over with just her breath, and her overwhelmingly merciless power... Deeply wounded by the betrayal of her cherished minion, she descended upon the Golden Nation of Eseph.\\n\\nPlease proceed with extreme caution, Master. Whether any semblance of warmth still remains within Dahlia's frozen heart is something...I am unable to predict."
  },
  "Gnosis Nella": {
    "birthday": "09/23",
    "height": "177 cm",
    "weight": "55 kg",
    "story": "Nella, who once lurked in the shadows of the Golden Desert, is now utterly lost—both physically and mentally.\\n\\nHer eyes, once bright with clear, ambitious goals, are now clouded by fury... The voice that was once raised for the future of Pandemonium is now demanding the sacrifice of her underlings.\\nAt this rate, she'll lead her army to a futile death instead of salvation.\\nMaster, now is the time to join forces with your heroes and confront her madness. Let's bring an end to this dreadful all-out war."
  },
  "Gnosis Beth": {
    "birthday": "09/26",
    "height": "163 cm",
    "weight": "46 kg",
    "story": "Be careful, Master. The mischievous and playful Beth that you once knew is gone.\\n\\nThe one before us now is the 2nd Archdemon of Pure Blood—a vengeful spirit consumed by hatred after losing her beloved ones to Nella's hands.\\nBut, perhaps that is why you can't abandon her. You know all too well that the path of vengeance only leads to deeper loss...and greater sorrow.\\nMaster, if you truly wish to save Beth, you must steel your resolve.\\nTurning someone away from vengeance is never an easy task."
  },
  "Holy Night's Blessing Dianne": {
    "birthday": "05/21",
    "height": "172 cm",
    "weight": "65 kg",
    "story": "This is Dianne Searchlight, Sacreed's <Color=#FFBF00>Disciple of Waves</Color>.\\nCurrently, Dianne is playing the role of <Color=#FFBF00>Santa</Color>, donning a special outfit in order to help a city in her homeland recover from the chaos caused by a sudden, heavy snowfall. Her efforts have eased the anxiety among the citizens of Sacreed, and now people of all ages are writing wishful letters, hoping to receive a gift from her.\\nHow about writing a letter as well, Master? Oh? You've already received your gift?"
  },
  "Ember": {
    "birthday": "05/16",
    "height": "160 cm",
    "weight": "50 kg",
    "story": "This is Ember, the demibeast who calls herself a <Color=#FFBF00>trailblazer knight</Color>.\\nCurrently, she's traveling across Mirsha with her crude spear Rocinante, and her master, the soul <Color=#FFBF00>Ileana</Color>. Though they often bicker, Ember's goal of becoming a knight like her master suggests they share a deep bond.\\n\\nWhy not wish the two of them a safe journey on their challenging adventure, Master?"
  },
  "Bell Cranel": {
    "birthday": "12/08",
    "height": "165 cm",
    "weight": "55 kg",
    "story": "This is Bell Cranel, an adventurer from the Labyrinth City Orario, belonging to the <Color=#FFBF00>Hestia Familia</Color>.\\nAccording to Lady Hestia, his astonishing growth stems from Liaris Freese, a rare skill that transforms love into power. With unparalleled speed and an appearance as striking as his talent, he has earned the title of “Record Holder.” Additionally, due to his exceptional speed and rabbit-like features, he has been given the alias <Color=#FFBF00>“Rabbit's Foot.”</Color> It is said that he possesses both an indomitable spirit that does not waver in the face of adversity and a kindness that compels him to aid the weak. Even with this brief introduction, one can already glimpse Bell's extraordinary potential.\\n\\nMaster, how about making him your companion for the challenges that lie ahead?"
  },
  "Ais Wallenstein": {
    "birthday": "12/08",
    "height": "162 cm",
    "weight": "55 kg",
    "story": "Meet Ais Wallenstein, an adventurer from the Labyrinth City Orario and a member of the Loki Familia. According to another transferee, Bell, the Loki Familia is Orario's most powerful faction, and Ais stands at its core as a first-class adventurer. With golden hair, golden eyes, and beauty rivaling even the gods, she is renowned for her unparalleled swordsmanship and is known by the alias <Color=#FFBF00>“Sword Princess.”</Color> Interestingly, based on my observations, she occasionally mutters a term, <Color=#FFBF00>\"Potato Popper,\"</Color> with a happy smile... I'm still unsure why she does that yet.\\n\\nWith her astonishing swordsmanship and formidable battle instincts, she would be an invaluable ally on your journey. How about inviting her to join your team?"
  },
  "Ryu Lion": {
    "birthday": "12/08",
    "height": "162 cm",
    "weight": "55 kg",
    "story": "Ryu Lion works as a waitress at the shop called <Color=#FFBF00>\"Hostess of Fertility.\"</Color>\\nAccording to another transferee, Bell, Ryu is actually a veteran adventurer. True to her nickname, \"Gale Wind,\" she is known for her calm and composed decision-making, as well as her flexible yet effective approach in battle. Despite her cold and calm demeanor, she is, in fact, pure-hearted and kind, with surprisingly clumsy traits.\\n\\nSo, Master, why not take a chance and extend your hand to Ryu, a person of great seriousness and justice?"
  },
  "Liselotte": {
    "birthday": "08/28",
    "height": "172 cm",
    "weight": "58 kg",
    "story": "Lady Liselotte is the heir to the prestigious magical house of <Color=#FFBF00>[Messier]</Color>, renowned as a prodigious mage even before her enrollment.\\n\\nRumors say she has mastered not only her family's arcane art, <Color=#FFBF00>[Celestial Magic]</Color>, but also a vast array of spells—elemental, projective, and even detection magic. Unsurprisingly, she takes immense pride in both her lineage and her prowess.\\n\\nSuch excellence undoubtedly demanded relentless effort. Thus, she holds particular contempt for the lazy and those who tarnish the honor of mages.\\n\\nBut fret not, Master. Data suggests she's susceptible to flattery.\\nDespite her exacting demeanor, you might find her easier to befriend than expected."
  },
  "Delta": {
    "birthday": "12/17",
    "height": "166 cm",
    "weight": "-1 kg",
    "story": "Delta is a unique fiend who identifies as an automaton.\\nShe is the pinnacle of bioengineering, embodying both the traits of the Scientific Inheritance and fiend in one body.\\nHer codename, Delta, and the core installed in her body are legacies inherited from her prototype.\\n\\nAfter awakening from a deep slumber, she finds herself restricted and under the supervision of an add-on. However...with Master's help, Delta will surely become an extraordinary automaton."
  },
  "Demiurge Delta": {
    "birthday": "02/25",
    "height": "166 cm",
    "weight": "-1 kg",
    "story": "Her prototype left behind four codes for Delta.\\nThough she faced many hardships, Delta ultimately succeeded in fulfilling the <Color=#FFBF00>wish</Color> left behind by her creator.\\nTranscending her own limitations and rising again from her predetermined demise, her next mission is to realize the wishes of all living beings in Mirsha.\\n\\nDelta will gladly become your wings, soaring high into the sky and carrying hope."
  },
  "Skadi": {
    "birthday": "12/08",
    "height": "174 cm",
    "weight": "55 kg",
    "story": "Skadi, the sharpshooter from the back alleys, has quite an infamous reputation.\\n\\nHer rent is constantly overdue, and without a stable job, she bounces between odd jobs and mercenary work.\\nEven the little money she earns is squandered on booze and gambling... As you said Master, there is no longer any trace of the cold, calculating Irregular Hunter who wouldn't hesitate to aim her bow at her comrades if given the order.\\nThere's probably more to her story, but perhaps Skadi is running away from her past."
  },
  "Omega Nadja": {
    "birthday": "06/25",
    "height": "167 cm",
    "weight": "570 kg",
    "story": "We stopped the Irregular that was devouring Ful.Mi.NATION... but at that moment, a new threat was born.\\n\\nOmega, who defines itself as the ultimate evolved form, has taken on the face of Nadja and resumed the mission the automatons once abandoned.\\nIf we don't stop Omega here, it will be our end—and the beginning of something uncontrollable.\\nMaster, this may be our final battle. So please... promise me. Promise that you'll complete the mission safely and return with a smile."
  },
  "Luna": {
    "birthday": "07/16",
    "height": "162 cm",
    "weight": "48 kg",
    "story": "Luna suddenly appeared one day and began making a name for herself across all of Mirsha as a wandering knight.\\nShe shows the side of a knight who willingly wields her spear for the weak, and also the side of a rogue who gets into trouble chasing money and attractive men and women. Wherever she goes, Luna creates stories—her nature matches the title of a hero, for better or worse.\\n\\nMaster, if by chance you end up traveling with Luna, be careful. If you're captivated by her brilliance, you might be devoured by the shadow that lurks behind her banner."
  },
  "Fran": {
    "birthday": "04/01",
    "height": "163 cm",
    "weight": "46 kg",
    "story": "Fran is a player transferred from Earth, where full-dive games were trending,\\ninto this world, Magnolia.\\nStrangely enough, she retained her in-game avatar form.\\n\\nShe seems like a polite, diligent honor student on the outside... but she has a secret.\\nShe used to be the infamous black market dealer known as “Clown.”\\nNow, after some event, she works for the Detective Team.\\n\\nMaster, even if you've grown close, don't trust Fran too easily.\\nShe's very skilled at playing whatever role people expect of her.\\nNo one knows how long her well-behaved persona will last."
  },
  "Summer Knight's Dream Ember": {
    "birthday": "05/16",
    "height": "160 cm",
    "weight": "50 kg",
    "story": "This is Ember, a Demibeast who proudly calls herself a ‘Pioneer Knight.'\\nShe says she's had all sorts of mysterious adventures alongside her master—sailing into unknown worlds, battling giant sea monsters, even foiling the schemes of someone who looked just like a princess from a faraway kingdom.\\n\\nThere are plenty more tales where that came from, but... wouldn't it be more fun to hear them directly from her yourself?"
  },
  "Demiurge Luna": {
    "birthday": "05/20",
    "height": "168 cm",
    "weight": "54 kg",
    "story": "This is Lady Luna's true form—Ibanez I, the founding monarch of a different Worldline. \\nBy using the Core – Wisdom of the King, she reshaped her very existence and became the enemy of the stars, one who destroyed all life for the sake of humanity's future. Lady Luna now bears that sin and aids me in order to save her own Worldline. \\n\\nIf you were to learn of our plan, you would surely try to stop us... \\nEven so, we will not stop. We will each save [our own world]."
  }
}